[
    {
        "title": "Illegally occupying Government/Panchayat Land? Supreme ... - SCC Online",
        "snippet": "In the present case, the lands on which the petitioners had constructed the houses vested in the Gram Panchayat. In the year 2000, the Government of Haryana framed a policy regarding sale of panchayat land in unauthorised possession inside outside the Abadi Deh and also amended the Punjab Village Common Lands (Regulation) Rules, 1964 and issued a notification dated 1.8.2001 in this regard.",
        "sentiment": "1 (Negative)",
        "link": "https://www.scconline.com/blog/post/2021/02/08/illegally-occupying-government-panchayat-land-supreme-court-says-you-cannot-claim-regularization-as-a-matter-of-right/",
        "base_query": "Abhishek Patidar",
        "keyword": "illegal construction on government land"
    },
    {
        "title": "Illegal Occupants Of Government/Panchayat Land Cannot Claim ...",
        "snippet": "Thus, as per Rule 12(4) of the 1964 Rules, the construction of the house on the panchayat land must have been put on or before 31.03.2000. It must be a non-cultivable land; does not result in any obstruction to the traffic and passerby and the illegal occupation/constructed area shall be up to a maximum of 200 square yards and then only the ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.legalservicesindia.com/law/article/1830/4/Illegal-Occupants-Of-Government-Panchayat-Land-Cannot-Claim-Regularization-As-A-Matter-Of-Right-SC",
        "base_query": "Abhishek Patidar",
        "keyword": "illegal construction on government land"
    },
    {
        "title": "illegal+construction | Indian Case Law - CaseMine",
        "snippet": "The 5 respondent submits that he has a house in his...District Collector has reported that there is no illegal construction on the Government land, and the petitioner ... This case was registered on a letter received from various citizens residing in the town of Harda indicating that on Government land, certain illegal construction is being ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.casemine.com/search/in/illegal+construction",
        "base_query": "Abhishek Patidar",
        "keyword": "illegal construction on government land"
    },
    {
        "title": "SUPREME COURT REAFFIRMS ITS STANCE ON ILLEGAL CONSTRUCTIONS - The ...",
        "snippet": "The Court further clarified that the illegal construction of a cinema theatre in a residential area materially affects the rights of the residents and cannot be allowed. ... 1957, by permitting a nursery school to be opened on land meant for a park in Sarita Vihar and by doing so misused its powers under the statutory provisions.",
        "sentiment": "1 (Negative)",
        "link": "https://theindianlawyer.in/supreme-court-reaffirms-its-stance-on-illegal-constructions/",
        "base_query": "Abhishek Patidar",
        "keyword": "illegal construction on government land"
    },
    {
        "title": "Supreme Court guidelines regarding demolition of construction by public ...",
        "snippet": "The State Government must act impartially and carry out its legal obligations to safeguard the life, health and well-being of Chakmas residing in the State without being inhibited by local politics. 24. This Court in unequivocal terms held that no State Government worth the name can tolerate threats by one group of person to another group of ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.lawweb.in/2025/01/supreme-court-guidelines-regarding.html",
        "base_query": "Abhishek Patidar",
        "keyword": "illegal construction on government land"
    },
    {
        "title": "Illegal Constructions Can't Be Regularised Irrespective of Long ...",
        "snippet": "The shops and commercial spaces had been illegally constructed by Respondent No. 5 and 6 on land allotted by Respondent No. 1, the U.P. Housing and Development Board, without obtaining the ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.livelaw.in/supreme-court/illegal-constructions-cant-be-regularised-irrespective-of-long-occupancy-investments-supreme-court-278720",
        "base_query": "Abhishek Patidar",
        "keyword": "illegal construction on government land"
    },
    {
        "title": "Construction Put Up In Violation Of Approved Building Plan By Local ...",
        "snippet": "Despite notices issued between 1990 and 2011 to stop the illegal construction, the violations continued. The demolition order was passed under Section 83 of the U.P. Avas Evam Vikas Parishad Adhiniyam, 1965. However, due to a lack of cooperation from the local authorities and the police, the demolition could not be executed.",
        "sentiment": "1 (Negative)",
        "link": "https://www.verdictum.in/court-updates/supreme-court/rajendra-kumar-barjatya-v-up-avas-evam-vikas-parishad-2024-insc-990-directions-for-demolition-of-structures-1561463",
        "base_query": "Abhishek Patidar",
        "keyword": "illegal construction on government land"
    },
    {
        "title": "What are legal remedies against illegal construction ,how to ... - LawRato",
        "snippet": "You will need to provide evidence to prove that the builder is engaged in illegal construction and that you will suffer irreparable harm if the construction continues. Draft the suit: Your lawyer will draft the suit for an injunction, which should include details of the illegal construction, the harm that it is causing you, and the relief that ...",
        "sentiment": "1 (Negative)",
        "link": "https://lawrato.com/property-legal-advice/what-are-legal-remedies-against-illegal-construction-how-to-stop-illegal-construction-249263",
        "base_query": "Abhishek Patidar",
        "keyword": "illegal construction on government land"
    },
    {
        "title": "Illegal occupation of government land, bully doing construction ...",
        "snippet": "Illegal Occupation Of Government Land, Bully Doing Construction सरकारी जमीन पर अवैध कब्जा, दबंग कर रहा निर्माण: सुलतानपुर कोर्ट ने लगाया था जुर्माना, ग्रामीणों ने की प्रमुख ...",
        "sentiment": "2 (Negative)",
        "link": "https://www.bhaskar.com/local/uttar-pradesh/sultanpur/news/illegal-occupation-of-government-land-bully-doing-construction-134327298.html",
        "base_query": "Abhishek Patidar",
        "keyword": "illegal construction on government land"
    },
    {
        "title": "Abhishek Patidar - DECA Games | LinkedIn",
        "snippet": "A Full Stack Developer from start of my career, always a go to guy for any problems in… · Experience: DECA Games · Education: Smt.Kashibai Navale college of Engineering · Location: Pune · 500+ connections on LinkedIn. View Abhishek Patidar's profile on LinkedIn, a professional community of 1 billion members.",
        "sentiment": "5 (Positive)",
        "link": "https://in.linkedin.com/in/iabhipatidar",
        "base_query": "Abhishek Patidar",
        "keyword": "illegal construction on government land"
    },
    {
        "title": "Abhishek Patidar - UNITED FOODS INTERNATIONAL (USA) INC - LinkedIn",
        "snippet": "Experienced with a demonstrated history of working in the fast-paced Manufacturing… · Experience: UNITED FOODS INTERNATIONAL (USA) INC · Education: University of Houston · Location: Phoenix ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.linkedin.com/in/abhishek-patidar",
        "base_query": "Abhishek Patidar",
        "keyword": "illegal construction on government land"
    },
    {
        "title": "Abhishek Patidar Profiles - Facebook",
        "snippet": "View the profiles of people named Abhishek Patidar. Join Facebook to connect with Abhishek Patidar and others you may know. Facebook gives people the...",
        "sentiment": "3 (Neutral)",
        "link": "https://www.facebook.com/public/Abhishek-Patidar/",
        "base_query": "Abhishek Patidar",
        "keyword": "illegal construction on government land"
    },
    {
        "title": "encroachment+on+government+land | Indian Case Law | Law",
        "snippet": "It is well settled that no illegal construction by anyone can be allowed and the encroachment on government land must be firmly dealt with. We, accordingly finally...illegal construction on government land as alleged in the petition, the same will be decided by the Commissioner, Jaipur Municipal Corporation, Jaipur within next sixty days by a ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.casemine.com/search/in/encroachment+on+government+land",
        "base_query": "Abhishek Patidar",
        "keyword": "illegal construction on government land"
    },
    {
        "title": "Illegal Construction - Online Legal Center",
        "snippet": "Illegal Construction The rapid growth in population, especially in the cities, has led to the growth in the number of illegal construction cases. Such illegal buildings are constructed without any legal document and proper authorization. Builders save money by skipping the proper registration process and some may even use sub-standard material to construct the building […]",
        "sentiment": "4 (Positive)",
        "link": "https://onlinelegalcenter.com/services/property-issues/illegal-construction/",
        "base_query": "Abhishek Patidar",
        "keyword": "illegal construction on government land"
    },
    {
        "title": "BiharBhumi -: The gateway to Revenue Bihar - Bihar Government",
        "snippet": "Department of Revenue and Land Reforms, Government of Bihar, Old Secretariat, Bailey Road, Patna - 800015 Site designed and developed by NIC, Bihar. Contents provided and maintained by Dept. of Revenue & Land Reforms, Government of Bihar.",
        "sentiment": "4 (Positive)",
        "link": "https://biharbhumi.bihar.gov.in/biharbhumi/",
        "base_query": "Abhishek Patidar",
        "keyword": "illegal construction on government land"
    },
    {
        "title": "Illegal Constructions Cannot Be Regularized: Supreme Court - Tax Guru",
        "snippet": "Without giving reply to the same, the Respondent No.5 continued to raise illegal commercial construction on the plot allotted to him. Thereafter, vide letter dated 27 .09 .2002, the Respondent No.1 instructed the Respondent No.5 to get the illegal construction regularized. But the Respondent No.5 did not respond to the same and he continued the ...",
        "sentiment": "1 (Negative)",
        "link": "https://taxguru.in/corporate-law/illegal-constructions-regularized-supreme-court.html",
        "base_query": "Abhishek Patidar",
        "keyword": "illegal construction on government land"
    },
    {
        "title": "How to deal with illegal construction on private land",
        "snippet": "Illegal construction on government land; Complaint against illegal construction in society; ASK YOUR QUESTION TALK TO A LAWYER. Answer #2. You can file a writ petition for direction of removal of encouragement on land ... or you can file a civil suit but it is time consuming.... you can also approach local police station a first information ...",
        "sentiment": "1 (Negative)",
        "link": "https://lawrato.com/property-legal-advice/how-to-deal-with-illegal-construction-on-private-land-52408",
        "base_query": "Abhishek Patidar",
        "keyword": "illegal construction on government land"
    },
    {
        "title": "Complaints of illegal construction, land grab, encroachments multiply",
        "snippet": "Complaints of illegal construction, land grab, encroachments multiply ... add a little portion illegally or building a house on government land ... of 9 wickets in big Goa CA XI win Abhishek Kumar ...",
        "sentiment": "2 (Negative)",
        "link": "https://timesofindia.indiatimes.com/city/goa/complaints-of-illegal-construction-land-grab-encroachments-multiply/articleshow/80915464.cms",
        "base_query": "Abhishek Patidar",
        "keyword": "illegal construction on government land"
    },
    {
        "title": "Supreme court issues landmark directives to curb illegal constructions",
        "snippet": "Representative image NEW DELHI: In a significant judgment, the Supreme Court on Tuesday said unauthorised constructions cannot be legitimised merely due to administrative delays, passage of time, or monetary investments and issued a slew of directions to curb illegal constructions.A bench comprising Justices J B Pardiwala and R Mahadevan said even the post-construction violations must trigger ...",
        "sentiment": "1 (Negative)",
        "link": "https://realty.economictimes.indiatimes.com/news/infrastructure/supreme-court-issues-landmark-directives-to-curb-illegal-constructions/116418735",
        "base_query": "Abhishek Patidar",
        "keyword": "illegal construction on government land"
    },
    {
        "title": "How to Stop Unauthorised Construction on Public Lands in India",
        "snippet": "The top two floors of the building would amount to unauthorised construction and will be illegal. The person doing the construction does not follow the guidelines prescribed by the government for the building's structure-type. Unauthorised Construction on Public Land; This happens, when the construction is being done on that land, the ...",
        "sentiment": "2 (Negative)",
        "link": "https://blog.ipleaders.in/unauthorised-construction-public-lands-india/",
        "base_query": "Abhishek Patidar",
        "keyword": "illegal construction on government land"
    },
    {
        "title": "UDA Demolished Illegal Construction on Hill at Bedla",
        "snippet": "The Udaipur administration took action against illegal hill cutting at Bedla, connected to Ambaya Magra, by demolishing unauthorized construction on government land. The land belongs to the government",
        "sentiment": "1 (Negative)",
        "link": "https://udaipurtimes.com/news/illegal-construction-bedla-land-demolished/cid15665107.htm",
        "base_query": "Abhishek Patidar",
        "keyword": "illegal construction on government land"
    },
    {
        "title": "Act against illegal construction in park land: HC - The Hindu",
        "snippet": "A bench of Chief Justice Raghvendra Singh Chauhan and Justice A. Abhishek Reddy, hearing a PIL petition on construction of temple in park land, said the authorities can pull down if a structure ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.thehindu.com/news/national/telangana/act-against-illegal-construction-in-park-land-hc/article30609143.ece",
        "base_query": "Abhishek Patidar",
        "keyword": "illegal construction on government land"
    },
    {
        "title": "irregular+and+illegal+construction | Indian Case Law | Law",
        "snippet": "Just because an order has been passed against the petitioner also and with regard to the irregular and illegal construction, I do not find any contempt against the order passed on ... of this Hon'ble Court about removal of illegal and unlawful construction on Government land.3. Upon notice having been issued affidavit - in ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.casemine.com/search/in/irregular+and+illegal+construction",
        "base_query": "Abhishek Patidar",
        "keyword": "illegal construction on government land"
    },
    {
        "title": "JUNOSYS NETWORKS PVT. LTD. on LinkedIn: Congratulations Abhishek ...",
        "snippet": "Congratulations Abhishek Patidar. We are so proud to have you in the team! Keep Growing, Keep Learning!",
        "sentiment": "5 (Positive)",
        "link": "https://www.linkedin.com/posts/junosys_congratulations-abhishek-patidar-we-are-activity-7088094750817357824-Cioa",
        "base_query": "Abhishek Patidar",
        "keyword": "illegal construction on government land"
    }
]