[
    {
        "title": "Ahmedabad crime branch busts multi crore Ayushman Card fraud linked to ...",
        "snippet": "The investigation revealed that the hospital had hosted a health camp on November 10 in Borisana (Kadi), where patient records were accessed and tampered with. Two computers containing critical data and original patient files were seized during the raid. The probe uncovered that fraudulent Ayushman Bharat cards were being created.",
        "sentiment": "1 (Negative)",
        "link": "https://english.gujaratsamachar.com/news/gujarat/ahmedabad-crime-branch-busts-multi-crore-ayushman-card-fraud-linked-to-khyati-hospital"
    },
    {
        "title": "Ayushman Bharat health card scam - Ayushman Bharat health card scam ...",
        "snippet": "Ahmedabad Police has uncovered a major Ayushman Bharat card scam involving Khyati Hospital, where 3,000 cards were fraudulently issued for Rs 1,500 each, enabling ineligible treatment. ... Police now focused on identifying how much money was extorted and the extent of fraudulent claims under the scheme. Published By:",
        "sentiment": "1 (Negative)",
        "link": "https://www.indiatoday.in/india/story/ayushman-bharat-health-card-scam-gujarat-police-6-arrested-khyati-hospital-fake-patients-2651167-2024-12-18"
    },
    {
        "title": "Ahmedabad crime branch busts Ayushman Card fraud linked to Khyati Hospital",
        "snippet": "During questioning, Mehul Patel, an employee managing the PMJAY desk revealed that Kartik Patel had directed Chirag Rajput to collaborate with Nimesh Dodiya for illegally creating Ayushman Bharat ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.hindustantimes.com/cities/others/ahmedabad-crime-branch-busts-ayushman-card-fraud-linked-to-khyati-hospital-101734452205203.html"
    },
    {
        "title": "Six held for Ayushman Bharat health card fraud linked to Khyati Hospital",
        "snippet": "According to investigators, the hospital management, at Kartik Patel's behest, hired ethical hacker Nimesh Dodia to fabricate Ayushman Bharat cards for ineligible patients.",
        "sentiment": "1 (Negative)",
        "link": "https://timesofindia.indiatimes.com/city/ahmedabad/six-held-for-ayushman-bharat-health-card-fraud-linked-to-khyati-hospital/articleshow/116409163.cms"
    },
    {
        "title": "More than 100 persons convicted in Vyapam scam cases so far",
        "snippet": "Among the latest convicted persons are a candidate in the Madhya Pradesh Police Constable Recruitment Test-2013, Om Prakash Tyagi, and a middleman named Satish Jatav. The CBI had taken over the ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.thehindu.com/news/national/more-than-100-persons-convicted-in-vyapam-scam-cases-so-far/article35685868.ece"
    },
    {
        "title": "Fake Ayushman Cards Scam: ED raids hospitals, seizes Rs 88 lakh in cash",
        "snippet": "Further, three cases pertaining to forged claims by hospitals empanelled under AB-PMJAY in Assam have been recorded by the ED, he said. Medical Dialogues had earlier reported that the Centre's health insurance scheme Ayushman Bharat Pradhan Mantri - Jan Arogya Yojana (AB PM-JAY) has crossed the milestone of generating 26 crore Ayushman cards across the country, the health ministry said in a ...",
        "sentiment": "1 (Negative)",
        "link": "https://medicaldialogues.in/news/health/hospital-diagnostics/fake-ayushman-cards-scam-ed-raids-hospitals-seizes-rs-88-lakh-in-cash-140216"
    },
    {
        "title": "Ayushman card scam: Khyati Hospital CEO remanded for 5 days",
        "snippet": "The crime branch got Rajput's custody in the second case and sought his remand for 14 days. The remand application mentioned that the investigator wanted to find out how many cards had Rajput got ...",
        "sentiment": "1 (Negative)",
        "link": "https://timesofindia.indiatimes.com/city/ahmedabad/ayushman-card-scam-khyati-hospital-ceo-remanded-for-5-days/articleshow/117154616.cms"
    },
    {
        "title": "Ahmedabad Crime Branch Unravels Multi-Crore Ayushman Bharat Card Scam ...",
        "snippet": "The Ahmedabad Crime Branch uncovered a significant fraud involving Ayushman Bharat card manipulation at Khyati Hospital, arresting eight people. The scheme, linked to hospital operator Mehul Patel, involved creating fake patient cards to claim government funds unlawfully—a strategic exposure of large-scale corruption in healthcare services.",
        "sentiment": "1 (Negative)",
        "link": "https://www.devdiscourse.com/article/headlines/3198099-ahmedabad-crime-branch-unravels-multi-crore-ayushman-bharat-card-scam-at-khyati-hospital"
    },
    {
        "title": "Key conspirator in Vyapam case gets 10 years in jail - National Herald",
        "snippet": "This is for the first time that such a large number of people have been sentenced to such long terms in the Vyapam scam. The court of Special Judge S.B. Sahu had ordered the arrest of all the accused. Out of 150 cases related to the Vyapam scam, this judgment relates to the 14th case and this is the first time the court has convicted all the ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.nationalheraldindia.com/national/key-conspirator-in-vyapam-case-gets-10-years-in-jail"
    },
    {
        "title": "Ayushman Bharat Hospital List 2025: Download PDF at hospitals.pmjay.gov.in",
        "snippet": "Step 4: give hospital ID, state, and district and all the suspended hospitals will show on screen. Download Ayushman Bharat Hospital List PDF Online. Step 1: Go to the PMJAY official website where you can find all the information on the dashboard. Step 2: To locate this option, navigate to the hospital list section of the scheme's main dashboard. Step 3: Choose the hospital list from the ...",
        "sentiment": "4 (Positive)",
        "link": "https://pmgovtschemehub.com/ayushman-bharat-hospital-list/"
    },
    {
        "title": "Ayushman Bharat (PMJAY) Hospitals List India - Download PDF - HexaHealth",
        "snippet": "The complete Ayushman Bharat hospital list can be found on the official PMJAY website. However, to find the nearest registered hospital under the PMJAY scheme, here's what you need to do. Step 1: Visit the PMJAY website, to get the Ayushman Bharat Hospital List. Click on 'Find Hospital' on the upper left bar",
        "sentiment": "4 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat"
    },
    {
        "title": "Critical Care & Ayushman Card Facility Hospital in West Indore",
        "snippet": "Greetings from our Indore hospital, which provides Ayushman Card facilities and cutting-edge critical care services. We put the health of our patients first and offer cutting-edge medical treatment for serious illnesses as one of the critical care hospital in West Indore. ... Dr. Pramod Neema. Director & Joint Replacement Surgeon. M.B.B.S., M.N ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.uniquehospitalindore.com/general_unique.php"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Indore - Download PDF - HexaHealth",
        "snippet": "To view the AB-PMJAY panelled hospitals in Indore, you need to visit the official website https://hospitals.pmjay.gov.in. Click on 'Find Hospitals' and enter Indore, along with the District, Hospital Type, Speciality, Hospital Name, and Empanelment Type. Click on the Search button and get the list of all hospitals in one place.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-indore"
    },
    {
        "title": "Ahmedabad Ayushman Card Hospital List - 1PDF",
        "snippet": "Ahmedabad Ayushman Card Hospital List. Ayushman Bharat hospitals list in Ahmadabad includes the top empanelled hospitals along with their address and contact details. To download the Ayushman Bharat Hospital list PDF in Ahmadabad, visit the official website. Select Ahmadabad, Hospital Type, Speciality, Empanelment Type and Click on 'Search'",
        "sentiment": "5 (Positive)",
        "link": "https://1pdf.in/ayushman-card-hospital-list-ahmedabad/"
    },
    {
        "title": "How to Make Ayushman Card - National Health Authority | GOI",
        "snippet": "How to Make Ayushman Card National Health Authority",
        "sentiment": "3 (Neutral)",
        "link": "https://nha.gov.in/Ayushman-Card"
    },
    {
        "title": "Ayushman Bharat PM-JAY - ESIC",
        "snippet": "3.Beneficiaries of ESIC can use their ESIS card to access free treatment at AB PM-JAY empanelled hospitals. 4.Similarly, beneficiaries of AB PM-JAY can use their PM-JAY card to access free treatment at ESIC empanelled hospitals. 5.For more information beneficiaries can call ESIC toll-free number: 1800 112 526/ 1800 113 839. For More Information. 1.",
        "sentiment": "5 (Positive)",
        "link": "https://www.esic.gov.in/ab-pm-jay"
    },
    {
        "title": "How to Use Ayushman Card in Private and Govt. Hospital? - HexaHealth",
        "snippet": "The Ayushman Bharat Yojna, popularly known as Pradhan Mantri Jan Sangh Aarogya Yojna, is a noble initiative that caters for providing necessary medical services to the less powerful economic sections of the country.The scheme allows a certain class of citizens to avail of these services, where they get an annual coverage of INR 5,00,000 to undergo any medical treatment which is necessary for ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.hexahealth.com/blog/how-to-use-ayushman-card-in-hospital"
    },
    {
        "title": "Haryana CHIRAYU Scheme | Find Govt Schemes India",
        "snippet": "Haryana CHIRAYU Scheme Helpline Number :- 14555. 06239504471. 06239504472. Directorate of Information, Public Relations & Languages, Haryana Contact Number :- 0172 ...",
        "sentiment": "1 (Negative)",
        "link": "https://findschemes.com/haryana-chirayu-scheme"
    },
    {
        "title": "Ayushman Bharat Vaya Vandana: Full, state-wise list of hospitals ...",
        "snippet": "As part of this new scheme, any individual issued an Ayushman Vaya Vandana card in 2024 will be entitled to receive cost-free medical treatment of up to Rs 5 lakh at any hospital that is linked ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.businesstoday.in/personal-finance/insurance/story/ayushman-bharat-vaya-vandana-full-state-wise-list-of-hospitals-entitled-to-serve-senior-citizens-for-ab-pm-jay-health-cover-452884-2024-11-07"
    },
    {
        "title": "smartcityhospital",
        "snippet": "+91 0755-2979500/501,9109101823,24; care@smartcityhospital.in; Bharat Scout & Guide Building,Depot Square,Shyamla Hills,Shanti Marg, Bhopal-462003(M.P.)",
        "sentiment": "1 (Negative)",
        "link": "https://www.smartcityhospital.in/alldoctor.php"
    },
    {
        "title": "Ayushman Bharat, Haryana | India",
        "snippet": "Welcome to the Official Government Website of Ayushman Bharat Haryana Health Protection Authority! At Ayushman Bharat, we are committed to realizing the vision of Universal Health Coverage (UHC) as outlined in the National Health Policy 2017.",
        "sentiment": "5 (Positive)",
        "link": "https://ayushmanbharat.haryana.gov.in/"
    },
    {
        "title": "3.42 lakh fraud cases detected under Ayushman Bharat-PMJAY ... - ThePrint",
        "snippet": "With 8.39 crore hospital admissions under the scheme, fraudulent cases are under 0.5%. Saturday, January 11, 2025 ... 3.42 lakh fraud cases detected under Ayushman Bharat-PMJAY. Over 56,000 unnecessary surgeries ... Medical industry uses this scheme to catch money sometime it's really emergency depend on case rather than they just compulsory ...",
        "sentiment": "1 (Negative)",
        "link": "https://theprint.in/india/3-42-lakh-fraud-cases-detected-under-ayushman-bharat-pmjay-over-56000-unnecessary-surgeries/2402377/"
    },
    {
        "title": "Ayushman Card Hospital List in Indore, Madhya Pradesh: Download PDF 2023",
        "snippet": "Ayushman Card Hospital List in Indore, Madhya Pradesh: Download PDF 2023. Ayushman Card Hospital List in Indore, Madhya Pradesh: Download PDF 2023. Skip to content. About us; ... GOKULDAS HOSPITAL PVT.LTD: 11,Dr.Sarju Prasad Marg South Tukoganj , Indore, Madhya Pradesh: 9826031212: 13:",
        "sentiment": "4 (Positive)",
        "link": "https://atozsarkarimahiti.com/ayushman-card-hospital-list-in-indore/"
    },
    {
        "title": "PMJAY Landing Page",
        "snippet": "Ayushman Bharat is the Pradhan Mantri Jan Arogya Yojna or PM-JAY as it is popularly known. This scheme was launched on 23rd September, 2018 in Ranchi, Jharkhand by the Hon'ble Prime Minister of India, Shri Narendra Modi. ... PM-JAY provides cashless access to health care services for the beneficiary at the point of service, that is, the ...",
        "sentiment": "5 (Positive)",
        "link": "https://hospitals.pmjay.gov.in/LandingPage.htm"
    },
    {
        "title": "Ayushman Card Hospital List: How to Check Eligible Hospitals for Free ...",
        "snippet": "If you face any issues while accessing the benefits of your Ayushman Card, you can contact the PMJAY Helpline at 14555. Tips to Maximize Ayushman Card Benefits. Keep Your Card Handy: Always carry your Ayushman Card for emergencies. Verify the Hospital: Check the empanelment status before visiting any hospital.",
        "sentiment": "5 (Positive)",
        "link": "https://krushimantri.com/ayushman-card-hospital-list-check-pmjay-benefits/"
    },
    {
        "title": "About Us - Chirayu Medical College & Hospital",
        "snippet": "In 2007, we founded Chirayu Air Products which established itself as a leading manufacturer and supplier of Oxygen, Nitrogen and Acetylene Gas. In 2010, Chirayu Medical College & Hospital (CMCH), a higher education institute with NABL and NABH accreditation and an ISO certified Hospital with 800 beds was founded. Dr.",
        "sentiment": "5 (Positive)",
        "link": "https://cmchbhopal.com/about/"
    },
    {
        "title": "Dr. Abhay Bhagwat - Neurologist in Indore - HexaHealth",
        "snippet": "Dr. Abhay Bhagwat is a Neurologist in Indore having 32 years of experience. View Dr. Abhay Bhagwat's contact number, fee and reviews. ... Synergy Hospital, Indore, etc. Doctor Abhay Bhagwat has contributed to handling numerous complex medical cases in several hospitals. ... Ayushman Bharat Card vs Health ID Piles in Men Piles vs Fissure vs ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.hexahealth.com/indore/doctor/dr-abhay-bhagwat-neurology"
    },
    {
        "title": "Chirayu National Hospital",
        "snippet": "Chirayu National Hospital and Medical Institute (CNHMI), strategically located at Maharajgunj, Kathmandu, is a private hospital providing ethical and personalized care within an infrastructure on par with the best facility in the country. CNHMI commenced its operation in December 2013, offering both out-patient services and in-patient services.",
        "sentiment": "5 (Positive)",
        "link": "https://www.chirayuhospital.com.np/"
    },
    {
        "title": "Eligibility Of Pradhan Mantri Ayushman Bharat Yojana - ClearTax",
        "snippet": "The benefits of the scheme can be availed at any government hospital or empanelled private hospital. The eligibility of beneficiaries targeted towards the poor, deprived rural families and identified occupational category of urban workers' families based on the Socio-Economic Caste Census (SECC) 2011 data.",
        "sentiment": "5 (Positive)",
        "link": "https://cleartax.in/s/pradhan-mantri-ayushman-bharat-yojana"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Haryana - Download PDF - HexaHealth",
        "snippet": "To view the AB-PMJAY panelled hospitals in Haryana, you need to visit the official website https://hospitals.pmjay.gov.in. Click on 'Find Hospitals' and enter Haryana, along with the District, Hospital Type, Speciality, Hospital Name, and Empanelment Type. Click on the Search button and get the list of all hospitals in one place.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-haryana"
    },
    {
        "title": "Ayushman Card Hospital List in Chennai",
        "snippet": "The document appears to be a list of 20 hospitals in Tamil Nadu, India that have been approved for empanelment under the PMJAY public health insurance program. It includes information on each hospital's ID number, name, location, contact details, specialties, and application status. All 20 hospitals are listed as having their empanelment application approved but not yet onboarded or having any ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.scribd.com/document/706070401/Ayushman-Card-Hospital-List-In-Chennai"
    },
    {
        "title": "Private Hospitals Caught in Fake Ayushman Card Reimbursement Scam",
        "snippet": "The Union Government revealed a fake Ayushman Cards scam involving empaneled hospitals; the ED seized Rs 88 lakh and probed Rs 25 crore in proceeds of crime. ... Ayushman Vaya Vandana Card to provide free hospital treatment to all above 70 years: ... Neelkanth Hospital for collection of the evidence of the offense of money-laundering. ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.ibtimes.co.in/private-hospitals-caught-fake-ayushman-card-reimbursement-scam-876809"
    },
    {
        "title": "Dr. Shaila Tyagi - Gynaecologist in Indore - HexaHealth",
        "snippet": "Dr. Shaila Tyagi is a Gynaecologist in Indore having 36 years of experience. View Dr. Shaila Tyagi's contact number, fee and reviews. Book an online appointment. Departments. ... Ayushman Card Download 2023: PMJAY Golden Card PDF Link. HexaHealth Care Team; Thursday, 27th October 2022 ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/indore/doctor/dr-shaila-tyagi-obstetrics-and-gynaecology"
    },
    {
        "title": "Ayushman Vaya Vandana Card 2025: How to Apply Online",
        "snippet": "The Ayushman Vaya Vandana Card would provide free hospital treatment to all seniors in the country who are over 70. With the new scheme, everyone who receives an Ayushman Vaya Vandana card in 2025 will get free medical care at any hospital associated with AB PMJAY up to Rs 5 lakh. Objective of Ayushman Vaya Vandana Card",
        "sentiment": "4 (Positive)",
        "link": "https://pmgovtschemehub.com/ayushman-vaya-vandana-card/"
    },
    {
        "title": "Dr. Sudheer Kumar Tyagi - Neuro Surgeon in Delhi - HexaHealth",
        "snippet": "Dr. Sudheer Kumar Tyagi is a Neuro Surgeon in Delhi having 34 years of experience. View Dr. Sudheer Kumar Tyagi's contact number, fee and reviews. ... Doctor Sudheer Kumar Tyagi has contributed to handling numerous complex medical cases in several hospitals. He is known for his attention to accurate diagnosis and for treating patients ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/DELHI/doctor/dr-sudheer-kumar-tyagi-neuro-surgery"
    },
    {
        "title": "ABHA health card — features, benefits and how to apply for card",
        "snippet": "The Ayushman Bharat Health Account (ABHA) is a health ID developed by the Indian government. This will allow you to easily share your health data such as health records and diagnostic records with ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.businessinsider.in/science/health/news/ayushman-bharat-health-account-features-benefits-and-how-to-apply-for-abha/articleshow/90933084.cms"
    },
    {
        "title": "List Of Empaneled Hospitals Under Ayushman Bharat Yojana For Free ...",
        "snippet": "Every senior citizen of the country above the age of 70 years will get free treatment in the hospital. Such elderly people will be given Ayushman Vaya Vandana Card. ... Ex-Servicemen Contributory Health Scheme (ECHS) and Ayushman Central Armed Police Force (CAPF) may either choose their existing scheme or opt for AB PM-JAY.",
        "sentiment": "4 (Positive)",
        "link": "https://zeenews.india.com/personal-finance/list-of-empaneled-hospitals-under-ayushman-bharat-yojana-for-free-treatment-check-direct-link-here-2813786.html"
    },
    {
        "title": "Hospital List For Ayushman Bharat Yojna",
        "snippet": "Hospital List for Ayushman Bharat Yojna - Free download as PDF File (.pdf), Text File (.txt) or read online for free. This document contains a list of 88 hospitals across Bhopal district that are empaneled to provide free Covid-19 treatment to beneficiaries of the Ayushman Bharat health insurance scheme. It includes the hospital name, ID number, contact details and bed capacity for each ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.scribd.com/document/507342154/Hospital-List-for-Ayushman-Bharat-Yojna"
    },
    {
        "title": "Dr. Abhay Yadav, MS » Norvic Hospital",
        "snippet": "Dr. Abhay Yadav, MS. ... WORK EXPERIENCE. Head of Department, Nepal Korea Friendship Hospital. (2011 - Present) Head of Department, Vayodha Hospital. (2011 - Present) Consultant, Scheer Memorial Hospital, Banepa. (2009 - 2011) With experience of 16 Years in the field of Orthopaedics, has performed more than 11,000 Surgical Cases of ...",
        "sentiment": "5 (Positive)",
        "link": "https://norvichospital.com/doctor/dr-abhay-yadav-ms/"
    },
    {
        "title": "Indian Kanoon - Search engine for Indian Law",
        "snippet": "Take notes as you read a judgment using our Virtual Legal Assistant and get email alerts whenever a new judgment matches your query (Query Alert Service).Try out our Premium Member Services-- Sign up today and get free trial for one month.",
        "sentiment": "1 (Negative)",
        "link": "https://indiankanoon.org/"
    },
    {
        "title": "Dr. Abhaya Kumar - Kokilaben Hospital",
        "snippet": "Dr. Abhaya Kumar is Consultant of Neurosurgeon and Spine Surgeon at Kokilaben Dhirubhai Ambani Hospital. Dr. Abhaya Kumar is connected with brain & nervous system, minimal access surgery departments. ... Dr. Abhaya Kumar has operated over 8000 cases in the last 15 years at KDAH. Of these 3500 have been Spine cases and 5500 are brain cases ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.kokilabenhospital.com/professionals/abhayakumar.html"
    },
    {
        "title": "PMJAY Hospital List Ahmedabad - A to Z Sarkari Mahiti",
        "snippet": "The scheme covers a total of 197 hospitals in Ahmedabad district including 122 private hospitals and 75 government hospitals. We have provided the name of the hospital, full address of the hospital and contact number of the hospital in the list of hospitals in Ahmedabad district that provide free treatment under the Ayushman card scheme.. If you want to get more detailed information about the ...",
        "sentiment": "4 (Positive)",
        "link": "https://atozsarkarimahiti.com/pmjay-hospital-list-ahmedabad/"
    },
    {
        "title": "State Health Agency,Punjab",
        "snippet": "Ayushman Bharat PM-JAY Mukh Mantri Sehat Bima Yojana (AB PM-JAY MMSBY), was launched on 20 August 2019 this is a flagship State Health Insurance Scheme for the beneficiaires of State of Punjab. ... REGISTRATION PROCESS FOR E-CARD GENERATION. Now generate e-card from home without visiting anywhere: Download 'Ayushman App' on mobile or visit ...",
        "sentiment": "5 (Positive)",
        "link": "http://www.sha.punjab.gov.in/shapunjab/index.php"
    },
    {
        "title": "Biggest money laundering cases in India - iPleaders",
        "snippet": "Biggest money laundering cases in the banking sector in India Punjab National Bank Fraud case Year of scandal - 2007-2017 Amount of money involved- around 11,400-13,500 crores . This is one of the most publicised and controversial money laundering cases in the history of India which shook the entire nation.",
        "sentiment": "1 (Negative)",
        "link": "https://blog.ipleaders.in/biggest-money-laundering-cases-in-india/"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Ranchi - Download PDF - HexaHealth",
        "snippet": "To view the AB-PMJAY panelled hospitals in Ranchi, you need to visit the official website https://hospitals.pmjay.gov.in. Click on 'Find Hospitals' and enter Ranchi, along with the District, Hospital Type, Speciality, Hospital Name, and Empanelment Type. Click on the Search button and get the list of all hospitals in one place.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-ranchi"
    },
    {
        "title": "Ayushman Card Correction 2025 Online! [e-KYC] abdm.gov.in, Document",
        "snippet": "The Ayushman Bharat Pradhan Mantri Jan Arogya Yojana (PM-JAY) is a flagship initiative of the Government of India aimed at providing financial protection to vulnerable families through health insurance. Beneficiaries under this scheme receive an Ayushman Card, which serves as proof of eligibility for medical coverage and other health benefits.",
        "sentiment": "4 (Positive)",
        "link": "https://hrybed.in/ayushman-card-correction-online/"
    },
    {
        "title": "List of Diseases Covered in Ayushman Bharat - Download PDF - HexaHealth",
        "snippet": "The Ayushman Bharat Yojana has led to the creation of new healthcare facilities and the strengthening of existing ones, which has improved the overall healthcare infrastructure in the country.. Access to Quality Healthcare: The Ayushman Bharat Covered Diseases List provides the beneficiaries with quality healthcare services.It ensures that they receive the necessary medical treatment without ...",
        "sentiment": "2 (Negative)",
        "link": "https://www.hexahealth.com/blog/ayushman-bharat-covered-diseases-list"
    },
    {
        "title": "Ayushman Card Hospital List Indore - 1PDF",
        "snippet": "Ayushman Card Hospital List Indore. Ayushman Card or Pradhan Mantri Jan Arogya Yojana (PMJAY) will provide financial protection (Swasthya Suraksha) to 10.74 crore poor, deprived rural families and identified occupational categories of urban workers' families as per the latest Socio-Economic Caste Census (SECC) data (approx. 50 crore beneficiaries).",
        "sentiment": "1 (Negative)",
        "link": "https://1pdf.in/ayushman-hospital-list-indore/"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Bhopal - Download PDF - HexaHealth",
        "snippet": "To view the AB-PMJAY panelled hospitals in Bhopal, you need to visit the official website https://hospitals.pmjay.gov.in. Click on 'Find Hospitals' and enter Bhopal, along with the District, Hospital Type, Speciality, Hospital Name, and Empanelment Type. Click on the Search button and get the list of all hospitals in one place.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-bhopal"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Thane - Download PDF - HexaHealth",
        "snippet": "To view the AB-PMJAY panelled hospitals in Thane, you need to visit the official website https://hospitals.pmjay.gov.in. Click on 'Find Hospitals' and enter Thane, along with the District, Hospital Type, Speciality, Hospital Name, and Empanelment Type. Click on the Search button and get the list of all hospitals in one place.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-thane"
    },
    {
        "title": "Dr Abhay Kumar (Ram Jyoti Children Hospital) - Newborn & Child ...",
        "snippet": "Dr Abhay Kumar is specialist in treating newborn, he gave new birth to many premature babies like treated babies of 800gm (min 2.5 kg). Dr Abhay Kumar is a Newborn & Child specialist in Begusarai with qualification MBBS, MD (Pediatrics from KGMU, Lucknow).",
        "sentiment": "5 (Positive)",
        "link": "https://drabhaykumarpeds.com/"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Mumbai - Download PDF - HexaHealth",
        "snippet": "To view the AB-PMJAY panelled hospitals in Mumbai, you need to visit the official website https://hospitals.pmjay.gov.in. Click on 'Find Hospitals' and enter Mumbai, along with the District, Hospital Type, Speciality, Hospital Name, and Empanelment Type. Click on the Search button and get the list of all hospitals in one place.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-mumbai"
    },
    {
        "title": "Ayushman Card Hospital List in Ahmedabad - ApniYojana.com",
        "snippet": "By viewing Ayushman Card Hospital List In Ahmedabad PDF, ... ESIC General Hospptal Naroda: AHMEDABAD: 9898261876: PMJAY: 34: UNIT HOSPITAL 100 BN RAF: AHMEDABAD: 9427308730: PMJAY: 35: ... templatemanager.in - Create PEB / VYAPAM TEMPLATE In Just 10 Sec. Ayushman Card Hospital List In Ahmedabad.",
        "sentiment": "4 (Positive)",
        "link": "https://apniyojana.com/ayushman-card-hospital-list-in-ahmedabad/"
    },
    {
        "title": "Ayushman Card PDF Download Online Process (3 Methods)",
        "snippet": "Step 6: Download the Ayushman Card. Next, select and tick the box beside the name whose Ayushman card is to be downloaded. Next, click on the 'Download' button. A pop-up will appear showing that the Ayushman card has been downloaded successfully. Next, click on the 'OK' button.",
        "sentiment": "5 (Positive)",
        "link": "https://www.govtjobslatest.in/ayushman-card-pdf-download-online/"
    },
    {
        "title": "Chirayu Medical College and Hospital",
        "snippet": "In a small 20-bed hospital in the year 1992, an establishment that would grow into one of Central India's biggest healthcare group was born. After 5 years of incredible hard work and a distant vision and efforts of our founder Dr. Ajay Goenka, we managed to upgrade into a premier super specialty hospital with 100 beds.",
        "sentiment": "5 (Positive)",
        "link": "https://cmchbhopal.com/"
    },
    {
        "title": "आयुष्मान भारत योजना (Mera PMJAY) पात्रता मापदंड और योग्यता",
        "snippet": "आयुष्मान भारत योजना पात्रता - मेरा पीएमजेएवाई आधिकारिक वेबसाइट पर आयुष्मान भारत योजना कार्ड के लिए विस्तृत पात्रता मानदंड ऑनलाइन देखें।",
        "sentiment": "4 (Positive)",
        "link": "https://www.hexahealth.com/hi/blog/ayushman-card-eligibility-in-hindi"
    },
    {
        "title": "Abhay Tyagi, PMP®, CMP Prosci®, CIM® - LinkedIn",
        "snippet": "A high-caliber, impact-driven professional with 11 years of proven expertise in IT… · Experience: Community Living Cambridge · Location: Waterloo · 500+ connections on LinkedIn. View Abhay Tyagi, PMP®, CMP Prosci®, CIM®'s profile on LinkedIn, a professional community of 1 billion members.",
        "sentiment": "5 (Positive)",
        "link": "https://ca.linkedin.com/in/abhay-tyagi-03354850"
    },
    {
        "title": "आयुष्मान कार्ड हॉस्पिटल लिस्ट इंदौर, नये बदलाव के साथ - Ayushman Card ...",
        "snippet": "templatemanager.in - PEB / VYAPAM TEMPLATE बनाइए मात्र 10 Sec. ... Ayushman Card private Hospital List in Indore. Ayushman Card Hospital List In Indore Madhya Pradesh. ... Dr Bhimrao Ambedkar Arthik Kalyan Yojana - मध्यप्रदेश डॉ भीमराव अंबेडकर आर्थिक कल् ...",
        "sentiment": "4 (Positive)",
        "link": "https://apniyojana.com/ayushman-card-hospital-list-in-indore/"
    },
    {
        "title": "आयुष्मान कार्ड हॉस्पिटल लिस्ट हरियाणा, जिले के अनुसार - Ayushman Card ...",
        "snippet": "Ayushman Card Hospital List In Haryana PDF . ऐसे गरीब भारतीय जिनके पास इलाज कराने के पैसे नही होते है और वो जो अस्‍पतालों में इलाज मंहगा होने के कारण इलाज नहीं करा पाते है उनके लिए ...",
        "sentiment": "1 (Negative)",
        "link": "https://apniyojana.com/ayushman-card-hospital-list-in-haryana/"
    },
    {
        "title": "Chirayu Health And M... v. Arun Kumar Manglik (S) - CaseMine",
        "snippet": "This case developed shock followed by sudden cardiac arrest which is a serious complication of dengue shock syndrome\". 20. Dr N.P. Mishra in his affidavit has stated that he was consulted on phone two to three times by the treating Dr Abhay Tyagi and also visited the Hospital around 06.30 p.m. to see the patient.",
        "sentiment": "1 (Negative)",
        "link": "https://www.casemine.com/judgement/in/5e4ef25746571b56b1ea51db"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Chandigarh - Download PDF - HexaHealth",
        "snippet": "To view the AB-PMJAY panelled hospitals in Chandigarh, you need to visit the official website https://hospitals.pmjay.gov.in. Click on 'Find Hospitals' and enter Chandigarh, along with the District, Hospital Type, Speciality, Hospital Name, and Empanelment Type. Click on the Search button and get the list of all hospitals in one place.",
        "sentiment": "1 (Negative)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-chandigarh"
    },
    {
        "title": "Ayushman Card List 2025: State Wise Beneficiary List Search",
        "snippet": "Check Out State Wise Ayushman Card List Online at beneficiary.nha.gov.in Portal with Family ID, Aadhar Card and Ration Card Number ... The scheme was launched by the government to provide free healthcare to around 50 crore people by covering their hospital expenses. The scheme will provide up to 5 lakh per family per year in health insurance ...",
        "sentiment": "4 (Positive)",
        "link": "https://pmgovtschemehub.com/ayushman-card-list/"
    }
]