[
    {
        "title": "Hospital owner gets extortion threat, 1 booked",
        "snippet": "Dr Ajit Gupta, chairman of Park Group of Hospitals, filed a complaint against Pawan Pilana of NGO Jagriti Sanstha for threatening to defame the hospital if Gupta refused to pay him Rs 20 lakh ...",
        "sentiment": "1 (Negative)",
        "link": "https://timesofindia.indiatimes.com/city/gurgaon/Hospital-owner-gets-extortion-threat-1-booked/articleshow/50155919.cms"
    },
    {
        "title": "Park group chief gets extortion call | Gurgaon News - Times of India",
        "snippet": "According to the police, Dr Ajit Gupta, chairman of the Park group of hospitals, which has a hospital in Sector 47, has lodged a complaint, claiming that he had received the threat call from the ...",
        "sentiment": "1 (Negative)",
        "link": "https://timesofindia.indiatimes.com/city/gurgaon/Park-group-chief-gets-extortion-call/articleshow/47873016.cms"
    },
    {
        "title": "In conversation with Dr. Ankit Gupta on the journey of trust, quality ...",
        "snippet": "Cut to 2004, Dr. Ajit Gupta's son, Dr. Ankit Gupta, carried ahead the legacy of the hospital chain a step further when he took over as Park Group Hospital's Managing Director.Under his dynamic ...",
        "sentiment": "5 (Positive)",
        "link": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/in-conversation-with-dr-ankit-gupta-on-the-journey-of-trust-quality-and-future-expansion-at-park-group-of-hospitals/articleshow/103962887.cms"
    },
    {
        "title": "Know more about Park Hospital, who we are and our people",
        "snippet": "In 1982, Dr. Ajit Gupta, Founder , Park Group of Hospitals, envisaged the group to be a collection of medical services and facilities with commitment and compassion to deliver high quality patient-centric healthcare. This journey of social responsibility started with the establishment of the first hospital in Malviya Nagar, South Delhi.",
        "sentiment": "4 (Positive)",
        "link": "https://www.parkhospital.in/about-us"
    },
    {
        "title": "Dr. Ajit Gupta, New Delhi vs Acit, New Delhi on 23 January, 2019",
        "snippet": "Dr. Ajit Gupta, New Delhi vs Acit, New Delhi on 23 January, 2019 ... ACIT, C/o. Park Hospital, Circle-61(1), 12, Meera Enclave, Near New Delhi Keshopur Depot, Outer Ringh Road, New Delhi PAN: AAHPG3320Q (Appellant) (Respondent) Assessee by : None Revenue by: Shri Naina Soin Kapil, Sr. DR Date of Hearing 23/01/2019 Date of pronouncement 23/01 ...",
        "sentiment": "1 (Negative)",
        "link": "https://indiankanoon.org/doc/85309763/"
    },
    {
        "title": " Park Medi World Private Limited (Revised) September 13, 2023",
        "snippet": "subsidiaries, i.e, DMR Hospital Pvt Ltd and Aggarwal Hospital and Research Services Pvt Ltd, respectively. There are certain upcoming hospitals in Patiala, Panchkula and Rohtak. The promoters of the company are Dr Ajit Gupta and Dr Ankit Gupta. Brief Financials (₹ crore) 31-03-2022 (A) 31-03-2023 (Prov) Q1FY24 (UA)",
        "sentiment": "1 (Negative)",
        "link": "https://www.careratings.com/upload/CompanyFiles/PR/202309120942_Park_Medi_World_Private_Limited.pdf"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Dr. Ajit Gupta Founder \"The Source of Our Inspiration & Vision\" Dr. Ajit Gupta is the Founder of the Park Group of Hospitals. His avid passion for subject of healthcare in respect of quality & affordability combined with his business acumen and innovative thinking is behind the meteoric growth of Park Group of Hospitals, making it among the fastest growing chain of Super Speciality affordable ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/visionaries"
    },
    {
        "title": "Park Group of Super Speciality Hospitals - innayatmedical.com",
        "snippet": "Overview of Park Group of Super Speciality Hospital in Delhi. In 1982, Dr. Ajit Gupta, Chairman, Park Group of Hospitals envisaged the group to be a collection of medical services and facilities with commitment and compassion to deliver high quality patient-centric healthcare.",
        "sentiment": "4 (Positive)",
        "link": "https://www.innayatmedical.com/hospital/park-group-of-super-speciality-hospitals"
    },
    {
        "title": "North India's Fastest-growing Chain Of Super-specialty Hospitals Plans ...",
        "snippet": "Being one of the pioneers in healthcare in India, Dr. Ajit Gupta's vision has made Park Hospitals carve a respected place among the largest healthcare service providers in North India.",
        "sentiment": "5 (Positive)",
        "link": "https://www.prnewswire.com/in/news-releases/north-india-s-fastest-growing-chain-of-super-specialty-hospitals-plans-further-expansion-842280996.html"
    },
    {
        "title": "Dr. Ankit Gupta - EverybodyWiki Bios & Wiki",
        "snippet": "Dr. Ankit Gupta was born on Jan 21, 1982 to Dr. Ajit Gupta, Chairman of Park Group of hospitals and the late Mrs. Usha Gupta. He graduated with an MBBS degree from Bharti Vidyapeeth Deemed University in 2005. Before becoming the MD of Park Group of Hospitals in 2006, he was studying and getting trained under the guidance of Dr. Ajit Gupta.",
        "sentiment": "4 (Positive)",
        "link": "https://en.everybodywiki.com/Dr._Ankit_Gupta"
    },
    {
        "title": "The Revolutionary Father-Son Duo Behind The Prospering ... - Park Hospital",
        "snippet": "Unfortunately, everyone in society doesnt get access to best healthcare services because of which, in recent times, Coronavirus could impact the lives and livelihoods of uncountable masses.Likewise, there are many health-related issues that disastrously affect people every day and this is what instigated Dr. Ajit Gupta, Chairman, Park Group of Hospitals, in 1982 to deliver best medical ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.parkhospital.in/media-room/the-revolutionary-father-son-duo-behind-the-prospering-healthcare-industry"
    },
    {
        "title": " Park Medi World Private Limited - Credit Rating",
        "snippet": "Park Group is promoted by Dr Ajit Gupta, who possesses a rich experience of over three and a half decades in the healthcare sector. Dr Ankit Gupta is the Co-founder and Managing Director of the Park group of hospitals. The 38-year-old completed his MBBS from Bharati Vidyapeeth, Pune. He started serving along with his father in a small hospital ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.careratings.com/upload/CompanyFiles/PR/22072022061505_Park_Medi_World_Private_Limited.pdf"
    },
    {
        "title": "Park Group of Hospitals: Committed to Cost-Effective Healthcare ...",
        "snippet": "Our main strength is the rates at which we offer affordable healthcare to the patients, which doesnt mean that we compromise with the quality of the treatment. I believe that every individual deserves expert & affordable health treatment, irrespective of their financial status, shares Dr Ajit Gupta, Philanthropist, Founder & Chairman of Park Group of Hospitals with Elets News Network (ENN)",
        "sentiment": "4 (Positive)",
        "link": "https://ehealth.eletsonline.com/2016/08/park-group-of-hospitals-committed-to-cost-effective-healthcare-services-without-compromising-quality/"
    },
    {
        "title": "Advanced Robotic-Assisted Surgery Debuts at Park Hospital Gurugram ...",
        "snippet": "About Park Group of Hospitals The Park Group of Hospitals, accredited by NABH and NABL, continues to set new benchmarks in healthcare excellence. Founded in 1982 by Dr. Ajit Gupta, the group has grown into a network of over 4,000 beds, including 800 ICU beds, staffed by more than 1,200 super specialists and 8,000 paramedical staff.",
        "sentiment": "5 (Positive)",
        "link": "https://www.theweek.in/wire-updates/business/2024/08/30/dcm38-park-hospital.html"
    },
    {
        "title": "Park Hospital - India | about.me",
        "snippet": "The name Park Group of Hospital was coined by Dr. Ajit Gupta and the tradition of his rich legacy is being carried forward by his son Dr. Ankit Gupta, Managing Director. ... Dr. Ankit Gupta believes in maintaining the great reputation of the Park Group of Hospitals with business acumen for viability while sustaining the legacy of providing ...",
        "sentiment": "5 (Positive)",
        "link": "https://about.me/parkhospital"
    },
    {
        "title": "Grecian Hospital Mohali is now part of Park Hospital - Punjab News Express",
        "snippet": "The Park Group was started by Dr. Ajit Gupta, founder and chairman, Park Group of Hospitals and Signature Hospital in 1982 with a 50 bedded hospital which has now become North India's fastest growing chain of super speciality hospitals. His son Dr. Ankit Gupta later joined as MD.",
        "sentiment": "5 (Positive)",
        "link": "https://www.punjabnewsexpress.com/health/news/grecian-hospital-mohali-is-now-part-of-park-hospital-208876"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Park Group of Hospitals has witnessed incredible growth to become one of the most advanced & comprehensive healthcare institutions in the region. ... 2021-Present. Our Journey. 1982 The 1st step was taken with start of Dr. Ajit Gupta's Clinic . 1992 Commissioned Navjeevan Nursing Home in South Delhi . 1999",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/our-journey"
    },
    {
        "title": "Park Hospital - Super Speciality - Sector 47, Gurgaon",
        "snippet": "In 1982, Dr. Ajit Gupta, Chairman, Park Group of Hospitals, envisaged the group to be a collection of medical services and facilities with commitment and compassion to deliver high quality patient-centric healthcare. This journey of social responsibility started with the establishment of the first hospital in Malviya Nagar, South Delhi.",
        "sentiment": "5 (Positive)",
        "link": "http://medigurgaon.com/HospitalProfile.php?id=H023"
    },
    {
        "title": "Park Group of Hospitals | LinkedIn",
        "snippet": "Park Group of Hospitals | 3,033 followers on LinkedIn. Park Group of Hospital is the fastest growing chain of hospitals in Delhi NCR, which presently has over 1500 beds, and has attained supremacy in the field of healthcare with its crème-de-la-crème tertiary medical care. Started by Dr Ajit Gupta in 1982, with Park Sunil Hospital in Malviya Nagar as the first one, and now it has 8 hospitals ...",
        "sentiment": "5 (Positive)",
        "link": "https://in.linkedin.com/company/parkgroupofhospitals"
    },
    {
        "title": "Park Group of Hospitals - LinkedIn",
        "snippet": "Started by Dr Ajit Gupta in 1982, with Park Sunil Hospital in Malviya Nagar as the first one, and now it has 8 hospitals in Northern India, including Gurgaon, Delhi, Faridabad, Panipat and Hodal.",
        "sentiment": "5 (Positive)",
        "link": "https://www.linkedin.com/company/parkgroupofhospitals"
    },
    {
        "title": "In conversation with Dr. Ankit Gupta on the journey of… - inkl",
        "snippet": "A philanthropist and leader in India's healthcare industry, Dr. Ajit Gupta dreamt of serving people since childhood. With this vision, zeal and sustained efforts, he founded the Park Group of Hospitals in 1982. The chain of hospitals aims to provide personalised quality treatment with state-of-the-art equipment and technology to common…",
        "sentiment": "5 (Positive)",
        "link": "https://www.inkl.com/news/in-conversation-with-dr-ankit-gupta-on-the-journey-of-trust-quality-and-future-expansion-at-park-group-of-hospitals"
    },
    {
        "title": "Park Hospital Gurgaon - 365Doctor.in",
        "snippet": "In 1982, Dr. Ajit Gupta, Chairman, Park Group of Hospitals, envisaged the group to be a collection of medical services and facilities with commitment and compassion to deliver high quality patient-centric healthcare. This journey of social responsibility started with the establishment of the first hospital in Malviya Nagar, South Delhi ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.365doctor.in/hospital/park-hospital-gurgaon"
    },
    {
        "title": "Our Management - narenrawat8102.github.io",
        "snippet": "Dr. Ajit Gupta is the Founder Chairman of the Park Group of Hospitals. His avid passion for subject of healthcare in respect of quality & affordability combined with his business acumen and innovative thinking is behind the meteoric growth of Park Group of Hospitals, making it among the fastest growing chain of Super Speciality affordable hospitals in Delhi NCR & Haryana After successfully ...",
        "sentiment": "5 (Positive)",
        "link": "https://narenrawat8102.github.io/Park-Hospital/about-us/management.html"
    },
    {
        "title": "Park Group of Hospitals - LinkedIn",
        "snippet": "Started by Dr Ajit Gupta in 1982, with Park Sunil Hospital in Malviya Nagar as the first one, and now it has 8 hospitals in Northern India, including Gurgaon, Delhi, Faridabad, Panipat and Hodal.",
        "sentiment": "5 (Positive)",
        "link": "https://www.linkedin.com/company/parkgroupofhospitals/?originalSubdomain=in"
    },
    {
        "title": "Dr. Ajit Saxena - Metro Group of Hospitals",
        "snippet": "Dr. Ajit Saxena is a senior paediatrician involved in care of newborn and children for more than 10 years. Education. MBBS - MGIMS, Sewagram (1999)",
        "sentiment": "4 (Positive)",
        "link": "https://www.metrohospitals.com/doctor/dr-ajit-saxena/"
    },
    {
        "title": "North India's fastest-growing chain of super-specialty hospital plans ...",
        "snippet": "Park Group of Hospitals added 5 new hospitals to its chain of hospitals from FY 2019 to FY 2021 alone, which is truly unheard of in the business of individually owned hospitals. ... Being one of the pioneers in healthcare in India, Dr Ajit Gupta's vision has made Park Hospitals carve a respected place among the largest healthcare service ...",
        "sentiment": "5 (Positive)",
        "link": "https://theprint.in/ani-press-releases/north-indias-fastest-growing-chain-of-super-specialty-hospital-plans-further-expansion/674152/"
    },
    {
        "title": "Advance Super Multi Speciality Hospital in Gurugram Sector 37D",
        "snippet": "Signature Hospital, part of Park Hospital is a fully-equipped private hospital with state-of-the-art medical facilities, 300 plus beds multispecialty hospital in Gurugram",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/hospital/super-multispeciality-hospital-in-gurgaon-37D"
    },
    {
        "title": "Park Hospital Delhi,Contact Number, Doctors List, Address - 365Doctor.in",
        "snippet": "Park Hospital Delhi. Park Hospital Delhi - In 1982, Dr. Ajit Gupta, Chairman, Park Group of Hospitals, envisaged the group to be a collection of medical services and facilities with commitment and compassion to deliver high quality patient-centric healthcare. This journey of social responsibility started with the establishment of the first hospital in Malviya Nagar, South Delhi.",
        "sentiment": "5 (Positive)",
        "link": "https://www.365doctor.in/best-hospital-in-delhi/park-hospital-delhi"
    },
    {
        "title": "Park Hospital, Sector 47, Gurgaon - Credihealth",
        "snippet": "The park group of hospitals is the most exponential hospital in the area. The name was first coined by Dr. Ajit Gupta who also laid the foundation of the hospitals in Malviya Nagar. With his rich legacy and the efforts of the son Dr. Ankit Gupta, the hospital currently trends in the healthcare line.",
        "sentiment": "5 (Positive)",
        "link": "https://www.credihealth.com/hospital/park-hospital-sector-47"
    },
    {
        "title": "Dr. Ajit Gupta, Trauma Surgeon - Bimr Hospital - Sehat",
        "snippet": "Profile of Dr. Ajit Gupta, Trauma Surgeon in Gwalior: Get complete information about Dr. Ajit Gupta MBBS, MS (Ortho), MC practicing at Bimr Hospital, his specialities, expertise with complete address, appointment phone numbers, timings, awards and associated hospital information | Sehat",
        "sentiment": "5 (Positive)",
        "link": "https://www.sehat.com/dr-ajit-gupta-trauma-surgery-doctor-gwalior"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Park Group of Hospitals, situated in North India, is a landmark healthcare entity of global standards. The Group is undergoing rapid expansion making in North India's fastest-growing chain of super-speciality hospitals including cancer and tertiary level care where patients continue to flock seeking medical intervention and care in the state-of-the-art facilities for various ailments.",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/"
    },
    {
        "title": "Park Group of Hospitals Information - RocketReach",
        "snippet": "Park Group of Hospital is the fastest growing chain of hospitals in Delhi NCR, which presently has over 1500 beds, and has attained supremacy in the field of healthcare with its crème-de-la-crème tertiary medical care. ... Started by Dr Ajit Gupta in 1982, with Park Sunil Hospital in Malviya Nagar as the first one, and now it has 8 hospitals ...",
        "sentiment": "5 (Positive)",
        "link": "https://rocketreach.co/park-group-of-hospitals-profile_b45d3b00fc639471"
    },
    {
        "title": "Metro Hospital Park Group, Palam Vihar, Gurgaon - Credihealth",
        "snippet": "Metro Hospital Park Group, Palam Vihar, Gurgaon is a multi-speciality hospital. Get Metro Hospital Park Group, Palam Vihar, Gurgaon address, doctor list, reviews, and book online appointment on Credihealth. ... With the efforts and hard work of the chairman Dr. Ajit Gupta, the staff of the hospital has become capable of bringing the trends of ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.credihealth.com/hospital/metro-hospital-park-group-palam-vihar"
    },
    {
        "title": "Advance Super Multi Speciality Hospital in New Delhi | Park Hospital",
        "snippet": "Park Hospital is a fully-equipped private hospital with state-of-the-art medical facilities, 250 plus beds multispecialty hospital in Delhi ... Delhi is an ambitious initiative from Park Group. This is a fully-equipped private hospital in Delhi with all state-of-the-art medical facilities. ... Dr Richa Gupta. Senior Consultant. Obstetrics ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/hospital/super-multispeciality-hospital-in-Delhi"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Park hospital is the fastest growing chain of advanced super speciality hospitals, Provides patients with best & affordable healthcare treatment. Signature Hospital",
        "sentiment": "4 (Positive)",
        "link": "https://www.parkhospital.in/meet-our-management"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Park hospital is the fastest growing chain of advanced super speciality hospitals, Provides patients with best & affordable healthcare treatment. ... Park hospital is the fastest growing chain of advanced super speciality hospitals, Provides patients with best & affordable healthcare treatment. ... Dr. Ritika Gupta. Consultant. Obstetrics ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/doctors/dr-ritika-gupta"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Park hospital is the fastest growing chain of advanced super speciality hospitals, Provides patients with best & affordable healthcare treatment. ... Dr. Ankit Gupta, Managing Director, Park Group of Hospitals awarded by Sri S.M. Venkaiah Naidu Vice President of India ... Approved for Organ Transplant",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/awards-and-accolades"
    },
    {
        "title": "List of Best Hospitals, Clinics In Gurgaon | We Are Gurgaon",
        "snippet": "6. Kalyani Hospital Gurgaon. Contact Person - Dr. S C Khanna Bed Capacity - 105. Contact No. 0124-2303101-03. Location: Anamika Enclave, Mehrauli-Gurgaon Road, Opposite Government Girls College, Sector 14, Gurugram, Haryana 122001",
        "sentiment": "5 (Positive)",
        "link": "https://wearegurgaon.com/hospitals-list-gurgaon-haryana/"
    },
    {
        "title": "On the journey of trust, quality and future expansion… - inkl",
        "snippet": "A philanthropist and leader in India's healthcare industry, Dr. Ajit Gupta dreamt of serving people since childhood. With this vision, zeal and sustained efforts, he founded the Park Group of Hospitals in 1982. The chain of hospitals aims to provide personalised quality treatment with state-of-the-art equipment and technology to common…",
        "sentiment": "5 (Positive)",
        "link": "https://www.inkl.com/news/on-the-journey-of-trust-quality-and-future-expansion-at-park-group-of-hospitals-dr-ankit-gupta"
    },
    {
        "title": "Dr. Ajit Gupta - Consultant Physician - Book Appointment ... - Practo",
        "snippet": "Dr. Ajit Gupta is Consultant Physician in Sector 20 , Chandigarh. Book appointments Online, View Fees, User Feedbacks for Dr. Ajit Gupta | Practo. ... Medicine from Government Medical College & Rajendra Hospital,Punjabi University,Patiala in 1968. He is a member of Indian Medical Association (IMA) and Medical Council of India (MCI).",
        "sentiment": "1 (Negative)",
        "link": "https://www.practo.com/chandigarh/doctor/dr-ajit-gupta-gynecologist-obstetrician"
    },
    {
        "title": "Dr. Ajit Gupta & Sangita Gupta Hospital Sector 12 Panchkula - Sulekha",
        "snippet": "Dr. Ajit Gupta & Sangita Gupta Hospital in Sector 12, Panchkula-134109-Get Dr. Ajit Gupta & Sangita Gupta Hospital in Sector 12 address, phone numbers, user ratings, reviews, contact person and quotes instantly to your mobile on Sulekha.com.",
        "sentiment": "1 (Negative)",
        "link": "https://www.sulekha.com/dr-ajit-gupta-sangita-gupta-hospital-sector-12-panchkula-contact-address"
    },
    {
        "title": "Park Hospitals, Delhi & Gurugram Requires Consultants",
        "snippet": "Park Hospitals Delhi & Gurugram . Date of Posting: 02/05/2024. Hiring Institute: Park Hospitals, Delhi & Gurugram Designation: Park Group of Hospitals, equipped with world class facilities has witnessed incredible growth to become one of the most advanced and comprehensive healthcare institutions in the region.The name Park Group of Hospital was coined by Dr. Ajit Gupta and the tradition of ...",
        "sentiment": "5 (Positive)",
        "link": "https://facultytub.com/park-hospitals-delhi-gurugram-requires-consultants/"
    },
    {
        "title": "Dr.AJIT GUPTA - Contact Details for Appointment - Sehat",
        "snippet": "Profile of Dr.AJIT GUPTA in Shahdol: Get complete information about Dr.AJIT GUPTA , his specialities, expertise, address, appointment phone numbers, timings, awards and associated hospital information | Sehat",
        "sentiment": "5 (Positive)",
        "link": "https://www.sehat.com/dr-ajit-gupta-shahdol"
    },
    {
        "title": "North India's Fastest-growing Chain Of Super-specialty Hospitals Plans ...",
        "snippet": "Park Group of Hospitals added 5 new hospitals to its chain of hospitals from FY 2019 to FY 2021 alone, which is truly unheard of in the business of individually owned hospitals. Park Group of ...",
        "sentiment": "1 (Negative)",
        "link": "https://timesofindia.indiatimes.com/north-indias-fastest-growing-chain-of-super-specialty-hospitals-plans-further-expansion/articleshow/83336756.cms"
    },
    {
        "title": "Woman's Kidney 'Stolen' During Surgery: Meerut Hospital Faces Organ ...",
        "snippet": "Meerut: In a tragic incident, a woman from Bugrasi of Bulandshahr district on Tuesday alleged that six doctors of the KMC Hospital and Research Center in Meerut of removing and selling her kidney.The Narsena police have filed an FIR against six doctors and other employees on the orders of a court here. According to the FIR, the woman said that when she complained about the incident, the ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.etvbharat.com/en/!state/woman-s-kidney-stolen-during-surgery-meerut-hospital-faces-organ-trafficking-allegations-enn25011501522"
    },
    {
        "title": "Dr. Madhur Gupta | Oncology Consultant in Faridabad - Park Hospital",
        "snippet": "8. Worked as Visiting Consultant, Radiation Oncology in Max Super Speciality Hospital, Shalimar Bagh, New Delhi, Oct 2013 - Feb 2014 9. Presently working as Consultant Oncology, Park Hospital, Faridabad, March 2014 till date 10. Additionally working as Medical Superintendent, Park Hospital, Faridabad since November 2019",
        "sentiment": "4 (Positive)",
        "link": "https://www.parkhospital.in/doctors/dr-madhur-gupta"
    },
    {
        "title": "[Video] Park Group of Hospitals on LinkedIn: Dr. Ankit Gupta | Rising ...",
        "snippet": "It's an honour to announce that, our beloved Managing Director, Dr. Ankit Gupta has won the title of \"RISING HEALTHCARE TYCOON OF THE YEAR 2022\" by Business ... Park Group of Hospitals' Post",
        "sentiment": "5 (Positive)",
        "link": "https://www.linkedin.com/posts/park-hospital_dr-ankit-gupta-rising-healthcare-tycoon-activity-6920326058974085120-JkJ-"
    },
    {
        "title": "Dr. Ajit Gupta - General Physician in Delhi, Instant Appointment ...",
        "snippet": "Dr. Ajit Gupta is a General Physician in Delhi. View Fees, Profiles, Ratings, Address, Phone Numbers and more. Dr. Ajit Gupta Provides World Class Treatment to Patients | Doctor360 ... Park Hospital. Clinic Address Unit No. 12, Near Keshopur Bus Depot, Chaukhandi, Vishnu Garden, Delhi, National Capital Region- India. Contact. Don't forget to ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.doctor360.in/delhi/general-physician/dr-ajit-gupta-chaukhandi-vishnu-garden"
    },
    {
        "title": "Park Hospital, Sector 47, Gurgaon - Contact No., Photos ... - HexaHealth",
        "snippet": "Park Hospital Journey. Park Hospital's journey began in 1982 with Dr. Ajit Gupta's clinic, evolving into a leading healthcare group. In 1992, it launched Navjeevan Nursing Home in Delhi, and by 1999, the first Sunil Park Hospital was inaugurated.",
        "sentiment": "4 (Positive)",
        "link": "https://www.hexahealth.com/gurgaon/hospital/park-hospital-gurugram"
    }
]