[
    {
        "title": "Your Doctor Might Have a Disciplinary Record. Here's How to Find Out ...",
        "snippet": "ProPublica also provides helpful resources for researching doctors, and knowing whether a doctor has been sanctioned by a professional licensing board should be another essential part of your search. Doctors can be disciplined for criminal convictions, medical negligence, wrongly prescribing controlled substances and other wrongdoing.",
        "sentiment": "4 (Positive)",
        "link": "https://projects.propublica.org/graphics/investigating-doctors"
    },
    {
        "title": "Final Actions - apps.health.ny.gov",
        "snippet": "Manohar : Physician Middle Name: Lal : Address: Address redacted : License Number: 177745 : License Type: MD : Year of Birth: 1954 Effective Date: 04/21/2020 : Action Description for DOH Webpage: ... The physician did not contest the charge of having committed professional misconduct by having been disciplined by the Michigan Bureau of ...",
        "sentiment": "1 (Negative)",
        "link": "https://apps.health.ny.gov/pubdoh/professionals/doctors/conduct/factions/PhysicianDetailsAction.action?finalActionId=12808"
    },
    {
        "title": "Suspended and Debarred Medical Providers - U.S. Department of Labor",
        "snippet": "Division of Federal Employees' Compensation (DFEC) On November 29, 2017, DFEC issued FECA Circular 18-01, Application of the Department of Labor's (DOL) Suspension and Debarment Procedures to Medical Provider Payments under the Federal Employees' Compensation Act (FECA).As outlined in that Circular, DFEC will publish on its website a listing of providers that have been suspended or debarred ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.dol.gov/agencies/owcp/FECA/SuspendedandDebarredMedicalProviders"
    },
    {
        "title": "Chirayu Medical College & Hospital Bhopal",
        "snippet": "info@cmchbhopal.com; 0755 2709101/102/103; Chirayu Medical College & Hospital. Bhainsakhedi,Near Bairagarh (Bhopal-Indore Highway), Bhopal, M.P. - 462030",
        "sentiment": "4 (Positive)",
        "link": "https://cmchbhopal.com/management-team/"
    },
    {
        "title": "Chirayu University",
        "snippet": "Dr. Manohar Bende Dean, Chirayu Medical College and Hospital. Qualifications: MD (Pharmacology) Teaching Experience: 25 Years. Phone: +91-755-2709258 Mob.: 9425724977 Email: cmchdean@gmail.com ... Dr. Malay Ghosh Head - Chirayu School of Management and Research( CSMR) Qualifications: Ph.D.",
        "sentiment": "4 (Positive)",
        "link": "https://chirayuuniversity.ac.in/Our_Team"
    },
    {
        "title": " Chirayu Medical College & Hospital, Bhopal",
        "snippet": "manohar bende dean 1 dr. ulka shrivastav medical superintendent 1 dr. bipin chandra khade professor ... 19 dr. md. aiman malik tutor 20 dr. avisha khandekar tutor microbiology. 21 dr. samandeep kaur senior resident ... pharmacology. 4 dr. a. r. tyagi professor 5 dr. sachin gupta asso. prof 6 dr. ashutosh jain assist. prof",
        "sentiment": "1 (Negative)",
        "link": "https://cmchbhopal.com/pdf/teachingflt.pdf"
    },
    {
        "title": "How to File a Wrong Medication Lawsuit - Nolo",
        "snippet": "Medical malpractice happens when a doctor's actions fall below the required medical standard of care.The standard of care is the level of care and skill that an ordinarily careful doctor with similar training and experience would use under similar circumstances.",
        "sentiment": "1 (Negative)",
        "link": "https://www.nolo.com/legal-encyclopedia/my-doctor-prescribed-the-wrong-medication-is-malpractice.html"
    },
    {
        "title": "MARB Proforma-18 - Chirayu Medical College & Hospital",
        "snippet": "Dr. Manohar Bende: 19: Address with PIN code: A-104, Chirayu Medical College Campus, Bhopal (M.P.) - 462030 ... Dr. Jyoti Kumar : Kumar J, MS. Vatve MD. Pulmonary Function Tests in Healthy Adults of different sex and Natives lournal of Scientific Societies, J. N Medical College, Vol. 22 April, 1995; P. 15-19 ... Dr. Wiseman Pinto Maria Jose ...",
        "sentiment": "1 (Negative)",
        "link": "https://cmchbhopal.com/marb-proforma-18/"
    },
    {
        "title": "Discipline & Medicine | AMA-Code - American Medical Association",
        "snippet": "Code of Ethics Opinions pages. The obligation to address misconduct falls on both individual physicians and the profession as a whole. The goal of disciplinary review is both to protect patients and to help ensure that colleagues receive appropriate assistance from a physician health program or other service to enable them to practice safely and ethically.",
        "sentiment": "1 (Negative)",
        "link": "https://code-medical-ethics.ama-assn.org/ethics-opinions/discipline-medicine"
    },
    {
        "title": "Professional misconduct in the legal profession - a ... - LawBhoomi",
        "snippet": "Contents hide 1. Introduction 2. Advocates Act 3. Contempt of court as professional misconduct 4. Case laws 5. Professional ethics of an advocate 6. Advocate's duties towards his client 7. Advocate's duty towards the court 7.1. Act in a respectable way 7.2. Honour the court 7.3. No private communications 7.4. Refusal to act in an […]",
        "sentiment": "1 (Negative)",
        "link": "https://lawbhoomi.com/professional-misconduct-in-the-legal-profession-a-critical-analysis/"
    },
    {
        "title": "Dr. Jaishree Manohar, MD - Rheumatologist in Sarasota, FL - Healthgrades",
        "snippet": "Dr. Jaishree Manohar, MD is a rheumatologist in Sarasota, FL. Dr. Manohar has extensive experience in Osteoporosis & Screening. She is affiliated with Sarasota Memorial Hospital. ... Search for a healthcare professional. Search. Start typing a doctors name or a condition, procedure, or specialty to see suggestions. Use the arrow keys to ...",
        "sentiment": "3 (Neutral)",
        "link": "https://www.healthgrades.com/physician/dr-jaishree-manohar-xlcfy"
    },
    {
        "title": "Dr. Ram Manohar Lohiya National Law University: Professional Misconduct ...",
        "snippet": "Dr. Ram Manohar Lohiya National Law University: Professional Misconduct: Meaning, Ambit and Punishment - Free download as Word Doc (.doc / .docx), PDF File (.pdf), Text File (.txt) or read online for free. This document discusses professional misconduct by lawyers. It begins by defining professional misconduct as improper conduct by those engaged in a profession that violates professional ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.scribd.com/document/639507332/Untitled"
    },
    {
        "title": "Dr. Vinayak Manohar, MD - Cardiologist in Grand Rapids, MI - Healthgrades",
        "snippet": "Dr. Vinayak Manohar, MD is a cardiologist in Grand Rapids, MI and has over 18 years of experience in the medical field. Dr. Manohar has extensive experience in Adult Congenital Heart Conditions and Heart Conditions. He graduated from Thomas Jefferson University in 2006. He is affiliated with medical facilities such as Corewell Health Butterworth Hospital and Trinity Health Grand Rapids Hospital.",
        "sentiment": "4 (Positive)",
        "link": "https://www.healthgrades.com/physician/dr-vinayak-manohar-34l3g"
    },
    {
        "title": "Dr. Leslie Manohar, MD, Orthopedic Surgery | Champaign, IL - WebMD",
        "snippet": "Dr. Leslie Manohar, MD, is an Orthopedic Surgery specialist practicing in Champaign, IL with 20 years of experience. ... Dr. Manohar graduated from the Univ of Chicago Division of Biological Sciences Pritzker School of Medicine in 2005. ... was amazing! Great experience having had knee surgery. She did a fantastic job and recovery went ...",
        "sentiment": "5 (Positive)",
        "link": "https://doctor.webmd.com/doctor/leslie-manohar-291dc5c0-dec5-11e7-9f4c-005056a225bf-overview"
    },
    {
        "title": "Dr. Jaishree Manohar, MD, Rheumatology | Sarasota, FL - WebMD",
        "snippet": "Dr. Jaishree Manohar, MD, is a Rheumatology specialist practicing in Sarasota, FL with 18 years of experience. ... Dr. Manohar graduated from the Case Western Reserve University School of Medicine in 2007. She works in Sarasota, FL and 3 other locations and specializes in Rheumatology and Internal Medicine. Dr.",
        "sentiment": "5 (Positive)",
        "link": "https://doctor.webmd.com/doctor/jaishree-manohar-a5cbd8ef-14ce-4815-b962-be4ea4fb61e6-overview"
    },
    {
        "title": "Dr. Chenguttai Manohar, MD, Internal Medicine | Madison, OH - WebMD",
        "snippet": "Dr. Chenguttai Manohar, MD, is an Internal Medicine specialist practicing in Madison, OH with 42 years of experience. This provider currently accepts 37 insurance plans including Medicare and Medicaid. ... Dr. Manohar graduated from the Madras Medical College in 1983. He works in Madison, OH and 1 other location and specializes in Internal ...",
        "sentiment": "4 (Positive)",
        "link": "https://doctor.webmd.com/doctor/chenguttai-manohar-f82e0161-d95b-4dee-8c19-cf2a717c8eaa-overview"
    },
    {
        "title": "Dr. Manohar Manchandia, MD - Sharecare",
        "snippet": "Sharecare Professional. Dx Dialogues: Aortic Stenosis Dx Dialogues: NASH. About. ... Providers at Dr. Manohar Manchandia, MD can provide language services for Gujarati. Locations. button. Dr. Manohar Manchandia, MD. 1 2706 Shed Rd, Bossier City, LA 71111 Directions (318) 747-5272; Make an appointment.",
        "sentiment": "4 (Positive)",
        "link": "https://www.sharecare.com/find-a-doctor/group-profile/la-louisiana/bossier-city/dr-manohar-manchandia-md-x65dv3"
    },
    {
        "title": "Dr. Ashan Manohar, MD - Gastroenterologist in Onancock, VA - Healthgrades",
        "snippet": "Dr. Ashan Manohar, MD is a gastroenterologist in Onancock, VA and has over 37 years of experience in the medical field. Dr. Manohar has extensive experience in Pancreatic Disease. He graduated from UNIVERSITY OF POITIERS / U.F.R. OF MEDICINE AND PHARMACY in 1987. He is affiliated with Riverside Shore Memorial Hospital. He is accepting new patients.",
        "sentiment": "4 (Positive)",
        "link": "https://www.healthgrades.com/physician/dr-ashan-manohar-34ryd"
    },
    {
        "title": "Dr. Shonith Manohar, MD",
        "snippet": "Dr. Shonith Manohar, MD is a pain medicine physician in Jacksonville, FL and has over 32 years of experience in the medical field. He graduated from NEW YORK Medical College in 1992. He is affiliated with Baptist Medical Center Jacksonville. He is accepting new patients and telehealth appointments.",
        "sentiment": "4 (Positive)",
        "link": "https://www.healthgrades.com/physician/dr-shonith-manohar-32xtc"
    },
    {
        "title": "Dr. Tanvi Manohar, MD, Infectious Disease Specialist - Sharecare",
        "snippet": "Dr. Tanvi Manohar, MD is a infectious disease specialist in Gainesville, FL. She currently practices at Practice. She accepts multiple insurance plans. Dr. Manohar is board certified in Infectious Disease. Hamburger Menu. x. Home. Solutions. Employer Health ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.sharecare.com/doctor/dr-tanvi-manohar-xyn94lb"
    },
    {
        "title": "Chirayu Medical College & Hospital Bhopal",
        "snippet": "info@cmchbhopal.com; 0755 2709101/102/103; Chirayu Medical College & Hospital. Bhainsakhedi,Near Bairagarh (Bhopal-Indore Highway), Bhopal, M.P. - 462030",
        "sentiment": "5 (Positive)",
        "link": "https://cmchbhopal.com/dean-profile/"
    },
    {
        "title": " Name of Recent Educationa Latest Registratio Passport Size Photo Mbbs ...",
        "snippet": "Department of Pharmacology: NAME OF FACULTY RECENT PASSPORT SIZE PHOTO EDUCATIONA L QUALIFICATI ON LATEST DESIGNATIO N REGISTRATIO N NO. RESPECTIVE MEDICAL COINCIL Dr. Rajendra Kumar Gupta MBBS MD Professor MP-4639 Dr. Manohar Bende MBBS MD Professor MMC-49580 Dr. Sudha M MBBS MD DNB Professor KMC-71505 Dr. Baliram Venkatro Ghodke MBBS MD",
        "sentiment": "1 (Negative)",
        "link": "https://cmchbhopal.com/min-req-clause/Pharmacology.pdf"
    },
    {
        "title": "Poorni Manohar, M.D.: Internal Medicine | Breast Cancer | UT ...",
        "snippet": "Poorni Manohar, M.D., is an Assistant Professor in the Department of Internal Medicine at UT Southwestern Medical Center. She specializes in breast oncology. Dr. Manohar earned her medical degree at the Wright State University Boonshoft School of Medicine.",
        "sentiment": "4 (Positive)",
        "link": "https://utswmed.org/doctors/poorni-manohar/"
    },
    {
        "title": "Dr. Poorni Manohar, MD - Hematologist in Ann Arbor, MI - Healthgrades",
        "snippet": "Dr. Poorni Manohar, MD is a hematologist in Ann Arbor, MI. She is affiliated with UW Medical Center-Montlake. Skip navigation. Menu. Menu. Find a Doctor. Find a Doctor. ... Search for a healthcare professional. Search. Start typing a doctors name or a condition, procedure, or specialty to see suggestions. Use the arrow keys to navigate. Press ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.healthgrades.com/physician/dr-poorni-manohar-y9vvw6z"
    },
    {
        "title": "Dr. Prerana Manohar, MD, Cardiologist - Grand Rapids, MI - Sharecare",
        "snippet": "Dr. Prerana Manohar, MD is a cardiologist in Grand Rapids, MI. Dr. Manohar completed a residency at University Hospital Of Cleveland- Cardiovascular Diseases And Internal Medicine. She currently practices at Practice and is affiliated with Corewell Health Butterworth Hospital. Dr. Manohar is board certified in Cardiovascular Disease.",
        "sentiment": "4 (Positive)",
        "link": "https://www.sharecare.com/doctor/dr-prerana-a-manohar"
    },
    {
        "title": "Dr. Manohar Kola, MD - Decatur, IL | Cardiology - Doximity",
        "snippet": "Dr. Manohar Kola, MD is a cardiologist in Decatur, Illinois. He is affiliated with HSHS St. Mary's Hospital and Veterans Affairs Illiana Health Care System.",
        "sentiment": "4 (Positive)",
        "link": "https://www.doximity.com/pub/manohar-kola-md-b5530147"
    },
    {
        "title": "Dr. Priti Manohar, MD - Sleep Medicine Internist in Edinburg, TX ...",
        "snippet": "Dr. Priti Manohar, MD is a sleep medicine internist in Edinburg, TX and has over 31 years of experience in the medical field. She graduated from Barisal Medical College in 1993. She is affiliated with Doctors Hospital at Renaissance. She is accepting new patients and telehealth appointments.",
        "sentiment": "4 (Positive)",
        "link": "https://www.healthgrades.com/physician/dr-priti-manohar-3xvky"
    },
    {
        "title": "Dr. Manohar Kola, MD - Cardiologist in Decatur, IL - Healthgrades",
        "snippet": "Dr. Manohar Kola, MD is a cardiologist in Decatur, IL and has over 45 years of experience in the medical field. Dr. Kola has extensive experience in Heart Conditions and Adult Congenital Heart Conditions. He graduated from Gandhi Medical College in 1979. He is affiliated with medical facilities such as Decatur Memorial Hospital and HSHS Good Shepherd Hospital.",
        "sentiment": "4 (Positive)",
        "link": "https://www.healthgrades.com/physician/dr-manohar-kola-3c7yq"
    },
    {
        "title": "Dr. Manohar Manchandia, MD, Bossier City, LA - Healthgrades",
        "snippet": "Dr. Manohar Manchandia, MD is a medical group practice located in Bossier City, LA that specializes in Pediatrics, and is open 5 days per week. Skip navigation. Menu. Menu. ... Search for a healthcare professional. Search. Start typing a doctors name or a condition, procedure, or specialty to see suggestions. Use the arrow keys to navigate ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.healthgrades.com/group-directory/la-louisiana/bossier-city/dr-manohar-manchandia-md-x65dv3"
    },
    {
        "title": "Dr. Ashan Manohar, MD - Onancock, VA | Gastroenterology - Doximity",
        "snippet": "Dr. Ashan Manohar, MD is a gastroenterologist in Onancock, Virginia. ... Physician Join to view full profile. Dr. Manohar is on Doximity. As a Doximity member you'll join over two million verified healthcare professionals in a private, secure network. Gain access to free telehealth tools, such as our \"call shielding\" and one-way patient ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.doximity.com/pub/ashan-manohar-md"
    },
    {
        "title": "Dr. Roja Manohar, MD - Houston, TX | Resident Physician - Doximity",
        "snippet": "Gao-Xia Wei, Haoran Shen, Li-Kun Ge, Bo Cao, Roja Manohar Schizophrenia Research. Cognition. 2024-06-01",
        "sentiment": "4 (Positive)",
        "link": "https://www.doximity.com/pub/roja-manohar-md"
    },
    {
        "title": "Dr. Saloni Manohar, MD - Indianapolis, IN | Resident Physician - Doximity",
        "snippet": "Dr. Manohar is on Doximity As a Doximity member you'll join over two million verified healthcare professionals in a private, secure network. Gain access to free telehealth tools, such as our \"call shielding\" and one-way patient texting.",
        "sentiment": "5 (Positive)",
        "link": "https://www.doximity.com/pub/saloni-manohar-md"
    },
    {
        "title": "Dr. Naveen Manohar, MD, Cardiovascular Disease | Sacramento, CA - WebMD",
        "snippet": "Dr. Naveen Manohar, MD, is a Cardiovascular Disease specialist practicing in Sacramento, CA with 32 years of experience. This provider currently accepts 88 insurance plans including Medicare and Medicaid. ... Dr. Manohar graduated from the Jawaharlal Inst of Post-Graduate Medical Education and Research (Jipmer) in 1993. He works in Sacramento ...",
        "sentiment": "4 (Positive)",
        "link": "https://doctor.webmd.com/doctor/naveen-manohar-e96a9e2f-9ec9-4884-9835-5b63746e5da5-overview"
    },
    {
        "title": "Dr. Manohar Shetty, MD - Psychiatry - St. Clair Health",
        "snippet": "Find information about and book an appointment with Dr. Manohar Shetty, MD. Specialties: Psychiatry.",
        "sentiment": "4 (Positive)",
        "link": "https://providers.stclair.org/provider/manohar-shetty/2696911"
    },
    {
        "title": "Dr. Manohar Angirekula, MD - Cardiologist in Odessa, TX - Healthgrades",
        "snippet": "Dr. Manohar Angirekula, MD is a cardiologist in Odessa, TX and has over 32 years of experience in the medical field. Dr. Angirekula has extensive experience in Adult Congenital Heart Conditions, Interventional Cardiac Procedures, and Heart Conditions. He graduated from UNIVERSITY OF HEALTH SCIENCES / GUNTUR MEDICAL COLLEGE in 1992. He is affiliated with medical facilities such as Reeves ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.healthgrades.com/physician/dr-manohar-angirekula-3rqxb"
    },
    {
        "title": "Dr. Jaishree Manohar, MD - Sarasota, FL | Rheumatology - Doximity",
        "snippet": "Dr. Jaishree Manohar, MD is a rheumatologist in Sarasota, Florida. She is affiliated with Sarasota Memorial Hospital - Sarasota. ... Sign In; Jaishree Manohar MD Rheumatology • Sarasota, FL. Sarasota Arthritis Center. Join to view full profile. Dr. Manohar is on Doximity. As a Doximity member you'll join over two million verified healthcare ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.doximity.com/pub/jaishree-manohar-md"
    },
    {
        "title": "Ashan Manohar, MD | Riverside Health System | Southeastern VA",
        "snippet": "About Ashan Manohar, MD. Dr. Manohar earned his medical degree from the University of Natal Medical School in South Africa in 1987. He completed an internal medicine residency at St. John's Episcopal Hospital in New York in 1996, and a gastroenterology fellowship at the State University of New York Health Science Center at Brooklyn in 1999. Dr.",
        "sentiment": "4 (Positive)",
        "link": "https://www.riversideonline.com/find-a-doctor/find-a-doctor-results/ashan-manohar"
    },
    {
        "title": "Dr. Naveen Manohar, MD - Pediatric Cardiologist in ... - Healthgrades",
        "snippet": "Dr. Naveen Manohar, MD is a pediatric cardiologist in Sacramento, CA and has over 30 years of experience in the medical field. He graduated from JAWAHARLAL INSTITUTE OF POST-GRADUATE MEDICAL EDUCATION / MADRAS UNIVERSITY in 1993. He is affiliated with medical facilities such as Mercy General Hospital and Mercy San Juan Medical Center. He is accepting new patients and telehealth appointments.",
        "sentiment": "1 (Negative)",
        "link": "https://www.healthgrades.com/physician/dr-naveen-manohar-ymk57"
    },
    {
        "title": "Dr. Leslie Manohar, MD, Orthopedic Surgeon - Champaign, IL - Sharecare",
        "snippet": "Dr. Manohar graduated from University of Chicago.Dr. Leslie Manohar, MD is an Orthopedic Surgeon in Champaign, IL and has 20 years experience. Dr. Manohar currently practices at Practice and are affiliated with Carle Bromenn Medical Center and Carle Foundation Hospital.",
        "sentiment": "3 (Neutral)",
        "link": "https://www.sharecare.com/doctor/dr-leslie-m-manohar"
    },
    {
        "title": "Manohar S Bhandarkar MD, Des Plaines, IL - Healthgrades",
        "snippet": "Manohar S Bhandarkar MD is a medical group practice located in Des Plaines, IL that specializes in Family Medicine. ... Search for a healthcare professional. Search. Start typing a doctors name or a condition, procedure, or specialty to see suggestions. ... Dr. Manohar Bhandarkar, MD. Family Medicine. 17 Ratings. Overview. Medical Services.",
        "sentiment": "4 (Positive)",
        "link": "https://www.healthgrades.com/group-directory/il-illinois/des-plaines/manohar-s-bhandarkar-md-x9wd9g"
    },
    {
        "title": "Dr. Ashan Manohar, MD, Gastroenterology | Onancock, VA - WebMD",
        "snippet": "Dr. Ashan Manohar, MD, is a Gastroenterology specialist practicing in Onancock, VA with 38 years of experience. This provider currently accepts 67 insurance plans including Medicare and Medicaid. New patients are welcome. ... Dr. Manohar graduated from the University of Kwazulu-Natal College of Health Sciences in 1987. He works in Onancock, VA ...",
        "sentiment": "4 (Positive)",
        "link": "https://doctor.webmd.com/doctor/ashan-manohar-57782eb5-6f1a-4cde-9d7a-9554535269f3-overview"
    },
    {
        "title": "Dr. Prerana Manohar, MD - Grand Rapids, MI | Cardiology - Doximity",
        "snippet": "Dr. Prerana Manohar, MD is a cardiologist in Grand Rapids, Michigan. She is currently licensed to practice medicine in Michigan and Ohio. ... Professional Memberships. American College of Physicians - ACP. Member; American College of Cardiology - ACC. Member; Similar Physicians & HCPs. John Bisognano, MD. Cards Ann Arbor, MI. Sponsored. Request ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.doximity.com/pub/prerana-manohar-md"
    },
    {
        "title": "Dr. Manohar Saraf, MD - Anesthesiologist in Dallas, TX - Healthgrades",
        "snippet": "Dr. Manohar Saraf, MD is an Anesthesiologist in Dallas, TX and has over 34 years of experience in the medical field. He graduated from MUMBAI UNIVERSITY / BOMBAY HOSPITAL INSTITUTE OF MEDICAL SCIENCES in 1989. His office accepts new patients.",
        "sentiment": "1 (Negative)",
        "link": "https://www.healthgrades.com/physician/dr-manohar-saraf-x4rtd"
    },
    {
        "title": "Dr Manohar G Reddy Md Pa in Melbourne, FL - WebMD",
        "snippet": "Dr Manohar G Reddy Md Pa is a Group Practice with 1 Location. Currently Dr Manohar G Reddy Md Pa's 2 physicians cover 3 specialty areas of medicine. Mon 8:30 am - 5:00 pm. Tue 8:30 am - 5:00 pm. Wed 8:30 am - 5:00 pm. Thu 8:30 am - 5:00 pm. Fri 8:30 am - 12:00 pm. Sat Closed. Sun Closed. Accepting New Patients.",
        "sentiment": "4 (Positive)",
        "link": "https://doctor.webmd.com/practice/dr-manohar-g-reddy-md-pa-962ac2c7-4703-e211-a42b-001f29e3eb44"
    }
]