[
    {
        "title": "9 Private Colleges Ex-Officials Granted Conditional Bail In Vyapam Case",
        "snippet": "The Madhya Pradesh High Court has granted conditional bail to nine former officials of private medical colleges accused of cheating, forgery among other offences related to pre-medical test PMT ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.ndtv.com/india-news/vyapam-scam-9-private-colleges-ex-officials-granted-conditional-bail-in-vyapam-case-2818931"
    },
    {
        "title": "All you need to know about the Vyapam Scam - iPleaders",
        "snippet": "It was modified back to the original after the test. This was achieved in collaboration with the crooked members of the board. Cases of malpractice in the Vyapam scam have been registered since 1995 and the first FIR was detected in the Chhatarpur district in 2000. Seven cases were reported in the Khandwa district in 2004.",
        "sentiment": "3 (Neutral)",
        "link": "https://blog.ipleaders.in/all-you-need-to-know-about-the-vyapam-scam/"
    },
    {
        "title": "Vyapam scam: 2 sentenced to 4-year RI - Times of India",
        "snippet": "Two persons, Ashutosh Gupta and Pankaj Gupta, have been sentenced to four years of rigorous imprisonment each in the Vyapam scam case. They were also fined Rs 13,100 each. The case was initiated ...",
        "sentiment": "1 (Negative)",
        "link": "https://timesofindia.indiatimes.com/city/bhopal/vyapam-scam-2-sentenced-to-4-year-ri/articleshow/108089758.cms"
    },
    {
        "title": "Vyapam scam: Four get RI in two cases in Madhya Pradesh",
        "snippet": "177/15, earlier registered at Police Station Jhansi Road, Gwalior related to Madhya Pradesh Pre Medical Test (PMT) 2010 conducted by VYAPAM, Bhopal.",
        "sentiment": "1 (Negative)",
        "link": "https://timesofindia.indiatimes.com/city/bhopal/vyapam-scam-four-get-ri-in-two-cases-in-madhya-pradesh/articleshow/96522727.cms"
    },
    {
        "title": "More than 100 persons convicted in Vyapam scam cases so far",
        "snippet": "The real identities of such impersonators were established by examining the data of those who appeared in pre-test tests from 2010 to 2014; details of bank accounts and credit/debit cards used to ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.thehindu.com/news/national/more-than-100-persons-convicted-in-vyapam-scam-cases-so-far/article35685868.ece"
    },
    {
        "title": "Vyapam scam: Fresh FIR mentions alleged involvement of senior BJP ...",
        "snippet": "The FIR mentioned unnamed \"direct and indirect\" involvement of senior Bharatiya Janata Party (BJP) leaders in the alleged scam that hit BJP-led state government in 2014.",
        "sentiment": "1 (Negative)",
        "link": "https://www.hindustantimes.com/cities/bhopal-news/vyapam-scam-fresh-fir-mentions-alleged-involvement-of-senior-bjp-leaders-101672675890104.html"
    },
    {
        "title": "CBI files charge-sheet against 60 accused in Vyapam scam case",
        "snippet": "The CBI on Thursday filed a charge-sheet in a special court here against 60 accused in a case related to the multi-crore Vyapam admission and recruitment scam in Madhya Pradesh, the prosecution said.",
        "sentiment": "1 (Negative)",
        "link": "https://www.thehindu.com/news/national/cbi-files-charge-sheet-against-60-accused-in-vyapam-scam-case/article33523791.ece"
    },
    {
        "title": "MARB Proforma-18 - Chirayu Medical College & Hospital",
        "snippet": "Website link/ email ID/ hyperlink of the corporation in case Death Records are reported: crsorgi.gov.in: 12: ... Dr. Manohar Bende: 19: Address with PIN code: A-104, Chirayu Medical College Campus, Bhopal (M.P.) - 462030 ... Tiwari A,Gupta S,Kumar A,Patel SK.Cough Frequency and Outcome among pulmonary TB patients of a Private tertiary care ...",
        "sentiment": "1 (Negative)",
        "link": "https://cmchbhopal.com/marb-proforma-18/"
    },
    {
        "title": "Vyapam scam case: Doctor, hired as a proxy to write medical exam ...",
        "snippet": "The convicted Dr Manish Kumar, an MBBS graduate and student of MD, has been sentenced for appearing on behalf of another candidate during Madhya Pradesh Pre-Medical Test Exam in June 2004. ... The instant case was one of the 155 cases registered on the orders of the Supreme Court of India. Till now, in 36 Vyapam cases, the trial courts have ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.indiatoday.in/india/story/vyapam-scam-case-doctor-hired-as-proxy-to-write-medical-exam-jailed-for-5-years-1762338-2021-01-24"
    },
    {
        "title": "Madhya Pradesh Special Court Sentences 5 To Jail In Vyapam Scam - NDTV.com",
        "snippet": "The special court of Sanjay Kumar Gupta convicted two accused under IPC sections 120B, 419, 420, 467, 468, 471, 201 and section 3/4 of the Affiliated Examination Act, 1937 and convicted three ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.ndtv.com/india-news/madhya-pradesh-special-court-sentences-5-to-jail-in-vyapam-scam-4026460"
    },
    {
        "title": "Ayushman Bharat (PMJAY) Hospitals List India - Download PDF - HexaHealth",
        "snippet": "The complete Ayushman Bharat hospital list can be found on the official PMJAY website. However, to find the nearest registered hospital under the PMJAY scheme, here's what you need to do. Step 1: Visit the PMJAY website, to get the Ayushman Bharat Hospital List. Click on 'Find Hospital' on the upper left bar",
        "sentiment": "4 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat"
    },
    {
        "title": "Chirayu Medical College & Hospital Bhopal",
        "snippet": "info@cmchbhopal.com; 0755 2709101/102/103; Chirayu Medical College & Hospital. Bhainsakhedi,Near Bairagarh (Bhopal-Indore Highway), Bhopal, M.P. - 462030",
        "sentiment": "4 (Positive)",
        "link": "https://cmchbhopal.com/management-team/"
    },
    {
        "title": "PMJAY Landing Page",
        "snippet": "Ayushman Bharat is the Pradhan Mantri Jan Arogya Yojna or PM-JAY as it is popularly known. This scheme was launched on 23rd September, 2018 in Ranchi, Jharkhand by the Hon'ble Prime Minister of India, Shri Narendra Modi. ... PM-JAY provides cashless access to health care services for the beneficiary at the point of service, that is, the ...",
        "sentiment": "5 (Positive)",
        "link": "https://hospitals.pmjay.gov.in/LandingPage.htm"
    },
    {
        "title": "Ashan Manohar, MD | Riverside Health System | Southeastern VA",
        "snippet": "About Ashan Manohar, MD. Dr. Manohar earned his medical degree from the University of Natal Medical School in South Africa in 1987. He completed an internal medicine residency at St. John's Episcopal Hospital in New York in 1996, and a gastroenterology fellowship at the State University of New York Health Science Center at Brooklyn in 1999. Dr.",
        "sentiment": "4 (Positive)",
        "link": "https://www.riversideonline.com/find-a-doctor/find-a-doctor-results/ashan-manohar"
    },
    {
        "title": "Chirayu Medical College & Hospital Bhopal",
        "snippet": "info@cmchbhopal.com; 0755 2709101/102/103; Chirayu Medical College & Hospital. Bhainsakhedi,Near Bairagarh (Bhopal-Indore Highway), Bhopal, M.P. - 462030",
        "sentiment": "5 (Positive)",
        "link": "https://cmchbhopal.com/dean-profile/"
    },
    {
        "title": "Vinayak Manohar, MD - Trinity Health Michigan",
        "snippet": "Dr. Manohar is a rare find. My previous doctor (at the same office, but retired & referred me to Dr. Manohar, so he gets credit for that) looked at all my symptoms/diagnosis & told me ‚Äúthere‚Äôs really not much I can do‚Äù. I was debilitated by my symptoms & had to leave my job.",
        "sentiment": "5 (Positive)",
        "link": "https://www.trinityhealthmichigan.org/provider/vinayak-manohar-md-cardiology"
    },
    {
        "title": "Dr. Leslie Manohar, MD, Orthopedic Surgery | Champaign, IL - WebMD",
        "snippet": "Dr. Manohar graduated from the Univ of Chicago Division of Biological Sciences Pritzker School of Medicine in 2005. She works in Champaign, IL and 1 other location and specializes in Orthopedic Surgery and Adult Reconstructive Orthopedic Surgery. Dr. Manohar is affiliated with Carle Foundation Hospital.",
        "sentiment": "5 (Positive)",
        "link": "https://doctor.webmd.com/doctor/leslie-manohar-291dc5c0-dec5-11e7-9f4c-005056a225bf-overview"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Gurugram - Download PDF - HexaHealth",
        "snippet": "To view the AB-PMJAY panelled hospitals in Gurugram, you need to visit the official website https://hospitals.pmjay.gov.in. Click on 'Find Hospitals' and enter Gurugram, along with the District, Hospital Type, Speciality, Hospital Name, and Empanelment Type. Click on the Search button and get the list of all hospitals in one place.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-gurugram"
    },
    {
        "title": "Dr. Ram Manohar Lohia Hospital and Post Graduate Institute of Medical ...",
        "snippet": "Dr. Ram Manohar Lohia Hospital, formerly known as Willingdon Hospital, was established by the British for their staff and had only 54 beds. After independence, its control was shifted to New Delhi Municipal Committee. In 1954, its control was again transferred to the Central Government of Independent India.",
        "sentiment": "5 (Positive)",
        "link": "https://rmlh.nic.in/"
    },
    {
        "title": "Dr. Chenguttai Manohar, MD, Internal Medicine | Madison, OH - WebMD",
        "snippet": "Dr. Chenguttai Manohar, MD, is an Internal Medicine specialist practicing in Madison, OH with 42 years of experience. This provider currently accepts 37 insurance plans including Medicare and Medicaid. New patients are welcome. Hospital affiliations include University Hospitals Geneva Medical Center.",
        "sentiment": "4 (Positive)",
        "link": "https://doctor.webmd.com/doctor/chenguttai-manohar-f82e0161-d95b-4dee-8c19-cf2a717c8eaa-overview"
    },
    {
        "title": "About Us - Chirayu Medical College & Hospital",
        "snippet": "In a small 20-bed hospital in the year 1992, an establishment that would grow into one of Central India's biggest healthcare group was born. After 5 years of incredible hard work and a distant vision and efforts of our founder Dr. Ajay Goenka, we managed to upgrade into a premier super specialty hospital with 100 beds.",
        "sentiment": "5 (Positive)",
        "link": "https://cmchbhopal.com/about/"
    },
    {
        "title": "Ayushman Bharat, Haryana | India",
        "snippet": "At Ayushman Bharat, we are committed to realizing the vision of Universal Health Coverage (UHC) as outlined in the National Health Policy 2017. Our flagship initiative, Ayushman Bharat, strives to ensure that no one is left behind in accessing quality healthcare services.",
        "sentiment": "5 (Positive)",
        "link": "https://ayushmanbharat.haryana.gov.in/"
    },
    {
        "title": "Contact Us - Dr. Ram Manohar Lohia Institute of Medical Sciences",
        "snippet": "Hospital No(s) 0522-6692000, 6692001 | Helpline No- 0522-6692000 | Ayushman Helpline number/CUG:- +91-8188098620. Change Language: Enquiry; Route Map; Contact; Home; About Us. Dr RMLIMS Act; Citizen Charter; About Us; Infrastructure; ... Dr. Ram Manohar Lohia Institute of Medical Sciences",
        "sentiment": "4 (Positive)",
        "link": "https://drrmlims.ac.in/contact-us"
    },
    {
        "title": "3.42 lakh fraud cases detected under Ayushman Bharat-PMJAY ... - ThePrint",
        "snippet": "With 8.39 crore hospital admissions under the scheme, fraudulent cases are under 0.5%. Saturday, January 11, 2025. Politics ... 3.42 lakh fraud cases detected under Ayushman Bharat-PMJAY. Over 56,000 unnecessary surgeries ... deactivation of e-cards, levying penalty on errant hospitals and lodging of FIRs are taken against fraudulent entities ...",
        "sentiment": "1 (Negative)",
        "link": "https://theprint.in/india/3-42-lakh-fraud-cases-detected-under-ayushman-bharat-pmjay-over-56000-unnecessary-surgeries/2402377/"
    },
    {
        "title": "Dr. Manohar Shinde - Cardiologist in Nashik - HexaHealth",
        "snippet": "Dr. Manohar Shinde is a Cardiologist in Nashik having 25 years of experience. View Dr. Manohar Shinde's contact number, fee and reviews. ... Dr Manohar Shinde did his: MD in Internal Medicine from BJ Medical College and Sassoon General Hospital, Pune ... Ayushman Bharat Card vs Health ID Piles in Men Piles vs Fissure vs Fistula ABHA Health ID ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.hexahealth.com/nashik/doctor/dr-manohar-shinde-cardiologist"
    },
    {
        "title": "Dr. Jaishree Manohar, MD - Rheumatologist in Sarasota, FL - Healthgrades",
        "snippet": "Dr. Jaishree Manohar, MD is a rheumatologist in Sarasota, FL. Dr. Manohar has extensive experience in Osteoporosis & Screening. ... please search for the provider's records on the linked state licensing board or the Federation of State Medical Boards. ... Superior clinical outcomes in surgical care across 15 of the most common in-hospital ...",
        "sentiment": "3 (Neutral)",
        "link": "https://www.healthgrades.com/physician/dr-jaishree-manohar-xlcfy"
    },
    {
        "title": "Dr. Ashan Manohar, MD - Onancock, VA | Gastroenterology - Doximity",
        "snippet": "American Board of Internal Medicine Internal Medicine; American Board of Internal Medicine Gastroenterology; Awards, Honors, & Recognition. CMS Meaningful Use Stage 1 Certification Acumen nEHR, Health IT Services Group, 2012-2013; Fellow (AGAF) American Gastroenterological Association, 2008 Fellow (FACG) American College of Gastroenterology Professional Memberships",
        "sentiment": "5 (Positive)",
        "link": "https://www.doximity.com/pub/ashan-manohar-md"
    },
    {
        "title": "Dr. Ashan Manohar, MD, Gastroenterology | Onancock, VA - WebMD",
        "snippet": "Dr. Ashan Manohar, MD, is a Gastroenterology specialist practicing in Onancock, VA with 38 years of experience. This provider currently accepts 67 insurance plans including Medicare and Medicaid. New patients are welcome. Hospital affiliations include Sentara Princess Anne Hospital.",
        "sentiment": "4 (Positive)",
        "link": "https://doctor.webmd.com/doctor/ashan-manohar-57782eb5-6f1a-4cde-9d7a-9554535269f3-overview"
    },
    {
        "title": "Dr. Jaishree Manohar, MD, Rheumatology | Sarasota, FL - WebMD",
        "snippet": "Dr. Jaishree Manohar, MD, is a Rheumatology specialist practicing in Sarasota, FL with 18 years of experience. This provider currently accepts 48 insurance plans including Medicare and Medicaid. New patients are welcome. Hospital affiliations include Sarasota Memorial Hospital.",
        "sentiment": "5 (Positive)",
        "link": "https://doctor.webmd.com/doctor/jaishree-manohar-a5cbd8ef-14ce-4815-b962-be4ea4fb61e6-overview"
    },
    {
        "title": "Dr. Manohar Joshi - Rheumatologist in Navi Mumbai - HexaHealth",
        "snippet": "Dr Manohar Joshi is a well-known Rheumatologist associated with Kokilaben Dhirubhai Ambani Hospital, Navi Mumbai. He has 18 years of experience in Rheumatology and has worked as an expert Rheumatologist in different cities in India. Doctor Manohar Joshi has contributed to handling numerous complex medical cases in several hospitals.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/navi-mumbai/doctor/dr-manohar-joshi-endocrinology"
    },
    {
        "title": "Dr. Manohar K N - Eka",
        "snippet": "Dr. Manohar K N is a MD(General Medicine) by training and has completed his and MBBS. What is the address of Dr. Manohar K N's clinic? Dr. Manohar K N currently practices at Medall Clumax Diagnostics - New Tippasandra which is located at: Krishna Quoin, 80 Feet Road, HAL 3rd Stage, New Tippasandra, Opp. Veer Hanuman Temple, Indiranagar ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.eka.care/doctor/dr-manohar-k-n-md-general-medicine-bengaluru"
    },
    {
        "title": "Dr. Vinayak Manohar, MD, Cardiovascular Disease - WebMD",
        "snippet": "Dr. Vinayak Manohar, MD, is a Cardiovascular Disease specialist practicing in Grand Rapids, MI with 20 years of experience. This provider currently accepts 46 insurance plans including Medicare and Medicaid. New patients are welcome. Hospital affiliations include Trinity Health Saint Marys Grand Rapids.",
        "sentiment": "4 (Positive)",
        "link": "https://doctor.webmd.com/doctor/vinayak-manohar-94c33cc5-b15e-4f0b-b57f-68d9ce16e6fd-overview"
    },
    {
        "title": "Dr. Manohar K N - Internal Medicine Specialist in Bangalore - Book ...",
        "snippet": "Dr. Manohar K N is a Internal Medicine Specialist in Bangalore having 23 years of experience. View Dr. Manohar K N's contact number, fee and reviews. ... He has handled numerous complex medical cases and is known for attention to detail, accurate diagnosis, and treating patients with empathy. ... Ayushman Bharat Card vs Health ID Piles in Men ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/bangalore/doctor/manohar-k-n"
    },
    {
        "title": "Dr. Naveen Manohar, MD - Pediatric Cardiologist in ... - Healthgrades",
        "snippet": "Dr. Naveen Manohar, MD is a pediatric cardiologist in Sacramento, CA and has over 30 years of experience in the medical field. He graduated from JAWAHARLAL INSTITUTE OF POST-GRADUATE MEDICAL EDUCATION / MADRAS UNIVERSITY in 1993. He is affiliated with medical facilities such as Mercy General Hospital and Mercy San Juan Medical Center. He is accepting new patients and telehealth appointments.",
        "sentiment": "1 (Negative)",
        "link": "https://www.healthgrades.com/physician/dr-naveen-manohar-ymk57"
    },
    {
        "title": "Dr. Ashan Manohar, MD - Gastroenterologist in Onancock, VA - Healthgrades",
        "snippet": "Dr. Ashan Manohar, MD is a gastroenterologist in Onancock, VA and has over 37 years of experience in the medical field. Dr. Manohar has extensive experience in Pancreatic Disease. He graduated from UNIVERSITY OF POITIERS / U.F.R. OF MEDICINE AND PHARMACY in 1987. He is affiliated with Riverside Shore Memorial Hospital. He is accepting new patients.",
        "sentiment": "4 (Positive)",
        "link": "https://www.healthgrades.com/physician/dr-ashan-manohar-34ryd"
    },
    {
        "title": "Dr. Manohar C V - Joint Replacement Surgeon in Bangalore - HexaHealth",
        "snippet": "Dr. Manohar C V is a Joint Replacement Surgeon in Bangalore having 28 years of experience. View Dr. Manohar C V's contact number, fee and reviews. ... Doctor Manohar has contributed to handling many complex medical cases in several hospitals. He is known for his attention to accurate diagnosis and for treating patients with empathy ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/bangalore/doctor/dr-manohar-c-v-orthopedic-doctor"
    },
    {
        "title": "List of Diseases Covered in Ayushman Bharat - Download PDF - HexaHealth",
        "snippet": "The Ayushman Bharat Yojana has led to the creation of new healthcare facilities and the strengthening of existing ones, which has improved the overall healthcare infrastructure in the country.. Access to Quality Healthcare: The Ayushman Bharat Covered Diseases List provides the beneficiaries with quality healthcare services.It ensures that they receive the necessary medical treatment without ...",
        "sentiment": "2 (Negative)",
        "link": "https://www.hexahealth.com/blog/ayushman-bharat-covered-diseases-list"
    },
    {
        "title": "Chirayu Medical College and Hospital",
        "snippet": "In a small 20-bed hospital in the year 1992, an establishment that would grow into one of Central India's biggest healthcare group was born. After 5 years of incredible hard work and a distant vision and efforts of our founder Dr. Ajay Goenka, we managed to upgrade into a premier super specialty hospital with 100 beds.",
        "sentiment": "5 (Positive)",
        "link": "https://cmchbhopal.com/"
    },
    {
        "title": "Dr. Manohar Senra, MD, Critical Care Medicine | Downey, CA - WebMD",
        "snippet": "Dr. Manohar Senra, MD, is a Critical Care Medicine specialist practicing in Downey, CA with 49 years of experience. This provider currently accepts 112 insurance plans. New patients are welcome. Hospital affiliations include Los Angeles Community Hospital At Norwalk.",
        "sentiment": "4 (Positive)",
        "link": "https://doctor.webmd.com/doctor/manohar-senra-c563d37c-3a77-4a0f-bc1d-2f6f5bc2937a-overview"
    },
    {
        "title": "Dr. Naveen Manohar, MD, Cardiovascular Disease - WebMD",
        "snippet": "Dr. Naveen Manohar, MD, is a Cardiovascular Disease specialist practicing in Sacramento, CA with 32 years of experience. ... Dr. Manohar graduated from the Jawaharlal Inst of Post-Graduate Medical Education and Research (Jipmer) in 1993. ... BCBS Blue Card PPO; Blue Cross CA Select PPO; Aetna Choice POS II;",
        "sentiment": "4 (Positive)",
        "link": "https://doctor.webmd.com/doctor/naveen-manohar-e96a9e2f-9ec9-4884-9835-5b63746e5da5-overview"
    },
    {
        "title": "Dr. Tanvi Manohar, MD - Infectious Disease Internist in ... - Healthgrades",
        "snippet": "Dr. Tanvi Manohar, MD is an infectious disease internist in Gainesville, FL. She is affiliated with medical facilities UF Health Shands Hospital and HCA Florida Osceola Hospital. Skip navigation. Menu. Menu. Find a Doctor. Find a Doctor ... Get your prescription for as low as $4 with our free coupons or discount card, usable at over 64,000 ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.healthgrades.com/physician/dr-tanvi-manohar-xyn94lb"
    },
    {
        "title": "Vyapam scam - Wikipedia",
        "snippet": "The Vyapam scam was an entrance examination, admission and recruitment scam.It was functional since the 1990s and was finally unearthed in the Indian state of Madhya Pradesh in 2013. [1]The scam involved politicians, senior and junior officials and businessmen systematically employing imposters to write papers, manipulate exam hall seating arrangements and supply forged answer sheets by ...",
        "sentiment": "4 (Positive)",
        "link": "https://en.wikipedia.org/wiki/Vyapam_scam"
    },
    {
        "title": "Dr. Priti Manohar, MD, Child Neurology | Edinburg, TX | WebMD",
        "snippet": "Dr. Priti Manohar, MD, is a Child Neurology specialist practicing in Edinburg, TX with 32 years of experience. This provider currently accepts 41 insurance plans including Medicare and Medicaid. New patients are welcome. Hospital affiliations include Dhr Health Edinburg.",
        "sentiment": "3 (Neutral)",
        "link": "https://doctor.webmd.com/doctor/priti-manohar-1b3a0313-e38f-4f0f-8667-635d7089061c-overview"
    },
    {
        "title": "Dr. Leslie Manohar, MD",
        "snippet": "Dr. Leslie Manohar, MD is an orthopedic surgeon in Champaign, IL and has over 19 years of experience in the medical field. She graduated from University of Chicago in 2005. She is affiliated with medical facilities Carle Bromenn Medical Center and Carle Foundation Hospital.",
        "sentiment": "4 (Positive)",
        "link": "https://www.healthgrades.com/physician/dr-leslie-manohar-3l6lv"
    },
    {
        "title": "Dr. Murli Manohar, MD, Allergy & Immunology | Canton, OH - WebMD",
        "snippet": "Dr. Murli Manohar, MD, is an Allergy & Immunology specialist practicing in Canton, OH with 49 years of experience. ... Dr. Manohar graduated from the Queens Univ Fac of Med in 1976. He works in Canton, OH and 2 other locations and specializes in Allergy & Immunology, Internal Medicine and Infectious Disease. Dr. Manohar is affiliated with ...",
        "sentiment": "4 (Positive)",
        "link": "https://doctor.webmd.com/doctor/murli-manohar-ce3ae737-edcc-4cba-aeb7-2f385de54b33-overview"
    },
    {
        "title": "Dr. Manohar Shetty, MD - Psychiatry - St. Clair Health",
        "snippet": "Find information about and book an appointment with Dr. Manohar Shetty, MD. Specialties: Psychiatry. Careers; Giving; Follow My Health; Search for: Search. Our Services. ... Manohar Shetty, MD Psychiatry. Summary; Experience; Insurance; Ages Seen. Adult (18+) Older Adult (65+) ... St. Clair Hospital is always updating its website to enhance ...",
        "sentiment": "4 (Positive)",
        "link": "https://providers.stclair.org/provider/manohar-shetty/2696911"
    },
    {
        "title": "Dozens charged in Atlanta-based money laundering operation that ...",
        "snippet": "Federal agents have arrested twenty-four individuals for their involvement in a large-scale fraud and money laundering operation that targeted citizens, corporations, and financial institutions throughout the United States. Business email compromise schemes, romance fraud scams, and retirement account scams, among other frauds, duped numerous victims into losing more than $30",
        "sentiment": "1 (Negative)",
        "link": "https://www.justice.gov/usao-ndga/pr/dozens-charged-atlanta-based-money-laundering-operation-funneled-30-million-proceeds"
    },
    {
        "title": "Dr. Prerana Manohar, MD, Internal Medicine | Grand Rapids, MI - WebMD",
        "snippet": "Dr. Prerana Manohar, MD, is an Internal Medicine specialist practicing in Grand Rapids, MI with 29 years of experience. This provider currently accepts 23 insurance plans including Medicare and Medicaid. New patients are welcome. Hospital affiliations include Trinity Health Saint Marys Grand Rapids.",
        "sentiment": "4 (Positive)",
        "link": "https://doctor.webmd.com/doctor/prerana-manohar-06056b6c-edad-4f9e-a7ef-d0a6ed2c5a26-overview"
    },
    {
        "title": "Dr. Shonith Manohar, MD",
        "snippet": "Dr. Shonith Manohar, MD is a pain medicine physician in Jacksonville, FL and has over 32 years of experience in the medical field. ... Compare Dr. Manohar with our nearby Pain Medicine Physicians at HCA Florida Orange Park Hospital. Make an appointment at HCA Florida Orange Park Hospital today at (904) 643-6038. Dr. Marisol Arcila, MD. 4 Ratings.",
        "sentiment": "4 (Positive)",
        "link": "https://www.healthgrades.com/physician/dr-shonith-manohar-32xtc"
    },
    {
        "title": "Neuro Rehab & Pain Institute: Priti Manohar, MD - Yelp",
        "snippet": "Specialties: About Dr. Manohar Neuro Rehab & Pain Institute offers exceptional care to people of all ages, from infants to adults and through their retirement years. At the office in Edinburg, Texas, Priti Manohar, MD, provides the full scope of neurological care with a special interest in epilepsy and seizures. She combines her expertise in neurology with her dedication to giving personal ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.yelp.com/biz/neuro-rehab-and-pain-institute-mcallen"
    },
    {
        "title": "Dr. Manohar Vajja, MD - Dallas, TX | Internal Medicine - Doximity",
        "snippet": "Dr. Manohar Vajja, MD is a board certified internist in Dallas, Texas. He is currently licensed to practice medicine in Texas. He is affiliated with Select Specialty Hospital-South Dallas, Methodist Charlton Medical Center, and Vibra Specialty Hospital at DeSoto.",
        "sentiment": "5 (Positive)",
        "link": "https://www.doximity.com/pub/manohar-vajja-md"
    },
    {
        "title": "Dr. Vinayak Manohar, MD, Cardiologist - Grand Rapids, MI - Sharecare",
        "snippet": "Dr. Manohar graduated from Thomas Jefferson University.Dr. Vinayak Manohar, MD is a Cardiologist in Grand Rapids, MI and has 19 years experience. Dr. Manohar currently practices at Practice and are affiliated with Corewell Health Butterworth Hospital, Trinity Health Grand Rapids Hospital and Sparrow Hospital.",
        "sentiment": "1 (Negative)",
        "link": "https://www.sharecare.com/doctor/dr-vinayak-a-manohar"
    },
    {
        "title": "Find a Doctor - Dr. Ram Manohar Lohia Institute of Medical Sciences",
        "snippet": "Hospital No(s) 0522-6692000, 6692001 | Helpline No- 0522-6692000 | Ayushman Helpline number/CUG:- +91-8188098620. Change Language: Enquiry; Route Map; Contact; Home; About Us. Dr RMLIMS Act; Citizen Charter; About Us; Infrastructure; ... Dr. Ram Manohar Lohia Institute of Medical Sciences",
        "sentiment": "4 (Positive)",
        "link": "https://drrmlims.ac.in/find-doctor"
    },
    {
        "title": "Dr. Vinayak Manohar, MD - Cardiologist in Grand Rapids, MI - Healthgrades",
        "snippet": "Dr. Vinayak Manohar, MD is a cardiologist in Grand Rapids, MI and has over 18 years of experience in the medical field. Dr. Manohar has extensive experience in Adult Congenital Heart Conditions and Heart Conditions. He graduated from Thomas Jefferson University in 2006. He is affiliated with medical facilities such as Corewell Health Butterworth Hospital and Trinity Health Grand Rapids Hospital.",
        "sentiment": "4 (Positive)",
        "link": "https://www.healthgrades.com/physician/dr-vinayak-manohar-34l3g"
    }
]