[
    {
        "title": "Arun Kumar Manglik v. Chirayu Health and Medicare Private Ltd. & Anr ...",
        "snippet": "Although, Dr. Goenka did not went (sic) to hospital to see the patient as the patient admitted there as per his assurance and advice, therefore, the Ethics committee prima facie found that there is a professional misconduct on the part of both the doctors and decided to issue a warning to Dr. A. Goenka and Dr. Abhay Tyagi with the directions to ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.supremecourtcases.com/arun-kumar-manglik-v-chirayu-health-and-medicare-private-ltd-anr/"
    },
    {
        "title": "Arun Kumar Manglik v. Chirayu Health & Medicare Private Ltd ... - CaseMine",
        "snippet": "The NCDRC has set aside an order of the SCDRC holding the respondents guilty of medical negligence in the treatment of the spouse of the appellant, which eventually led to her death on 15 November 2009. In consequence, the award of compensation of Rs. 6,00,000 awarded, together with interest, has been reversed. ... and Dr Abhay Tyagi.",
        "sentiment": "1 (Negative)",
        "link": "https://www.casemine.com/judgement/in/5d3acf89b338d145e2fc0c25"
    },
    {
        "title": "Chirayu Health And M... v. Arun Kumar Manglik (S) - CaseMine",
        "snippet": "Vijay Verma, Dr. Abhay Tyagi and Dr. Mohammad Akeel Khan and Dr. Atul Singhai monitored the condition of the deceased. ... -cum-Disciplinary committee had already decided that the complainant Arun Kumar Manglik had failed to prove the case of medical negligence against the accused doctor and closed the case on n 24.02.2009 and communicated the ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.casemine.com/judgement/in/5e4ef25746571b56b1ea51db"
    },
    {
        "title": "Your Doctor Might Have a Disciplinary Record. Here's How ... - ProPublica",
        "snippet": "Doctors can be disciplined for criminal convictions, medical negligence, wrongly prescribing controlled substances and other wrongdoing. ... To find information about a doctor, the best place to start is your state medical board's license lookup page. Each state has a different process for looking up doctors and getting disciplinary records, if ...",
        "sentiment": "4 (Positive)",
        "link": "https://projects.propublica.org/graphics/investigating-doctors"
    },
    {
        "title": " Government of India Ministry of Health and Family Welfare Unstarred ...",
        "snippet": "(e ) the other measures being taken by the Government to deal with complaints of medical negligence? ANSWER THE MINISTER OF STATE IN THE MINISTRY OF HEALTH AND FAMILY WELFARE ... 06 19-20.02.2015 Dr. A. Goenkaand Dr. Abhay Tyagi Warning 07 19-20.02.2015 Dr. M. L. Sharma Remove for 1 (O ne) Y ear 08 19-20.02.2015 Dr. Gaurav Bansal and Dr. V.K.",
        "sentiment": "1 (Negative)",
        "link": "https://sansad.in/getFile/loksabhaquestions/annex/14/AU4774.pdf?source=pqals"
    },
    {
        "title": "Dr. Abhay Tyagi, MD - Anesthesiologist in Boston, MA - Healthgrades",
        "snippet": "Dr. Abhay Tyagi, MD is an anesthesiologist in Boston, MA. 0 (0 ratings) Leave a review. Practice. 736 Cambridge St Boston, MA 02135. Make an Appointment (617) 789-2777. Share Save (617) 789-2777. Overview Experience Insurance Ratings About Me Locations. ADVERTISEMENT. Save money with free prescription discounts.",
        "sentiment": "1 (Negative)",
        "link": "https://www.healthgrades.com/physician/dr-abhay-tyagi-7cr0qwl048"
    },
    {
        "title": "Abhay Tyagi, MD - Brighton, MA - Anesthesiologist - Doctor.com",
        "snippet": "We're currently processing your request and we'll be in touch soon. For a faster response, please call us directly at 888-666-8135.",
        "sentiment": "5 (Positive)",
        "link": "https://www.doctor.com/Abhay-Tyagi"
    },
    {
        "title": "Qamar Jahan & Anr. vs Dr. Nisar Ahmed Tyagi & Ors. on 17 December, 2019",
        "snippet": "(4) The complainant filed brief synopsis of written arguments along with the following : (a) following medical literature: (i) Medical Negligence by Michael A. Jones (relevant pages). (ii) Blood transfusion - kidney disease (iii) Review Research Paper: \"Critic and Sceptics of Medico-legal Autopsy Guidelines In Indian Context\" J Indian Acad Forensic Med. October-December 2013, Vol. 35, No. 4",
        "sentiment": "1 (Negative)",
        "link": "https://indiankanoon.org/docfragment/3488065/?formInput=medical+negligence+++written+arguments"
    },
    {
        "title": "‪Dr. Sachin Tyagi‬ - ‪Google Scholar‬",
        "snippet": "‪Principal Scientist & Head, MSI Department, CSIR-CSIO Chandigarh, India‬ - ‪‪Cited by 2,020‬‬ - ‪Magnetic and Dielectric Materials‬ - ‪Ferrites and Ferrites Based Composites‬ - ‪Sensors‬ - ‪Biomaterials‬",
        "sentiment": "4 (Positive)",
        "link": "https://scholar.google.com/citations?user=103qZzwAAAAJ&hl=en"
    },
    {
        "title": "Arun Kumar Manglik v. Chirayu Health And Medicare Private ... - CaseMine",
        "snippet": "Dr D.Y. Chandrachud, J.— Delay condoned. Leave granted. The National Consumer Disputes Redressal Commission (Ncdrc) has set aside 2016 SCC OnLine NCDRC 2723 an order of the M.P. State Consumer Disputes Redressal Commission holding the respondents guilty of medical negligence in the treatment of the spouse of the appellant which eventually led to her death on 15-11-2009.",
        "sentiment": "1 (Negative)",
        "link": "https://www.casemine.com/judgement/in/5c752cc7b338d10630e1b6e7"
    },
    {
        "title": "Dr. Abhay Tyagi, MD, Anesthesiology Specialist - Sharecare",
        "snippet": "Dr. Abhay Tyagi, MD is a anesthesiology specialist in Boston, MA. He currently practices at Practice. Hamburger Menu. x. Home. Solutions. Employer Health plan Public sector Brokers & consultants Provider Life ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.sharecare.com/doctor/dr-abhay-tyagi-7cr0qwl048"
    },
    {
        "title": "Abhay tyagi - Defence Research and Development Organisation (DRDO ...",
        "snippet": "I am an experienced professional in the e-learning industry, currently pursuing a… · Experience: Defence Research and Development Organisation (DRDO) · Education: Graphic Era Deemed to be University · Location: Dehra Dun · 500+ connections on LinkedIn. View Abhay tyagi's profile on LinkedIn, a professional community of 1 billion members.",
        "sentiment": "5 (Positive)",
        "link": "https://in.linkedin.com/in/abhay-tyagi-6a4b35209"
    },
    {
        "title": "Dr. ABHAY TYAGI - General Physician - Practo",
        "snippet": "A: Dr. ABHAY TYAGI is a Doctor and has an experience of 12 years in this field. The doctor completed MBBS from Mahe University in 2011.. The doctor completed MBBS from Mahe University in 2011.. View more details about the doctor on Practo.",
        "sentiment": "3 (Neutral)",
        "link": "https://www.practo.com/noida/doctor/abhay-tyagi-general-physician"
    },
    {
        "title": "Arun Kumar Manglik vs Chirayu Health And Medicare Private Ltd ... on 9 ...",
        "snippet": "1 NCDRC 2 SCDRC 2 respondents guilty of medical negligence in the treatment of the spouse of the appellant which eventually led to her death on 15 November 2009. In consequence, the award of compensation of Rs. 6,00,000 awarded, together with interest, has been reversed. ... and Dr Abhay Tyagi. The Ethics Committee observed thus:",
        "sentiment": "1 (Negative)",
        "link": "https://indiankanoon.org/doc/11225479/"
    },
    {
        "title": "smartcityhospital",
        "snippet": "Dr. Abhay Tyagi Director . TESTIMONIAL What Our Client's Say's. Ramesh Kumar Gurbani. I, would like to express my most sincere thanks and deep appreciation for all the love, affection and tender care received by me during the past two months by the entire management and staff of your world class hospital. From the time I entered, for the ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.smartcityhospital.in/"
    },
    {
        "title": "smartcityhospital",
        "snippet": "+91 0755-2979500/501,9109101823,24; care@smartcityhospital.in; Bharat Scout & Guide Building,Depot Square,Shyamla Hills,Shanti Marg, Bhopal-462003(M.P.)",
        "sentiment": "3 (Neutral)",
        "link": "https://www.smartcityhospital.in/doctor_detail.php?id=2"
    },
    {
        "title": "Abhay Tyagi - GoMechanic.in | LinkedIn",
        "snippet": "As I believe in myself of being passionate and creative about designing, I am looking for… · Experience: GoMechanic.in · Education: Amity University · Location: Ghaziabad · 500+ connections on LinkedIn. View Abhay Tyagi's profile on LinkedIn, a professional community of 1 billion members.",
        "sentiment": "5 (Positive)",
        "link": "https://in.linkedin.com/in/abhay-tyagi-1956a8207"
    },
    {
        "title": "smartcityhospital",
        "snippet": "+91 0755-2979500/501,9109101823,24; care@smartcityhospital.in; Bharat Scout & Guide Building,Depot Square,Shyamla Hills,Shanti Marg, Bhopal-462003(M.P.)",
        "sentiment": "1 (Negative)",
        "link": "https://www.smartcityhospital.in/alldoctor.php"
    },
    {
        "title": "Abhay Tyagi - Infosys | LinkedIn",
        "snippet": "View Abhay Tyagi's profile on LinkedIn, a professional community of 1 billion members. I am a Java developer currently working with Infosys. I am skilled in Core Java, Spring… · Experience: Infosys · Education: AMITY University Gurgaon · Location: Pune · 345 connections on LinkedIn. View Abhay Tyagi's profile on LinkedIn, a ...",
        "sentiment": "5 (Positive)",
        "link": "https://in.linkedin.com/in/abhay-tyagi-95a3b0206"
    },
    {
        "title": "Dr. Abhay Tyagi, MD - Hinsdale, MA | Anesthesiology - Doximity",
        "snippet": "Dr. Abhay Tyagi, MD is an anesthesiologist in Hinsdale, Massachusetts. Dr. Tyagi is on Doximity. As a Doximity member you'll join over two million verified healthcare professionals in a private, secure network.",
        "sentiment": "4 (Positive)",
        "link": "https://www.doximity.com/pub/abhay-tyagi-md"
    },
    {
        "title": "Dr. Abhay Tyagi, NEW DELHI - Book appointment now | Curofy",
        "snippet": "Dr. Abhay Tyagi - Anesthesiologist in NEW DELHI. Book online appointment, discuss cases together, get contact number, years of experience, medical degrees, qualification, other doctors recommendation for Dr. Abhay Tyagi | Curofy",
        "sentiment": "1 (Negative)",
        "link": "https://curofy.com/doctor/dr-abhay-tyagi-anesthesia-drabhaytyagi"
    },
    {
        "title": "Dr. Abhay Tyagi, Anesthesiologist in New Delhi - Book Appointment ...",
        "snippet": "Dr. Abhay Tyagi - Anesthesiologist in New Delhi. Book online appointment, check email and contact number, years of experience, medical degrees, qualification a Dr. Abhay Tyagi, Anesthesiologist in New Delhi - Book Appointment - MedSynapse",
        "sentiment": "5 (Positive)",
        "link": "https://www.medsynapse.app/doctors/dr-abhay-tyagi-79842"
    },
    {
        "title": "Isha Tyagi, MD | Sarah Bush Lincoln",
        "snippet": "The SBL Heart Center offers comprehensive cardiovascular services, including advanced diagnostic testing, treatments, and rehabilitation, providing exceptional care close to home in a spacious, state-of-the-art facility.",
        "sentiment": "3 (Neutral)",
        "link": "https://www.sarahbush.org/physicians/profile/497/isha-tyagi-md/"
    },
    {
        "title": "(PDF) Critical analysis study on various Indian legislations for ...",
        "snippet": "A medical malpractice case is one in which a doctor, dentist, nurse or other health care practitioner mistreats a patient in a manner that is incompetent, incompetent, or negligent. ... E., Singh, N., & Tyagi, S. (2022). Medical Negligence: A Critical Analysis on arious Indian egislation. International Journal of ealth Sciences, 6(S ), 81 1 ...",
        "sentiment": "2 (Negative)",
        "link": "https://www.academia.edu/96812551/Critical_analysis_study_on_various_Indian_legislations_for_medical_negligence"
    }
]