[
    {
        "title": "Chirayu University",
        "snippet": "Chirayu Medical College and Hospital Bhopal (A Constituent College of Chirayu University) ... Dr. Ashutosh Mangalgiri Principal, Chirayu Paramedical College. Qualifications: MBBS, MS. (Anatomy) Teaching Experience: 20 Years. Mob.: +91 9993366621 Email: ashutoshmangalgiri@yahoo.co.in Fax: +91 755-2709132.",
        "sentiment": "4 (Positive)",
        "link": "https://chirayuuniversity.ac.in/Our_Team"
    },
    {
        "title": " Name: DR. ASHUTOSH SUDHAKAR MANGALGIRI Professor, Department of Anatomy ...",
        "snippet": "Name: DR. ASHUTOSH SUDHAKAR MANGALGIRI Professor, Department of Anatomy Chirayu Medical College & Hospital, Bhopal I] Research Paper Publications: 1. Mangalgiri AS, Patil M, Sherke AR, Longia GS Study of Infra renal segment of Inferior vena cava and associated accessory renal artery: A Case Report. J. Anatomical Society of India. 2007; 56 (2 ...",
        "sentiment": "1 (Negative)",
        "link": "https://cmchbhopal.com/pdf/drmangalgiri.pdf"
    },
    {
        "title": "Chirayu Medical College Bhopal Cut off, Fees (MBBS,PG), Admission 2024",
        "snippet": "Associated Hospital: Chirayu Hospital Bhopal: Hospital Bed capacity: 1200 Teaching Beds: Daily Patient Flow: ... NEET UG 2024 Admit card; NEET 2024 Score card with All India Rank; Provisional Allotment Letter generated online; ... Dr. Ashutosh Mangalgiri, MBBS, MS. (Anatomy), 20 Years Exp. DR. SHIV SHANKER, Prof, General Medicine;",
        "sentiment": "4 (Positive)",
        "link": "https://careeredwise.com/chirayu-medical-college-and-hospital-bhopal/"
    },
    {
        "title": " Departmental information 1. Department name : Anatomy 2. Institution ...",
        "snippet": "1. Department name : Anatomy 2. Institution name : Chirayu Medical College & Hospital 3. Courses offered : MBBS, MD 4. Departmental Library-cum-Seminar Room : a) Accommodation i) Size : 37.25 sq. mts ii) Capacity : 14 b) Number of books in Anatomy and allied subjects :119Books c) List of Journals : 5 Journals (Available in the Central Library)",
        "sentiment": "1 (Negative)",
        "link": "https://cmchbhopal.com/pdf/final-Anatomy-Departmental-information.pdf"
    },
    {
        "title": "Chirayu Medical College & Hospital Bhopal",
        "snippet": "info@cmchbhopal.com; 0755 2709101/102/103; Chirayu Medical College & Hospital. Bhainsakhedi,Near Bairagarh (Bhopal-Indore Highway), Bhopal, M.P. - 462030",
        "sentiment": "4 (Positive)",
        "link": "https://cmchbhopal.com/medical-superintendent-profile/"
    },
    {
        "title": "Dr. Ashutosh Mangalgiri in Bhopal | Doctors in Bhopal | India | zmedhealth",
        "snippet": "Dr. Ashutosh Mangalgiri, Doctors in Bhopal, India. specialist in Bhopal India - reviews,fees,forum,appointment,hospital affiliations - zmedhealth. support@zmedhealth.com. Directory Select Disease ... Dr. Ashutosh Mangalgiri Reviews Address: Chirayu Medical College Bhopal",
        "sentiment": "1 (Negative)",
        "link": "https://www.zmedhealth.com/d-29033/Dr.-Ashutosh-Mangalgiri"
    },
    {
        "title": "Chirayu Medical College & Hospital Bhopal",
        "snippet": "info@cmchbhopal.com; 0755 2709101/102/103; Chirayu Medical College & Hospital. Bhainsakhedi,Near Bairagarh (Bhopal-Indore Highway), Bhopal, M.P. - 462030",
        "sentiment": "4 (Positive)",
        "link": "https://cmchbhopal.com/management-team/"
    },
    {
        "title": "Sahyadri Super Speciality Hospital, Nashik | Hospital in Nashik",
        "snippet": "Dr. Ashutosh Sahu is Full time Sr. Interventional Cardiologist in Sahyadri Super Speciality Hospital Nashik, He completed his MBBS from Government Medical college, Nagpur in 1996, MD in Internal Medicine MGM Medical College Indore in 2002, DM in Interventional Cardiology from GB Pant Hospital, Maulana Azad Medical College, Delhi University, New ...",
        "sentiment": "5 (Positive)",
        "link": "https://sahyadrihospital.com/nashik-2/"
    },
    {
        "title": "Dr. Ashutosh Soni - General Surgeon in Indore - HexaHealth",
        "snippet": "Dr Ashutosh Soni is a well-known General Surgery currently associated with Bombay Hospital, Indore. He has 40 years of experience in General Surgery and worked as an expert General Surgeon in different cities of India. ... Dr Ashutosh Soni did his MBBS from NSB Medical College, Jabalpur, MP in 1984, MS General Surgery from NSB Medical College ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/indore/doctor/dr-ashutosh-soni-general-surgeon"
    },
    {
        "title": "Dr. Ashutosh, Ophthalmologist - Geetasri Clinic | Sehat",
        "snippet": "Profile of Dr. Ashutosh, Ophthalmologist in Dhanbad: Get complete information about Dr. Ashutosh MBBS, MS (Ophthalmol practicing at Geetasri Clinic, his specialities, expertise with complete address, appointment phone numbers, timings, awards and associated hospital information | Sehat ... Dr. Ashutosh's Hospital/Clinic & Staff. Ease of ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.sehat.com/dr-ashutosh-eye-doctor-dhanbad"
    },
    {
        "title": "Dr. Ashutosh Agarwal | Arthroscopic & Joint Replacement Surgeon",
        "snippet": "Welcome To Ayushman Hospital. A center of excellence for bone & joint problem management. Our 360 degree approach to treatment has made us the preferred choice for treating all types of musculo-skeletal related problems from trauma care to Arthroscopy, sports medicine, joint replacement surgery and limb reconstructions. Ayushman hospital is a one stop center for management of all types of ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.drashutoshagarwal.com/"
    },
    {
        "title": "Dr. Ashutosh Kumar Pandey - Cardiothoracic and Vascular Surgeon in ...",
        "snippet": "Dr. Ashutosh Kumar Pandey is a Cardiothoracic and Vascular Surgeon in Lucknow having 12 years of experience. View Dr. Ashutosh Kumar Pandey's contact number, fee and reviews. ... MBBS, MS General Surgery, MCh Vascular Surgery. 12+ Years. Experience. 99% Recommended (97 Ratings) 12 + ... Ayushman Bharat Card vs Health ID Piles in Men Piles vs ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/lucknow/doctor/dr-ashutosh-kumar-pandey-vascular-and-endovascular-surgery"
    },
    {
        "title": "Dr. Ashutosh Marwah | Official Website | Paediatric Cardiologist",
        "snippet": "Dr Ashutosh Marwah Fellowship in Pediatric Cardiology- Melbourne, Australia (MBBS, MD, Pediatrics) Dr. Ashutosh Marwah is a Director paediatric cardiologist practicing at Fortis Escorts Heart Institute, Okhla Road New Delhi with 23 years of experience. Know More",
        "sentiment": "5 (Positive)",
        "link": "https://drashutoshmarwah.com/"
    },
    {
        "title": "Dr. Ashutosh Singh - Urologist - Book Appointment Online, View Fees ...",
        "snippet": "Dr. Ashutosh Singh is a Urologist in Sector 52, Noida and has an experience of 25 years in this field. Dr. Ashutosh Singh practices at Urology Clinic in Sector 52, Noida,Apollo Hospitals in Sector 26, Noida and Metro Hospitals & Heart Institute in Sector 12, Noida.",
        "sentiment": "2 (Negative)",
        "link": "https://www.practo.com/Noida/doctor/dr-ashutosh-singh-1-urologist"
    },
    {
        "title": "Dr. Ashutosh Niranjan - General Surgeon in Greater Noida - HexaHealth",
        "snippet": "Dr. Ashutosh Niranjan is a General Surgeon in Greater Noida having 35 years of experience. View Dr. Ashutosh Niranjan's contact number, fee and reviews. ... MBBS, MS General Surgery, Fellow of the Association of Surgeons of India, Honorary fellowship in Minimal Access Surgery ... Ayushman Bharat Card vs Health ID Piles in Men Piles vs Fissure ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/greater-noida/doctor/dr-ashutosh-niranjan-general-surgery"
    },
    {
        "title": "ASUTOSH MULTI SPECIALITY HOSPITAL - Practo",
        "snippet": "ASUTOSH MULTI SPECIALITY HOSPITAL is a Joint Replacement Surgery Hospital in Majura Gate, Surat. The clinic is visited by doctors like Dr. Viral Papaiya,Dr. Nagraj S. Shetty and Dr. Rajiv Raj Choudhry. The timings of ASUTOSH MULTI SPECIALITY HOSPITAL are: Mon-Sun: 00:00-23:59.",
        "sentiment": "4 (Positive)",
        "link": "https://www.practo.com/surat/hospital/asutosh-hospital"
    },
    {
        "title": "Ayushman Bharat (PMJAY) Hospitals List India - Download PDF - HexaHealth",
        "snippet": "The complete Ayushman Bharat hospital list can be found on the official PMJAY website. However, to find the nearest registered hospital under the PMJAY scheme, here's what you need to do. Step 1: Visit the PMJAY website, to get the Ayushman Bharat Hospital List. Click on 'Find Hospital' on the upper left bar",
        "sentiment": "4 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat"
    },
    {
        "title": "Psychiatrist in Indore | Dr. Ashutosh Singh's Personal Clinic",
        "snippet": "Dr.Ashutosh Singh (MBBS, DNB Psychiatry) is a Consultant Psychiatrist in Indore at Apollo Hospitals Indore & has started his 'Personal Clinic' as well at Mahalaxminagar Indore. Dr. Ashutosh is also a Visiting Psychiatrist at Indian Institute of Technology (IIT) Indore , Military Hospital Mhow & many other corporate hospitals at Indore. He has rich experience in General Psychiatry ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.psychiatrist-in-indore.com/"
    },
    {
        "title": "Dr. Ashutosh Kumar - Urologist - Book Appointment Online, View Fees ...",
        "snippet": "Dr. Ashutosh Kumar practices at Aashlok Hospital in Safdarjung Enclave, Delhi. She completed MBBS from Aryabhatta Knowledge University, Patna in 2013,MS - General Surgery from Aryabhatta Knowledge University, Patna in 2017 and DNB - Urology/Genito - Urinary Surgery from National Board Of Examination in 2019.",
        "sentiment": "4 (Positive)",
        "link": "https://www.practo.com/delhi/doctor/ashutosh-kumar-urologist"
    },
    {
        "title": "Dr. Ashutosh Mohapatra - Medical Gastroenterologist in Bhubaneswar ...",
        "snippet": "Dr. Ashutosh Mohapatra is a Medical Gastroenterologist in Bhubaneswar having 27 years of experience. View Dr. Ashutosh Mohapatra's contact number, fee and reviews. ... He has handled numerous complex medical cases and is known for attention to detail, accurate diagnosis, and treating patients with empathy. ... Ayushman Bharat Card vs Health ID ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.hexahealth.com/bhubaneswar/doctor/dr-ashutosh-mohapatra-medical-gastroenterology"
    },
    {
        "title": "Dr. Ashutosh Baghel - Urologist in Mira Bhayandar - HexaHealth",
        "snippet": "Dr. Ashutosh Baghel is a Urologist in Mira Bhayandar having 19 years of experience. View Dr. Ashutosh Baghel's contact number, fee and reviews. ... MBBS, MS General Surgery, DNB Urology. ... Ayushman Bharat Card vs Health ID Piles in Men Piles vs Fissure vs Fistula ABHA Health ID Card Ayushman Card Download Kidney Stone VS Gallstone.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/mira-bhayandar/doctor/dr-ashutosh-baghel-urologist"
    },
    {
        "title": "Dr. Ashutosh Agarwal | Arthroscopic & Joint Replacement Surgeon",
        "snippet": "6, Girinagar, Birdopur, Mahmoorganj. Varanasi, Uttar Pradesh, India. Phone :0542-2360181, 2362913 Helpline No. : +91-6394163274",
        "sentiment": "5 (Positive)",
        "link": "https://www.drashutoshagarwal.com/contact-us/"
    },
    {
        "title": "Dr. Ashutosh Jaiswal - Ophthalmologist/ Eye Surgeon - Practo",
        "snippet": "Dr. Ashutosh Jaiswal is a Ophthalmologist/ Eye Surgeon in Sakkardara, Nagpur and has an experience of 15 years in this field. Dr. Ashutosh Jaiswal practices at Netram Eye Hospital in Sakkardara, Nagpur.",
        "sentiment": "4 (Positive)",
        "link": "https://www.practo.com/Nagpur/doctor/ashutosh-9-ophthalmologist"
    },
    {
        "title": "Dr. Ashutosh Jha - Orthopedics in Ghaziabad - HexaHealth",
        "snippet": "Dr. Ashutosh Jha is a Orthopedics in Ghaziabad having 18 years of experience. View Dr. Ashutosh Jha's contact number, fee and reviews. ... Dr. Ashutosh Jha's qualifications are: MBBS, MS Orthopaedics, DNB Orthopaedics. ... Ayushman Bharat Card vs Health ID Piles in Men Piles vs Fissure vs Fistula ABHA Health ID Card Ayushman Card Download ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.hexahealth.com/ghaziabad/doctor/dr-ashutosh-jha-orthopaedics"
    },
    {
        "title": "Dr. Ashutosh Singh - Psychiatrist - Book Appointment Online ... - Practo",
        "snippet": "Dr. Ashutosh Singh is Psychiatrist in Mahalaxmi Nagar Colony , Indore. Book appointments Online, View Fees, User Feedbacks for Dr. Ashutosh Singh | Practo ... after completing his MBBS from MGM Medical College, Indore, ... 2014 - 2016 Visiting Consultant Psychiatrist at Medanta Hospital Indore. 2014 - Present Consultant Psychiatrist at Apollo ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.practo.com/indore/doctor/dr-ashutosh-singh-psychiatrist"
    },
    {
        "title": "MBBS Human Anatomy by Dr. Prasanna Veera Kumar Attada",
        "snippet": "The new Competency Based Medical Education (CBME) curriculum, which began with the 2019 MBBS batch, necessitates a shift in teaching undergraduate medical students away from the conventional technique and toward outcome-based learning.. I make every attempt to ensure that the Anatomy subject's teaching and learning methodologies meet the global standards, allowing my students to become world ...",
        "sentiment": "4 (Positive)",
        "link": "https://mbbsanatomy.com/"
    },
    {
        "title": "Dr. Ashutosh Agarwal, Orthopaedic Surgeon, Varanasi",
        "snippet": "Dr. Ashutosh Agarwal is a Orthopaedic Surgeon in Varanasi. Dr. Ashutosh Agarwal has done MBBS, MS. The Ayushman Hospital & Trauma Centre Clinic of Dr. Ashutosh Agarwal is at J 25/59, Alaipur, G.T. Road, In front of Varanasi City Railway Station - 221001 Services offered by Dr. Ashutosh Agarwal-We provides wide range of services within the field of Orthopedic like Knee Replacement, Hip ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.doctorsandhospitals.in/doctor/dr-ashutosh-agarwal-varanasi/"
    },
    {
        "title": "Dr. Ashutosh Singh - Paedicatric Cardic Surgeon - Thane, Indore ...",
        "snippet": "Dr. Ashutosh Singh - Working as Consultant - Paedicatric Cardic Surgeon, Doctor & Specialist in Paediatric Department at Jupiter Hospital, Thane, Indore - India. Thane Pune Indore +91-22 6297 5555",
        "sentiment": "4 (Positive)",
        "link": "https://www.jupiterhospital.com/doctors/dr-ashutosh-singh/"
    },
    {
        "title": "Dr. Ashutosh Agarwal | Arthroscopic & Joint Replacement Surgeon",
        "snippet": "Welcome to Dr. Ashutosh Agarwal . Phone No. : 0542-2214277, 2214677 Mobile No. : +91-6394163274. Home; Joint Replacement. Knee Replacement; ... Fracture & Injuries; Contact Us; Emergancy Service. Home; 24 X 7 Emergency Services. Ayushman Hospital has a full-fledged emergency department. Ayushman Hospital also has the reputation of being one of ...",
        "sentiment": "5 (Positive)",
        "link": "https://drashutoshagarwal.com/emergancy-service"
    },
    {
        "title": "Dr. Ashutosh Pandey - Paediatric and Neonatal Surgeon in Lucknow - Book ...",
        "snippet": "Dr. Ashutosh Pandey is a Paediatric and Neonatal Surgeon in Lucknow having 22 years of experience. View Dr. Ashutosh Pandey's contact number, fee and reviews. ... MBBS, MS General Surgery, MCh Paediatric Surgery. 22+ Years. Experience. 99% Recommended (98 Ratings) 22 + ... Ayushman Bharat Card vs Health ID Piles in Men Piles vs Fissure vs ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.hexahealth.com/lucknow/doctor/dr-ashutosh-pandey-paediatric-and-neonatal-surgeon"
    },
    {
        "title": "Dr. Ashutosh Mishra Panacea Hospital Best Diabetes Doctor, Varanasi ...",
        "snippet": "Dr. Ashutosh Mishra is a highly qualified and experienced Diabetes & Hormonal Diseases Expert in Varanasi with an impressive educational background. Learn more. Skip to content. Panacea Hospital & Diabetes Care Organisation. ☎ 1800 123 3070 +919389994334, 9971390430. Ayushman Bharat. CGHS.",
        "sentiment": "5 (Positive)",
        "link": "https://piire.org/dr-ashutosh-mishra-panacea-hospital-best-diabetes-doctor-varanasi/"
    },
    {
        "title": "Dr. Ashutosh Gupta - Neurologist - Book Appointment Online ... - Practo",
        "snippet": "Dr. Ashutosh Gupta is Neurologist in Rohini Sector 22 , Delhi. ... MBBS - West Bengal University of Health Sciences, 2010 ... Speciality Hospital Metro Hospital and Cancer Institute Venkateshwar Hospital Karuna Hospital Delhi Heart & Lung Institute Ayushman Hospital & Health Services Moolchand Hospital Jain Hospital St Stephens Hospital The ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.practo.com/delhi/doctor/ashutosh-gupta-neurologist"
    },
    {
        "title": "Dr. Manish Kumar Chhabra - Ayushman Hospital and Health Services",
        "snippet": "Ayushman Hopsital & Health Services, Sector 10, Dwarka, Delhi - 110075. Contact Number: +91 9205481438 (011) 49495566 & (011) 49495555 In Case of Emergency: (011) 49495500 E-Mail: info@ayushmanhhs.in",
        "sentiment": "4 (Positive)",
        "link": "https://www.ayushmanhhs.in/dr-manish-kumar-chhabra/"
    },
    {
        "title": "Dr. Ashutosh Sabnis - Spine Surgeon (Ortho) - Practo",
        "snippet": "Dr. Ashutosh Sabnis is Spine Surgeon (Ortho) in Parvati Gaon , Pune. Book appointments Online, View Fees, User Feedbacks for Dr. Ashutosh Sabnis | Practo ... MBBS, MS - Orthopaedics, Surgical Fellow on the Spine Service. Q: ... 2011 Spine Fellow at La Timone Hospital, Marseilles, France. Registrations. 2002052210 Maharashtra Medical Council, 2002.",
        "sentiment": "4 (Positive)",
        "link": "https://www.practo.com/pune/doctor/ashutosh-sabnis-spine-and-pain-specialist"
    },
    {
        "title": "Dr. Ashutosh Soni - General Surgeon in Indore | Credihealth",
        "snippet": "Medical School & Fellowships. MBBS - NSB Medical College, Rani Durgavati University, Jabalpur MP, 1984. MS - General Surgery - NSB Medical College, Rani Durgavati University, Jabalpur MP, 1987. Fellowship - Indian Association of Gastrointestinal Endo Surgeons, 2007. Fellowship - Minimal Access Surgery - , 2013 Fellowship - Laparoscopic GI Surgery - Seoul under Dr Kim and Dr Cho",
        "sentiment": "4 (Positive)",
        "link": "https://www.credihealth.com/doctor/ashutosh-soni-general-surgeon"
    },
    {
        "title": "Dr. Ashutosh Singh - Mental Health and Behavioral Sciences in Indore ...",
        "snippet": "The speciality interests of Dr Ashutosh are Psychotherapy, Child and Adolescent Psychiatry, Community Psychiatry, etc. He is also an active member of the Indian Psychiatric Society (IPS), the Indian Association of Private Psychiatry (IAPP), etc. Dr Ashutosh Singh did his graduation from Devi Ahilya Vishwavidyalaya, Indore in 2006.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/indore/doctor/dr-ashutosh-singh-mental-health-and-behavioral-sciences"
    },
    {
        "title": "Dr. Ashutosh Singh - Urologist in Noida - Book Online Appointment",
        "snippet": "Dr Ashutosh Singh did his MBBS from the University of Lucknow in 1998. He also completed his MS in General Surgery from KGMC, Lucknow in 2003 and MCh in Urology from AIIMS, New Delhi in 2008. ... Dr. Ashutosh Singh's qualifications are: MBBS, MS General Surgery, MCh Urology. ... Ayushman Bharat Card vs Health ID Piles in Men Piles vs Fissure vs ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.hexahealth.com/NOIDA/doctor/dr-ashutosh-singh-urology"
    },
    {
        "title": "Surgical Oncologist in Sonipat | Dr. Ashutosh Chauhan - Dayanand Hospital",
        "snippet": "MBBS, MS-General Surgery, DNB Surgical Oncology, General Surgery Senior Consultant, Surgical oncology Dayanand Cancer Hospital, Sonipat. Dr Ashutosh Chauhan completed his postgraduation in General Surgery at a famous university in Mumbai and Diplomate of National Board of Examination for the same.",
        "sentiment": "4 (Positive)",
        "link": "http://dayanandhospital.in/dr-ashutosh-chauhan"
    },
    {
        "title": "Dr. Ashutosh Sharan, General Surgeon - Contact Details for ... - Sehat",
        "snippet": "Profile of Dr. Ashutosh Sharan, General Surgeon in Motihari: Get complete information about Dr. Ashutosh Sharan MBBS, MS, his specialities, expertise with complete address, appointment phone numbers, timings, awards and associated hospital information | Sehat ... Dr. Ashutosh Sharan's Hospital/Clinic & Staff. Ease of scheduling appointments. 0 ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.sehat.com/dr-ashutosh-sharan-general-surgeon-motihari"
    },
    {
        "title": "Dr. Ashutosh Gupta - Maternal Foetal Medicine Specialist in Gurgaon ...",
        "snippet": "Dr. Ashutosh Gupta is a Maternal Foetal Medicine Specialist in Gurgaon having 24 years of experience. View Dr. Ashutosh Gupta's contact number, fee and reviews. ... MBBS, MS Obstetrics and Gynaecology, DM Medical Genetics. 24+ Years. Experience. 99% Recommended ... Ayushman Bharat Card vs Health ID Piles in Men Piles vs Fissure vs Fistula ABHA ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.hexahealth.com/gurgaon/doctor/dr-ashutosh-gupta-maternal-foetal-medicine"
    },
    {
        "title": "Dr. Ashutosh Mishra - Endocrinologist in Varanasi - HexaHealth",
        "snippet": "Dr. Ashutosh Mishra is a Endocrinologist in Varanasi having 20 years of experience. View Dr. Ashutosh Mishra's contact number, fee and reviews. ... Dr Ashutosh Mishra did his MBBS, MD Medicine from IMS BHU and also completed Fellowship in Diabetes from CMC Vellore and Msc Endocrinology from South Wales, London. ... Ayushman Bharat Card vs ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.hexahealth.com/varanasi/doctor/dr-ashutosh-mishra-endocrinologist"
    },
    {
        "title": "Dr. Ashutosh Kumar - Urologist in Delhi - HexaHealth",
        "snippet": "Dr. Ashutosh Kumar is a Urologist in Delhi having 10 years of experience. View Dr. Ashutosh Kumar's contact number, fee and reviews. ... Dr. Ashutosh Kumar's qualifications are: MBBS, MS General Surgery, DNB Urology. ... Ayushman Bharat Card vs Health ID Piles in Men Piles vs Fissure vs Fistula ABHA Health ID Card Ayushman Card Download Kidney ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/delhi/doctor/dr-ashutosh-kumar-urology"
    },
    {
        "title": "Dr. Ashutosh Shukla - Internal Medicine Specialist in Gurgaon - Book ...",
        "snippet": "Dr. Ashutosh Shukla is a Internal Medicine Specialist in Gurgaon having 34 years of experience. View Dr. Ashutosh Shukla's contact number, fee and reviews. ... He has handled numerous complex medical cases and is known for attention to detail, accurate diagnosis and treating patients with empathy. ... Ayushman Bharat Card vs Health ID Piles in ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/GURGAON/doctor/dr-Ashutosh-Shukla-Internal-Medicine"
    },
    {
        "title": "Best Vascular Surgeon in India | Dr. Ashutosh",
        "snippet": "Meet Dr. Ashutosh Kumar Pandey, Renowned as the best vascular surgeon in India. ... MS - General Surgery (2016) -, Post Graduate Institute of Medical Education & Research, Chandigarh; MBBS (2012) - BRD Medical College, DDU Gorakhpur University; Clinical Experience. Tender Palm Super Specialty Hospital, Lucknow - Chief Consultant And Head ...",
        "sentiment": "5 (Positive)",
        "link": "https://drashutoshvascular.com/"
    },
    {
        "title": "Dr. Ashutosh Soni, General & Laparoscopic Surgeon - Bombay Hospital - Sehat",
        "snippet": "IDA Scheme No.94/95, Eastern Ring Road, Tulsi Nagar, Vijay Nagar, Indore, Madhya Pradesh - 452010",
        "sentiment": "5 (Positive)",
        "link": "https://www.sehat.com/dr-ashutosh-soni-general-laparoscopic-surgery-doctor-indore"
    },
    {
        "title": "Vein Specialist in Thane | Varicose Veins Surgeon | EVLT",
        "snippet": "Dr. Ashutosh D. Kharche MBBS, MD, Radiodiagnosis, FVIR ... He has been actively involved in treating complex endovascular cases. He has completed his MBBS from Mahaharashtra University of Health Sciences. ... Ground Floor, Aroto House, 5-6, Purushottam Kheraj Road, below Surya Eye Hospital, Mulund West, Mumbai, Maharashtra 400080; Alpha ...",
        "sentiment": "4 (Positive)",
        "link": "https://drashutoshkharche.com/"
    },
    {
        "title": "Dr. Ashutosh Pakale - Chellaram Hospital",
        "snippet": "Dr. Ashutosh Mahadev Pakale is a Internal Medicine in Bavdhan, Pune and has an experience of 6 years in this field. ... Ashutosh Mahadev Pakale practices at Chellaram Hospital -Diabetes Care & Multispecialty in Bavdhan, Pune. He completed MBBS from Maharashtra Universtity of Health Sciences, Nashik in 2013 and MD - General Medicine from Rajiv ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.cdi.org.in/doctor/dr-ashootosh-pakale/"
    },
    {
        "title": "Dr. Avanish Kumar Srivastava - Ayushman Hospital and Health Services",
        "snippet": "Ayushman Hopsital & Health Services, Sector 10, Dwarka, Delhi - 110075. Contact Number: +91 9205481438 (011) 49495566 & (011) 49495555 In Case of Emergency: (011) 49495500 E-Mail: info@ayushmanhhs.in",
        "sentiment": "4 (Positive)",
        "link": "https://www.ayushmanhhs.in/dr-avanish-kumar-srivastava/"
    },
    {
        "title": "Dr. Ankur Jain | Ayushman Hospital and Health Services",
        "snippet": "Ayushman Hopsital & Health Services, Sector 10, Dwarka, Delhi - 110075. Contact Number: +91 9205481438 (011) 49495566 & (011) 49495555 In Case of Emergency: (011) 49495500 E-Mail: info@ayushmanhhs.in",
        "sentiment": "5 (Positive)",
        "link": "https://www.ayushmanhhs.in/dr-ankur-jain/"
    },
    {
        "title": "Dr. Ashutosh Srivastava - Orthopedic surgeon - Book ... - Practo",
        "snippet": "Dr. Ashutosh Srivastava is Orthopedic surgeon in Sector 32 , Faridabad. Book appointments Online, View Fees, User Feedbacks for Dr. Ashutosh Srivastava | Practo ... & Sports Injury specialist in Fortis Escorts Hospital, Faridabad. He has done 3000 surgeries of complex trauma cases, about 1000 operations of arthroscopic surgeries, almost 1000 ...",
        "sentiment": "2 (Negative)",
        "link": "https://www.practo.com/faridabad/doctor/anurag-14-orthopedist"
    },
    {
        "title": "Dr. Ashutosh Jadhav - Orthopedics in Pune - HexaHealth",
        "snippet": "Dr. Ashutosh Jadhav is a Orthopedics in Pune having 8 years of experience. View Dr. Ashutosh Jadhav's contact number, fee and reviews. ... MBBS , MS Orthopaedics. WhatsApp Book Now. ... Ayushman Bharat Card vs Health ID Piles in Men Piles vs Fissure vs Fistula ABHA Health ID Card Ayushman Card Download Kidney Stone VS Gallstone. Hindi Blog.",
        "sentiment": "4 (Positive)",
        "link": "https://www.hexahealth.com/Pune/doctor/dr-ashutosh-jadhav-orthopaedics"
    },
    {
        "title": "Dr. Ashutosh Agarwal - Neuro Surgeon in Kota - HexaHealth",
        "snippet": "The speciality interests of Dr Ashutosh are Management of Head Injuries, Brain Tumour Surgeries, Spinal Cord Tumours, VP Shunt Surgeries and Slipped Disc Surgeries. Dr Ashutosh Agarwal did his MBBS in 2011 and MS in General Surgery from All India Institute Of Medical Sciences, New Delhi. He also completed his MCh in Neuro Surgery from 2017.",
        "sentiment": "4 (Positive)",
        "link": "https://www.hexahealth.com/kota/doctor/dr-ashutosh-agarwal-neuro-surgeon"
    },
    {
        "title": "Dr. Kirti Srivastava - Ayushman Hospital and Health Services",
        "snippet": "Ayushman Hopsital & Health Services, Sector 10, Dwarka, Delhi - 110075. Contact Number: +91 9205481438 (011) 49495566 & (011) 49495555 In Case of Emergency: (011) 49495500 E-Mail: info@ayushmanhhs.in",
        "sentiment": "4 (Positive)",
        "link": "https://www.ayushmanhhs.in/dr-kirti-srivastava/"
    },
    {
        "title": "Dr. Sabnis Ashutosh Balkrishna - Joint Replacement Surgeon in Pune ...",
        "snippet": "Dr Sabnis Ashutosh Balkrishna is a well-known Orthopaedician asociated with Deenanath Mangeshkar Hospital and Research Center. He has 21 years of experience and worked as an expert in different cities of India. Doctor Sabnis Ashutosh Balkrishna has contributed to handling numerous complex medical cases in several hospitals.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/pune/doctor/dr-sabnis-ashutosh-balkrishna"
    },
    {
        "title": "Medpho: Dr Magan is a MBBS, MS - General Surgeon in Moradabad | Free ...",
        "snippet": "Dr Magan Mehrotra, MBBS, MS is a renowned General Surgeon in Moradabad currently practicing at Apex Hospital located at Delhi Road, Moradabad - 244001, Near Majholi Chauraha, Opposite Hotel Park Square . Dr Magan Mehrotra is highly skilled and experienced in treating major and minor general surgery diseases.",
        "sentiment": "1 (Negative)",
        "link": "https://www.medpho.com/doctors/dr-magan-mehrotra-dcf438c2-f6e0-4279-a5c4-0f6a6b69a3b0"
    },
    {
        "title": "Dr. Ashutosh Pal - Dermatologist - Book Appointment Online ... - Practo",
        "snippet": "Dr. Ashutosh Pal is a Dermatologist and Cosmetologist and has an experience of 10 years in these fields. He completed MBBS from The Maharaja Sayajirao University of Baroda in 2014 and MD - Skin & VD from The Maharaja Sayajirao University of Baroda in 2020.",
        "sentiment": "5 (Positive)",
        "link": "https://www.practo.com/indore/doctor/ashutosh-pal-dermatologist"
    },
    {
        "title": "Home - Dr.Ashutosh Jha",
        "snippet": "Book Appointment 17 Years Experience Senior Consultant Orthopedic & Sports Medicine About Us Dr.Ashutosh Jha Dr. Ashutosh Jha graduated as a University Topper with 7 gold medals from prestigious Pt JNM Medical College Raipur. He then completed his Masters in orthopaedics from SCB Medical College Cuttack, one of the busiest orthopaedic departments of country. He […]",
        "sentiment": "4 (Positive)",
        "link": "https://drjhaortho.com/"
    },
    {
        "title": "Ayushman Hospital, Multi Speciality Clinic in Mumbai | Practo",
        "snippet": "Ayushman Hospital is one of the best State of Art ICCU set up in Bhandup. All kind of Emergency Treatment Available for Cardiac Cases, Trauma care, Surgical Emergency Etc-25 Bedded Hospital.- 11 Bedded Fully Equipped ICCU with Ventilator, Monitor, Bipap and HFNC.",
        "sentiment": "5 (Positive)",
        "link": "https://www.practo.com/mumbai/clinic/ayushman-hospital-1-bhandup-west"
    },
    {
        "title": "Dr. Ashutosh Mishra - Hair Restoration Surgeon in Delhi - HexaHealth",
        "snippet": "Dr. Ashutosh Mishra is a Hair Restoration Surgeon in Delhi having 25 years of experience. View Dr. Ashutosh Mishra's contact number, fee and reviews. ... MBBS, MS General Surgery, MCh Plastic Surgery. 25+ Years. Experience. 96% Recommended (89 Ratings) 25 + Experience ... Ayushman Bharat Card vs Health ID Piles in Men Piles vs Fissure vs ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.hexahealth.com/delhi/doctor/dr-ashutoshmishra-plastic-surgery"
    }
]