[
    {
        "title": "Chirayu University",
        "snippet": "Chirayu Medical College and Hospital Bhopal (A Constituent College of Chirayu University) ... Dr. Ashutosh Mangalgiri Principal, Chirayu Paramedical College. Qualifications: MBBS, MS. (Anatomy) Teaching Experience: 20 Years. Mob.: +91 9993366621 Email: ashutoshmangalgiri@yahoo.co.in Fax: +91 755-2709132.",
        "sentiment": "4 (Positive)",
        "link": "https://chirayuuniversity.ac.in/Our_Team"
    },
    {
        "title": " Name: DR. ASHUTOSH SUDHAKAR MANGALGIRI Professor, Department of Anatomy ...",
        "snippet": "Name: DR. ASHUTOSH SUDHAKAR MANGALGIRI Professor, Department of Anatomy Chirayu Medical College & Hospital, Bhopal I] Research Paper Publications: 1. Mangalgiri AS, Patil M, Sherke AR, Longia GS Study of Infra renal segment of Inferior vena cava and associated accessory renal artery: A Case Report. J. Anatomical Society of India. 2007; 56 (2 ...",
        "sentiment": "1 (Negative)",
        "link": "https://cmchbhopal.com/pdf/drmangalgiri.pdf"
    },
    {
        "title": "Department of Anatomy - cmchbhopal.com",
        "snippet": "Anatomy Department is located in the campus of Chirayu Medical College & Hospital Bhopal's sprawling Medical College Building with dissection hall, faculty rooms, histology lab and seminar rooms and Museum on the ground floor with lecture theatre and examination hall on the 4 th and 5th floor. ... Dr. Rashmi Jaiswal, Dr. A.S Mangalgiri ...",
        "sentiment": "4 (Positive)",
        "link": "https://cmchbhopal.com/department-and-equipment-list/anatomy.html"
    },
    {
        "title": " Chirayu Medical College and Hospital, Bhopal, M.P Research Committee",
        "snippet": "Dr. A S Mangalgiri Anatomy 6. Estimation Of Stature From Percutaneous Length Of Ulna. Dr. Rashmi Jaiswal Dr. A S Mangalgiri Anatomy 7. Students Preception On Anatomy Online Teaching During Covid-19, Pandemic Dr. Rashmi Jaiswal Dr. A S Mangalgiri Anatomy 8. Cross Sectional Study Regarding Awareness Of Covid-19 Disease &Prevention Among Medical ...",
        "sentiment": "2 (Negative)",
        "link": "https://cmchbhopal.com/pdf/Details-of-Ongoing-Research-Projects23.pdf"
    },
    {
        "title": "Chirayu Medical College & Hospital Bhopal",
        "snippet": "info@cmchbhopal.com; 0755 2709101/102/103; Chirayu Medical College & Hospital. Bhainsakhedi,Near Bairagarh (Bhopal-Indore Highway), Bhopal, M.P. - 462030",
        "sentiment": "4 (Positive)",
        "link": "https://cmchbhopal.com/management-team/"
    },
    {
        "title": "Chirayu Medical College Bhopal Cut off, Fees (MBBS,PG), Admission 2024",
        "snippet": "Click To Know Chirayu Medical College Bhopal Fees Structure 2024-25 (MBBS Fees, PG Fees), Cut off 2024, Contact No, NRI/Management Quota Admission, Stipend Details CMCH ... MBBS, MS(OBGY) 23 Years Exp. Dr. Ashutosh Mangalgiri, MBBS, MS. (Anatomy), 20 Years Exp. DR. SHIV SHANKER, Prof, General Medicine; DR. ASHUTOSH DARBARI, Prof., General Surgery",
        "sentiment": "4 (Positive)",
        "link": "https://careeredwise.com/chirayu-medical-college-and-hospital-bhopal/"
    },
    {
        "title": "Chirayu Medical College & Hospital Bhopal",
        "snippet": "info@cmchbhopal.com; 0755 2709101/102/103; Chirayu Medical College & Hospital. Bhainsakhedi,Near Bairagarh (Bhopal-Indore Highway), Bhopal, M.P. - 462030",
        "sentiment": "4 (Positive)",
        "link": "https://cmchbhopal.com/medical-superintendent-profile/"
    },
    {
        "title": " Departmental information 1. Department name : Anatomy 2. Institution ...",
        "snippet": "1. Department name : Anatomy 2. Institution name : Chirayu Medical College & Hospital 3. Courses offered : MBBS, MD 4. Departmental Library-cum-Seminar Room : a) Accommodation i) Size : 37.25 sq. mts ii) Capacity : 14 b) Number of books in Anatomy and allied subjects :119Books c) List of Journals : 5 Journals (Available in the Central Library)",
        "sentiment": "1 (Negative)",
        "link": "https://cmchbhopal.com/pdf/final-Anatomy-Departmental-information.pdf"
    },
    {
        "title": "Chirayu Setu- नशे का अंत, खुशियों का सवेरा",
        "snippet": "Chirayu Medical College & Hospital (A Venture of Chirayu Charitable Foundation) is a well-known hospital in India. ... Dr. Ajay Goenka (MBBS MD) is a physician, Covidologist, Philanthropist and a visionary, who is on a mission of providing quality health care through his unique model of Health care delivery and training modules across various ...",
        "sentiment": "4 (Positive)",
        "link": "https://chirayusetu.com/"
    },
    {
        "title": "Chirayu Medical College and Hospital",
        "snippet": "After 5 years of incredible hard work and a distant vision and efforts of our founder Dr. Ajay Goenka, we managed to upgrade into a premier super specialty hospital with 100 beds. ... Foundation Course and Final Master Schedule Uploaded for MBBS 2021-22 Batch Phase-I . ... A walkthrough video of all the facilities at Chirayu Medical College and ...",
        "sentiment": "5 (Positive)",
        "link": "https://cmchbhopal.com/"
    },
    {
        "title": "Chirayu Medical College Admission 2023-Cut off, Fees, Ranking, MBBS/PG ...",
        "snippet": "Chirayu Medical College MBBS fees for various quota is given below. Apart from tuition fees, you need to pay various other fees during admission. ... Master of Surgery(MS) available in Chirayu Medical College are based on the NEET PG examination .Doctors can take admission through All India level counselling (50% of MD/MS seats) or through ...",
        "sentiment": "4 (Positive)",
        "link": "https://mbbscouncil.com/listing/chirayu-medical-college/"
    },
    {
        "title": "Chirayu Medical College Fee Structure 2024 (Latest Update) - MD MS MBBS ...",
        "snippet": "Categories MEDICAL COLLEGES Tags Bhopal address, Bhopal Admission, Bhopal Admission 2024, Bhopal Admission Procedure, Bhopal campus, Bhopal college code, Bhopal counselling, Bhopal Courses, Bhopal Cut-off, Bhopal Direct admission, Bhopal Entrance Exam, Bhopal Facilities, Bhopal faculty, Bhopal Fees Structure 2024, Bhopal Fees Structure for Self ...",
        "sentiment": "4 (Positive)",
        "link": "https://mdmsenquiry.com/chirayu-medical-college-fee-structure/"
    },
    {
        "title": "IJARS - International Journal of Anatomy Radiology and Surgery",
        "snippet": "Materials and Methods: A quasi-experimental study was conducted with Bachelor of Medicine and Bachelor of Surgery (MBBS) Phase I students at the Department of Anatomy, Chirayu Medical College and Hospital, Bhopal, Madhya Pradesh, India, from July 2023 to December 2023. A total of 150 students were divided into two groups: Group-A (odd roll ...",
        "sentiment": "4 (Positive)",
        "link": "https://ijars.net/article_fulltext.aspx?issn=0973-709x&year=2024&volume=13&issue=6&page=AO01&id=3015"
    },
    {
        "title": "Vascular Surgeon In Lucknow-Dr. Ashutosh Kumar Pandey",
        "snippet": "Meet Dr. Ashutosh Kumar Pandey, Renowned as the best vascular surgeon in Lucknow. ... MBBS (2012) - BRD Medical College, DDU Gorakhpur University; Clinical Experience. ... 2007, BRD Medical College; Honours in Anatomy, Pathology and Surgery - MBBS,BRD Medical College; Second Prize - Indian academy of Pediatricsquiz, 2009, ...",
        "sentiment": "5 (Positive)",
        "link": "https://drashutoshvascular.com/about/"
    },
    {
        "title": "Dr Jyoti Singh - Chirayu Medical College and Hospital | LinkedIn",
        "snippet": "Presently working as an Assistant Professor in Department of Community Medicine at… · Experience: Chirayu Medical College and Hospital · Education: Public Health Foundation of India (PHFI) · Location: Bhopal · 500+ connections on LinkedIn. View Dr Jyoti Singh's profile on LinkedIn, a professional community of 1 billion members.",
        "sentiment": "3 (Neutral)",
        "link": "https://in.linkedin.com/in/dr-jyoti-singh-937a931b"
    },
    {
        "title": "Chirayu Medical College Bhopal MBBS MD/MS Best College Admission ...",
        "snippet": "Chirayu Medical College. Chirayu Medical College and Hospital (CMCH Bhopal), one of the best private medical colleges in the region. Established in 2011 and managed by a trust, CMCH Bhopal offers exclusively MBBS courses with 150 seats, providing a focused learning environment. Affiliated with Barkatullah University and approved by the National Medical Commission (NMC), Chirayu Medical College ...",
        "sentiment": "5 (Positive)",
        "link": "https://edusindia.in/chirayu-medical-college/"
    },
    {
        "title": " Chirayu Medical College and Hospital, Bhopal",
        "snippet": "1 dr. d. k. mendiratta dean 1 dr. a.s. mangalgiri medical superintendent anatomy 1 dr. b.k. guha professor 2 dr. a.s. mangalgiri professor 3 dr. bipin chandra ashok khade asso. prof 4 dr. rashmi jaiswal assist. prof 5 dr. kanchan bala dogra assist. prof 6 dr. ahmed tanweer ahasan tutor 7 dr. ravindu tiwari tutor 8 dr. roshni chaturvedi tutor ...",
        "sentiment": "1 (Negative)",
        "link": "https://cmchbhopal.com/pdf/faculty_list_feb-2020.pdf"
    },
    {
        "title": "Chirayu Medical College and Hospital: Courses, Contact ... - GetMyUni",
        "snippet": "In 2010, we founded Chirayu Medical College & Hospital, an ISO-certified institution with NABL and NABH accreditations, offering 800 beds under Dr. Goenka's guidance. In 2012, we further grew by founding Chirayu College of Nursing and Chirayu College of Paramedical Education, strengthening both our healthcare services and educational initiatives.",
        "sentiment": "5 (Positive)",
        "link": "https://www.getmyuni.com/college/chirayu-medical-college-and-hospital-cmcah-bhopal"
    },
    {
        "title": " Chirayu Medical College & Hospital, Bhopal",
        "snippet": "1 dr. manohar bende dean 1 dr. ulka shrivastav medical superintendent 1 dr. bipin chandra khade professor 2 dr. p.g. khanwalkar professor 3 dr. a.s. mangalgiri professor 4 dr. viveka s. professor 5 dr. rashmi jaiswal asso. prof 6 dr. kanchan bala dogra assist. prof 7 dr. priyanka mundra assist. prof 8 dr. mansi shukla assist. prof 9 dr. sagar ...",
        "sentiment": "1 (Negative)",
        "link": "https://cmchbhopal.com/pdf/teachingflt.pdf"
    },
    {
        "title": "Dr. Ashutosh | About Us",
        "snippet": "Meet Dr. Ashutosh, a cardiologist passionate about providing exceptional patient care, and learn about his qualifications and experience. ... He headed the Department of Cardiology at Narayana Medical College, Nellore. He did his fellowship at the National Heart Institute, Kuala Lumpur, Malaysia. ... 3 years teaching experience to Undergraduate ...",
        "sentiment": "5 (Positive)",
        "link": "https://drashutoshcardiologycare.com/about-ashutosh/"
    },
    {
        "title": "Chirayu Medical College and Hospital MBBS: Fees, Admission 2024 ...",
        "snippet": "Check Chirayu Medical College and Hospital MBBS Courses & Fees structure for 2024. Also find admission procedure, cutoff, eligibility, placement details for MBBS at Chirayu Medical College and Hospital.",
        "sentiment": "2 (Negative)",
        "link": "https://www.getmyuni.com/college/chirayu-medical-college-and-hospital-cmcah-bhopal-courses-fees/mbbs/ci"
    },
    {
        "title": " Chirayu Medical College & Hospital, Bhopal",
        "snippet": "3 dr. a.s. mangalgiri professor 4 dr. viveka s. professor 5 dr. rashmi jaiswal asso. prof ... chirayu medical college & hospital, bhopal anatomy. 15 dr. atul sharma tutor 16 dr. amit gupta tutor ... ashutosh jain assist. prof 7 dr. anubhuti kujur assist. prof 8 dr. rajitha t assist. prof 9 dr. amit malviya assist. prof",
        "sentiment": "1 (Negative)",
        "link": "https://cmchbhopal.com/pdf/teachingfltdec.pdf"
    },
    {
        "title": "Chirayu Setu- नशे का अंत, खुशियों का सवेरा",
        "snippet": "Ms. Aakriti Ajay Goenka • CEO Chirayu Setu. Dr. Manohar M. Bende • DEAN Chirayu Medical College & Hospial. Dr. Ashutosh Mangalgiri • Medical Superintendent Chirayu Medical College & Hospial. Dr. Manish Borasi • MD Psychiatry • FIPS, MIAPP, FIAS, MCSEIP, FISSM, FESSM(Europe) ... Chirayu Medical College & Hospital (A Venture of Chirayu ...",
        "sentiment": "4 (Positive)",
        "link": "https://chirayusetu.com/Our-Team"
    },
    {
        "title": "chirayu medical college Archives - MD MS MBBS Admission 2024",
        "snippet": "Peoples College of Medical Sciences & Research Centre MBBS 200 Seats. PG 92 Seats. The medical college and research centre, is a private medical institution in Bhanpur, Bhopal, Madhya Pradesh for studying MBBS, MD & MS Courses. The college came into existence in the year 2005 and is managed by a trust. The affiliation of this … Read more",
        "sentiment": "4 (Positive)",
        "link": "https://mdmsenquiry.com/tag/chirayu-medical-college/"
    },
    {
        "title": "Chirayu Medical College & Hospital Bhopal, Fees, Ranking,Cutoff ...",
        "snippet": "Check Offered courses and their fees details at Chirayu Medical College & Hospital Bhopal. Find details of all UG & PG Medical Courses with course Duration, Admission 2024, Cut off, Eligibility, Documents, Ranking, facilities etc. For more details contact at Banodoctor, Call On 7880109834",
        "sentiment": "4 (Positive)",
        "link": "https://www.banodoctor.com/college/chirayu-medical-college-hospital"
    },
    {
        "title": "Chirayu Medical College: Courses, Eligibility & Fee Structure",
        "snippet": "A private medical college called Chirayu Medical College and Hospital (CMCH) was founded in Bhopal, Madhya Pradesh, in 2010. The college provides medical science courses at the undergraduate, graduate, certificate, and diploma levels.",
        "sentiment": "4 (Positive)",
        "link": "https://propelld.com/site/college/chirayu-medical-college-and-hospital"
    },
    {
        "title": "Chirayu Medical College & Hospital - Chirayu Medical College & Hospital",
        "snippet": "Chirayu Medical College & Hospital For Admission Call :+91-9244122785. MBBS, MD/MS ADMISSION 2024. Your Name. Your Email. Mobile Number. Course.",
        "sentiment": "5 (Positive)",
        "link": "http://www.chirayumedicalcollege.com/"
    },
    {
        "title": "Dr. Ashutosh Prasad | दरभंगा चिकित्सा महाविद्यालय | Darbhanga Medical ...",
        "snippet": "Dr. Ashutosh Prasad, MBBS, Ms, PhD. Dr. Ashutosh Prasad. IMR Number : 21119. Department Affiliation : ENT / Otorhinolaryngology. ... Darbhanga Medical College Laheriasarai, Darbhanga Bihar - 846003 Phone - +91-6272-233228 Email - [email protected] Important Links. Blood Bank PMSSY MoHFW ...",
        "sentiment": "1 (Negative)",
        "link": "https://dmc.edu.in/academics/faculty/ent/dr-ashutosh-prasad/"
    },
    {
        "title": "Chirayu Medical College & Hospital Bhopal",
        "snippet": "Mangalgiri Ashutosh, Suri AD, Satpathi DK, Khanzode LS. Study of Origin of left vertebral artery from the arch of aorta in central India and its clinical relevance. Indian Journal of Forensic Medicine and Toxicology. July-Dec 2014; 8(2):161-164. Mangalgiri Ashutosh; Namdev L N, Mahore Devendra; Kapre Madan.",
        "sentiment": "4 (Positive)",
        "link": "https://cmchbhopal.com/research-publications/details-of-all-research-publications/"
    },
    {
        "title": "Dean Profile - No Blog Title Set",
        "snippet": "Dean Profile Dr. Dewaditya Banerjee Qualifications MBBS, MS. (Anatomy) Teaching Experience 20 years Address A-201, 'A' Block Chirayu Medical College & Hospital Campus,Near Bairagarh, Bhopal Contact Information Mob.:+91 9993366621 Email:ashutoshmangalgiri@yahoo.co.in Fax:+91 755-2709132",
        "sentiment": "5 (Positive)",
        "link": "https://www.mimsbhopal.org/dean-profile/"
    }
]