[
    {
        "title": "Your Doctor Might Have a Disciplinary Record. Here's How to Find Out ...",
        "snippet": "Doctors can be disciplined for criminal convictions, medical negligence, wrongly prescribing controlled substances and other wrongdoing. Even with a disciplinary record, many doctors continue to practice, some even changing states to do so. Although hospitals have access to a federal database to look up the disciplinary histories of doctors in ...",
        "sentiment": "4 (Positive)",
        "link": "https://projects.propublica.org/graphics/investigating-doctors"
    },
    {
        "title": "Oregon doctors lose licenses after allegations investigated",
        "snippet": "The Oregon Medical Board has suspended, surrendered, retired or revoked the medical licenses of 14 doctors in the last six months following investigations into allegations including ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.statesmanjournal.com/story/news/health/2024/04/08/oregon-medical-board-revokes-doctors-licenses-disciplinary-action/73145019007/"
    },
    {
        "title": "Does Your Doctor Have Malpractice Claims? How To Find Out - Forbes",
        "snippet": "Search the doctor's name, plus keywords, like \"malpractice suit,\" \"patient complaint,\" or \"problem,\" as well as the state where your doctor practices.",
        "sentiment": "1 (Negative)",
        "link": "https://www.forbes.com/sites/amino/2016/04/19/does-your-doctor-have-malpractice-claims-how-to-find-out/"
    },
    {
        "title": "How to File a Wrong Medication Lawsuit - Nolo",
        "snippet": "Most malpractice attorneys will look for medical expenses and other out-of-pocket losses in the range of $50,000 to $100,000, at a minimum, before they'll think about taking on a difficult malpractice case. The Costs of Filing a Malpractice Suit. Malpractice suits are among the costliest of all personal injury cases, for a lot of reasons. For ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.nolo.com/legal-encyclopedia/my-doctor-prescribed-the-wrong-medication-is-malpractice.html"
    },
    {
        "title": "Medical Negligence: The Law Explained - AllLaw",
        "snippet": "How Negligence Can Lead to Medical Malpractice. In short, medical negligence becomes medical malpractice when the doctor's negligent treatment causes injury to the patient—makes the patient's condition worse, causes unreasonable and unexpected complications, or necessitates additional medical treatment, to name just a few examples of what's considered \"injury\" in a malpractice case.",
        "sentiment": "1 (Negative)",
        "link": "https://www.alllaw.com/articles/nolo/medical-malpractice/negligence.html"
    },
    {
        "title": "Medical Negligence: Definition, Examples and Remedies - LegalMatch",
        "snippet": "You might wish to contact a medical negligence lawyer if you need assistance with a medical negligence case. An experienced personal injury attorney can provide you with advice on your case and help you submit paperwork to the court. In most cases, financial compensation is given to the injured parties as restitution for medical negligence ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.legalmatch.com/law-library/article/what-is-medical-negligence.html"
    },
    {
        "title": "Dr. Jaishree Manohar, MD, Rheumatology | Sarasota, FL - WebMD",
        "snippet": "Dr. Jaishree Manohar, MD, is a Rheumatology specialist practicing in Sarasota, FL with 18 years of experience. ... Dr. Manohar graduated from the Case Western Reserve University School of Medicine in 2007. She works in Sarasota, FL and 3 other locations and specializes in Rheumatology and Internal Medicine. Dr.",
        "sentiment": "5 (Positive)",
        "link": "https://doctor.webmd.com/doctor/jaishree-manohar-a5cbd8ef-14ce-4815-b962-be4ea4fb61e6-overview"
    },
    {
        "title": "Dr. Chenguttai Manohar, MD, Internal Medicine | Madison, OH - WebMD",
        "snippet": "Dr. Chenguttai Manohar, MD, is an Internal Medicine specialist practicing in Madison, OH with 42 years of experience. This provider currently accepts 37 insurance plans including Medicare and Medicaid. ... Dr. Manohar graduated from the Madras Medical College in 1983. He works in Madison, OH and 1 other location and specializes in Internal ...",
        "sentiment": "4 (Positive)",
        "link": "https://doctor.webmd.com/doctor/chenguttai-manohar-f82e0161-d95b-4dee-8c19-cf2a717c8eaa-overview"
    },
    {
        "title": "Dr. Jaishree Manohar, MD - Rheumatologist in Sarasota, FL - Healthgrades",
        "snippet": "Dr. Jaishree Manohar, MD is a rheumatologist in Sarasota, FL. Dr. Manohar has extensive experience in Osteoporosis & Screening. She is affiliated with Sarasota Memorial Hospital. 3.8 (10 ratings) Leave a review. Practice. 1945 Versailles St Sarasota, FL 34239. Show Phone Number. Share Save.",
        "sentiment": "3 (Neutral)",
        "link": "https://www.healthgrades.com/physician/dr-jaishree-manohar-xlcfy"
    },
    {
        "title": " Name of Recent Educationa Latest Registratio Passport Size Photo Mbbs ...",
        "snippet": "Department of Pharmacology: NAME OF FACULTY RECENT PASSPORT SIZE PHOTO EDUCATIONA L QUALIFICATI ON LATEST DESIGNATIO N REGISTRATIO N NO. RESPECTIVE MEDICAL COINCIL Dr. Rajendra Kumar Gupta MBBS MD Professor MP-4639 Dr. Manohar Bende MBBS MD Professor MMC-49580 Dr. Sudha M MBBS MD DNB Professor KMC-71505 Dr. Baliram Venkatro Ghodke MBBS MD",
        "sentiment": "1 (Negative)",
        "link": "https://cmchbhopal.com/min-req-clause/Pharmacology.pdf"
    },
    {
        "title": "Dr. Leslie Manohar, MD, Orthopedic Surgery | Champaign, IL - WebMD",
        "snippet": "Dr. Leslie Manohar, MD, is an Orthopedic Surgery specialist practicing in Champaign, IL with 20 years of experience. This provider currently accepts 34 insurance plans. New patients are welcome. ... Dr. Manohar graduated from the Univ of Chicago Division of Biological Sciences Pritzker School of Medicine in 2005. She works in Champaign, IL and ...",
        "sentiment": "5 (Positive)",
        "link": "https://doctor.webmd.com/doctor/leslie-manohar-291dc5c0-dec5-11e7-9f4c-005056a225bf-overview"
    },
    {
        "title": "Shonith Manohar, MD, Pain Medicine Specialist - Baptist Health",
        "snippet": "Shonith Manohar, MD Office and Other Patient Information. Office 1: North Florida Regional Pain Management 8259 Bayberry Road , Jacksonville, FL 32256 ... Request an appointment with Dr. Manohar by calling 9047377246. Baptist Health. Changing Health Care for Good. Baptist Health. 800 Prudential Drive Jacksonville, FL ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.baptistjax.com/doctors/pain-medicine-specialist/dr-shonith-manohar-md"
    },
    {
        "title": "Dr. Vinayak Manohar, MD - Cardiologist in Grand Rapids, MI - Healthgrades",
        "snippet": "Dr. Vinayak Manohar, MD is a cardiologist in Grand Rapids, MI and has over 18 years of experience in the medical field. Dr. Manohar has extensive experience in Adult Congenital Heart Conditions and Heart Conditions. He graduated from Thomas Jefferson University in 2006. He is affiliated with medical facilities such as Corewell Health Butterworth Hospital and Trinity Health Grand Rapids Hospital.",
        "sentiment": "4 (Positive)",
        "link": "https://www.healthgrades.com/physician/dr-vinayak-manohar-34l3g"
    },
    {
        "title": "Jaishree Manohar, MD - Sarasota Arthritis Center",
        "snippet": "Dr. Manohar received her M.D. degree from the Boonshoft School of Medicine at Wright State University in Dayton, Ohio. She completed her internship and residency in Internal Medicine at Robert Wood Johnson School of Medicine in New Brunswick, New Jersey. She was also chosen to be Chief Resident...",
        "sentiment": "5 (Positive)",
        "link": "https://www.arthritiscenters.net/provider/dr-jaishree-manohar/"
    },
    {
        "title": "Ashan Manohar, MD | Riverside Health System | Southeastern VA",
        "snippet": "About Ashan Manohar, MD. Dr. Manohar earned his medical degree from the University of Natal Medical School in South Africa in 1987. He completed an internal medicine residency at St. John's Episcopal Hospital in New York in 1996, and a gastroenterology fellowship at the State University of New York Health Science Center at Brooklyn in 1999.",
        "sentiment": "4 (Positive)",
        "link": "https://www.riversideonline.com/find-a-doctor/find-a-doctor-results/ashan-manohar"
    },
    {
        "title": "Poorni Manohar, M.D.: Internal Medicine | Breast Cancer | UT ...",
        "snippet": "Dr. Manohar earned her medical degree at the Wright State University Boonshoft School of Medicine. After completing a residency in internal medicine at the University of Michigan Hospital, she gained advanced training in hematology and oncology through a fellowship at the Fred Hutchinson Cancer Center at the University of Washington, where she ...",
        "sentiment": "4 (Positive)",
        "link": "https://utswmed.org/doctors/poorni-manohar/"
    },
    {
        "title": "Dr. Manohar Kola, MD - Decatur, IL | Cardiology - Doximity",
        "snippet": "Dr. Manohar Kola, MD is a cardiologist in Decatur, Illinois. He is affiliated with HSHS St. Mary's Hospital and Veterans Affairs Illiana Health Care System.",
        "sentiment": "4 (Positive)",
        "link": "https://www.doximity.com/pub/manohar-kola-md-b5530147"
    },
    {
        "title": "Dr. Shonith Manohar, MD",
        "snippet": "Dr. Shonith Manohar, MD is a pain medicine physician in Jacksonville, FL and has over 32 years of experience in the medical field. He graduated from NEW YORK Medical College in 1992. He is affiliated with Baptist Medical Center Jacksonville. He is accepting new patients and telehealth appointments.",
        "sentiment": "4 (Positive)",
        "link": "https://www.healthgrades.com/physician/dr-shonith-manohar-32xtc"
    },
    {
        "title": "Dr. Vinayak Manohar, MD - Verified Ratings & Reviews | Ratings.MD",
        "snippet": "Dr. Vinayak Manohar, MD Cardiovascular. Trinity Health Medical Group, Cardiovascular - East Paris. 1000 East Paris Ave SE, Suite 200, Grand Rapids , MI 49546. 616-685-3450 Directions. 4.9 out of 5. 137 verified ratings. 137 Ratings, 63 Comments. Oct 21, 2024. Dr. Manohar is a wonderful doctor. He listens to his patients concerning their health.",
        "sentiment": "5 (Positive)",
        "link": "https://ratings.md/profile/manohar-vinayak-a"
    },
    {
        "title": "Dr. Jaishree Manohar, 5308 4Th Ave E Cir, Bradenton FL - TopNPI.com",
        "snippet": "Dr. Jaishree Manohar practices at 5308 4Th Ave E Cir, Bradenton, FL. Find Dr. Jaishree Manohar's office location, phone number, opening hours, doctor nearby. ... Organization: Weitzner Yonker And Kaine Md Pa; ... Malpractice information The doctor has not made a payment on a malpractice claim in Bradenton FL. Specialties & Expertise. Specialty ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.topnpi.com/fl1326368689/dr-jaishree-manohar/fl-1"
    },
    {
        "title": "Sarasota Arthritis Center - About Us",
        "snippet": "Jaishree Manohar, MD. Dr. Manohar received her M.D. degree from the Boonshoft School of Medicine at Wright State University in Dayton, Ohio. She completed her internship and residency in Internal Medicine at Robert Wood Johnson School of Medicine in New Brunswick, New Jersey. She was also chosen to be Chief Resident while at Robert Wood Johnson.",
        "sentiment": "5 (Positive)",
        "link": "https://www.arthritiscenters.net/about-us/"
    },
    {
        "title": "Dr. Priti Manohar, MD - Sleep Medicine Internist in Edinburg, TX ...",
        "snippet": "Dr. Priti Manohar, MD is a sleep medicine internist in Edinburg, TX and has over 31 years of experience in the medical field. She graduated from Barisal Medical College in 1993. She is affiliated with Doctors Hospital at Renaissance. She is accepting new patients and telehealth appointments.",
        "sentiment": "4 (Positive)",
        "link": "https://www.healthgrades.com/physician/dr-priti-manohar-3xvky"
    },
    {
        "title": "Dr. Nashin Manohar, DO - WebMD",
        "snippet": "Dr. Nashin Manohar, DO, is a Physical Medicine & Rehabilitation specialist practicing in Edinburg, TX with 29 years of experience. This provider currently accepts 35 insurance plans including Medicare and Medicaid. New patients are welcome. Hospital affiliations include Mission Regional Medical Center.",
        "sentiment": "5 (Positive)",
        "link": "https://doctor.webmd.com/doctor/nashin-manohar-6b780421-74b2-4b56-9e21-44b480bb3e41-overview"
    },
    {
        "title": "Carle Provider - Leslie M Manohar, MD - Carle Foundation Hospital",
        "snippet": "Visit Carle Provider Leslie M Manohar, MD at Carle Hospital. For more information, or to schedule an appointment, call (217) 383-3273 or visit carle.org",
        "sentiment": "3 (Neutral)",
        "link": "https://carle.org/find-a-doctor/1603"
    },
    {
        "title": "MD Pharmacology in India: Check out Admission process, Fees, Medical ...",
        "snippet": "The fee for pursuing an MD (Pharmacology) varies from college to college. The average course fee is Rs. 32000 to Rs. 12 Lakh per year. After completion of their respective course, doctors can either join the job market or pursue a super-specialization course where MD Pharmacology is a feeder qualification.",
        "sentiment": "1 (Negative)",
        "link": "https://medicaldialogues.in/medical-courses/md-pharmacology-in-india-check-out-admission-process-fees-medical-colleges-to-apply-eligibility-criteria-99376"
    },
    {
        "title": "Dr. Naveen Manohar, MD, Cardiovascular Disease | Sacramento, CA - WebMD",
        "snippet": "Dr. Naveen Manohar, MD, is a Cardiovascular Disease specialist practicing in Sacramento, CA with 32 years of experience. This provider currently accepts 88 insurance plans including Medicare and Medicaid. ... Dr. Manohar graduated from the Jawaharlal Inst of Post-Graduate Medical Education and Research (Jipmer) in 1993. He works in Sacramento ...",
        "sentiment": "4 (Positive)",
        "link": "https://doctor.webmd.com/doctor/naveen-manohar-e96a9e2f-9ec9-4884-9835-5b63746e5da5-overview"
    },
    {
        "title": "Dr. Vinayak Manohar, MD, Cardiovascular Disease - WebMD",
        "snippet": "Dr. Vinayak Manohar, MD, is a Cardiovascular Disease specialist practicing in Grand Rapids, MI with 20 years of experience. This provider currently accepts 46 insurance plans including Medicare and Medicaid. ... Dr. Manohar graduated from the Sidney Kimmel Medical College At Thomas Jefferson University in 2005. He works in Grand Rapids, MI and ...",
        "sentiment": "4 (Positive)",
        "link": "https://doctor.webmd.com/doctor/vinayak-manohar-94c33cc5-b15e-4f0b-b57f-68d9ce16e6fd-overview"
    },
    {
        "title": "Dr. Ashan Manohar, MD - Gastroenterologist in Onancock, VA - Healthgrades",
        "snippet": "Dr. Ashan Manohar, MD is a gastroenterologist in Onancock, VA and has over 37 years of experience in the medical field. Dr. Manohar has extensive experience in Pancreatic Disease. He graduated from UNIVERSITY OF POITIERS / U.F.R. OF MEDICINE AND PHARMACY in 1987. He is affiliated with Riverside Shore Memorial Hospital. He is accepting new patients.",
        "sentiment": "4 (Positive)",
        "link": "https://www.healthgrades.com/physician/dr-ashan-manohar-34ryd"
    },
    {
        "title": "Dr. Manohar K N - Eka",
        "snippet": "Dr. Manohar K N is a MD(General Medicine) by training and has completed his and MBBS. What is the address of Dr. Manohar K N's clinic? Dr. Manohar K N currently practices at Medall Clumax Diagnostics - New Tippasandra which is located at: Krishna Quoin, 80 Feet Road, HAL 3rd Stage, New Tippasandra, Opp. Veer Hanuman Temple, Indiranagar ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.eka.care/doctor/dr-manohar-k-n-md-general-medicine-bengaluru"
    },
    {
        "title": "Dr. Ram Manohar Lohia Institute of Medical Sciences, Lucknow - Indiaccess",
        "snippet": "Vibhuti Khand, Gomti Nagar, Lucknow - 226010, Uttar Pradesh Affiliation: Dr. Ram Manohar Lohia Institute of Medical Sciences, Lucknow (deemed)",
        "sentiment": "1 (Negative)",
        "link": "https://www.indiaccess.com/colleges/medical/instprofile.asp?collid=p1yyrtrvq!!HJF&det=1"
    },
    {
        "title": "Dr. Manohar Manchandia, MD - Sharecare",
        "snippet": "Providers at Dr. Manohar Manchandia, MD can provide language services for Gujarati. Locations. button. Dr. Manohar Manchandia, MD. 1 2706 Shed Rd, Bossier City, LA 71111 Directions (318) 747-5272; Make an appointment. Dr. Manohar Manchandia, MD 2706 Shed Rd Bossier City, LA 71111 Map.",
        "sentiment": "4 (Positive)",
        "link": "https://www.sharecare.com/find-a-doctor/group-profile/la-louisiana/bossier-city/dr-manohar-manchandia-md-x65dv3"
    },
    {
        "title": "Dr. Ashan Manohar, MD, Gastroenterology | Onancock, VA - WebMD",
        "snippet": "Dr. Ashan Manohar, MD, is a Gastroenterology specialist practicing in Onancock, VA with 38 years of experience. This provider currently accepts 67 insurance plans including Medicare and Medicaid. New patients are welcome. ... Dr. Manohar graduated from the University of Kwazulu-Natal College of Health Sciences in 1987. He works in Onancock, VA ...",
        "sentiment": "4 (Positive)",
        "link": "https://doctor.webmd.com/doctor/ashan-manohar-57782eb5-6f1a-4cde-9d7a-9554535269f3-overview"
    },
    {
        "title": "Dr. Prerana Manohar, MD, Internal Medicine | Grand Rapids, MI - WebMD",
        "snippet": "Dr. Prerana Manohar, MD, is an Internal Medicine specialist practicing in Grand Rapids, MI with 29 years of experience. This provider currently accepts 23 insurance plans including Medicare and Medicaid. New patients are welcome. Hospital affiliations include Trinity Health Saint Marys Grand Rapids.",
        "sentiment": "4 (Positive)",
        "link": "https://doctor.webmd.com/doctor/prerana-manohar-06056b6c-edad-4f9e-a7ef-d0a6ed2c5a26-overview"
    },
    {
        "title": "Dr. Manohar Kola, MD - Cardiologist in Decatur, IL - Healthgrades",
        "snippet": "Dr. Manohar Kola, MD is a cardiologist in Decatur, IL and has over 45 years of experience in the medical field. Dr. Kola has extensive experience in Heart Conditions and Adult Congenital Heart Conditions. He graduated from Gandhi Medical College in 1979. He is affiliated with medical facilities such as Decatur Memorial Hospital and HSHS Good Shepherd Hospital.",
        "sentiment": "4 (Positive)",
        "link": "https://www.healthgrades.com/physician/dr-manohar-kola-3c7yq"
    },
    {
        "title": "Dr. Manohar Shetty, MD - Psychiatry - St. Clair Health",
        "snippet": "Find information about and book an appointment with Dr. Manohar Shetty, MD. Specialties: Psychiatry.",
        "sentiment": "4 (Positive)",
        "link": "https://providers.stclair.org/provider/manohar-shetty/2696911"
    },
    {
        "title": "Dr Manohar G Reddy Md Pa in Melbourne - NPI No.",
        "snippet": "Dr Manohar G Reddy Md Pa: Provider Organization: DR MANOHAR G REDDY MD PA: Address: 2551 W Eau Gallie Blvd, Suite 101, Melbourne Florida, 32935-8954: Phone Number: 321-752-5544: Fax Number: 321-752-5957: Authorized Official Name: Dr. Manohar G Reddy: Authorized Official Title/Position: Physician/owner: Authorized Official Contact Number: 321 ...",
        "sentiment": "4 (Positive)",
        "link": "https://npino.com/primary-clinic/1053510305-dr-manohar-g-reddy-md-pa/"
    },
    {
        "title": "Dr. Akshay Manohar, MD - Infectious Disease Internist in Tallahassee ...",
        "snippet": "Dr. Akshay Manohar, MD is an infectious disease internist in Tallahassee, FL and has over 15 years of experience in the medical field. He graduated from Kasturba Medical College in 2009. He is affiliated with HCA Florida Capital Hospital. He is accepting new patients and telehealth appointments.",
        "sentiment": "1 (Negative)",
        "link": "https://www.healthgrades.com/physician/dr-akshay-manohar-gg98f"
    },
    {
        "title": "Ram Manohar Amilineni, MD | Internal Medicine - AdventHealth",
        "snippet": "Ram Amilineni MD is a board-certified internal medicine physician. In addition to English, Dr. Amilineni is fluent in Hindi and Telugu. Dr. Amilineni cares for patients 18 years and older. ... Ram Manohar Amilineni, MD treats the following conditions: Arthritis, Asthma, Balance Disorders, Bronchitis, Chronic Cough, High Blood Pressure, ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.adventhealth.com/find-doctor/doctor/ram-manohar-amilineni-md-1457457541"
    },
    {
        "title": "Dr. Manohar R. Manchandia, MD | Willis Knighton Health",
        "snippet": "Dr. Manohar R. Manchandia, MD Pediatrics. 318-747-5272 Request an Appointment. Request an Appointment. accepting new patients. ... Provider Ratings. 4.5 out of 5 . Locations. Manohar Manchandia, MD. 2706 Shed Road Bossier City , LA 71111 View hours . Monday. 8:00am - 5:00pm ...",
        "sentiment": "1 (Negative)",
        "link": "https://directory.wkhs.com/provider/dr-manohar-r-manchandia-md"
    }
]