[
    {
        "title": "HC quashes FIR against Dr Goenka in Vyapam case",
        "snippet": "The Madhya Pradesh high court quashed an FIR and sessions court proceedings in a Vyapam case against Dr Ajay Goenka, secretary of Chirayu Charitable Foundation, which runs Chirayu Medical College.",
        "sentiment": "1 (Negative)",
        "link": "https://timesofindia.indiatimes.com/city/bhopal/hc-quashes-fir-against-dr-goenka-in-vyapam-case/articleshow/107927776.cms"
    },
    {
        "title": "Hospital MD surrenders in Vyapam case - Times of India",
        "snippet": "BHOPAL: Dr Ajay Goenka, managing director of Chirayu Health and Medicare Private Limited, surrendered before a special CBI court on Wednesday afternoon in a Vyapam scam case.",
        "sentiment": "1 (Negative)",
        "link": "https://timesofindia.indiatimes.com/city/bhopal/hospital-md-surrenders-in-vyapam-case/articleshow/62731325.cms"
    },
    {
        "title": "Vyapam scam: CBI files charge-sheet against 160 more accused",
        "snippet": "Vyapam News: Those charge-sheeted in Vyapam scam include Ajay Goenka, S N Vijaywargiya and Suresh Singh Bhadoria, chairmen of Chirayu Medical College and Hospital, People's Medical College and Hospital (both in Bhopal) and Indore-based Index Medical College and Hospital respectively, CBI's special prosecutor Satish Dinkar confirmed.",
        "sentiment": "1 (Negative)",
        "link": "https://legal.economictimes.indiatimes.com/news/industry/vyapam-scam-cbi-files-charge-sheet-against-160-more-accused/89661305"
    },
    {
        "title": "Ayushman Bharat Hospital List 2025: Download PDF at hospitals.pmjay.gov.in",
        "snippet": "Step 4: give hospital ID, state, and district and all the suspended hospitals will show on screen. Download Ayushman Bharat Hospital List PDF Online. Step 1: Go to the PMJAY official website where you can find all the information on the dashboard. Step 2: To locate this option, navigate to the hospital list section of the scheme's main dashboard. Step 3: Choose the hospital list from the ...",
        "sentiment": "4 (Positive)",
        "link": "https://pmgovtschemehub.com/ayushman-bharat-hospital-list/"
    },
    {
        "title": "9 Private Colleges Ex-Officials Granted Conditional Bail In Vyapam Case",
        "snippet": "The Madhya Pradesh High Court has granted conditional bail to nine former officials of private medical colleges accused of cheating, forgery among other offences related to pre-medical test PMT ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.ndtv.com/india-news/vyapam-scam-9-private-colleges-ex-officials-granted-conditional-bail-in-vyapam-case-2818931"
    },
    {
        "title": "Vyapam Scam: HC Grants Conditional Bail to 9 Ex-officials of ... - News18",
        "snippet": "The others granted bail were former members of Chirayu Medical College and Hospital's admission committee Dr Ravi Saxena, S N Saxena and Dr V H Bhavsar, former dean of Peoples College of Medical Science and Research Centre Dr Vijay Kumar Pandya, Arun Kumar Arora, a former employee of Index Medical College Indore and former dean of Chirayu Medical College and Hospital Dr Virendra Mohan.",
        "sentiment": "1 (Negative)",
        "link": "https://www.news18.com/news/education-career/vyapam-scam-hc-grants-conditional-bail-to-9-ex-officials-of-private-medical-colleges-4870496.html"
    },
    {
        "title": "NewsBits : Vyapam scam: Chirayu Medical College CMD Dr Ajay Goenka sent ...",
        "snippet": "Goenka, an accused in the multi-layered Vyapam scam, surrendered before the court. Subsequently, the court sent him to jail on 14-day judicial custody. Apart from him, Dr DK Satpathy, a former head of the Medico-Legal Institute, has also been sent to jail for a similar period.",
        "sentiment": "1 (Negative)",
        "link": "https://newsbits.in/vyapam-scam-chirayu-medical-college-cmd-dr-ajay-goenka-sent-to-jail-on-judicial-custody"
    },
    {
        "title": "Vyapam Scam Ajay Goenka: डॉ. गोयनका को बड़ी राहत",
        "snippet": "Vyapam Scam Ajay Goenka: हाई कोर्ट की ग्वालियर बेंच ने डॉ. अजय गोयनका को व्यापमं घोटाले के आरोपों से बरी कर दिया है।",
        "sentiment": "1 (Negative)",
        "link": "https://bansalnews.com/high-court-gwalior-bench-acquittal-dr-ajay-goenka-chirayu-hospital-bhopal-in-vyapam-scam/"
    },
    {
        "title": "Vyapam scam: CBI files chargesheet against 160 more accused including ...",
        "snippet": "BHOPAL: The Central Bureau of Investigation (CBI) has filed a charge-sheet against 160 more accused, including the chairmen of three medical colleges in Madhya Pradesh, for allegedly rigging the ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.newindianexpress.com/nation/2022/feb/18/vyapam-scam-cbi-files-chargesheet-against-160-more-accused-includingchiefs-of-medical-colleges-2420953.html"
    },
    {
        "title": "Ayushman Card Hospital List: How to Check Eligible Hospitals for Free ...",
        "snippet": "If you face any issues while accessing the benefits of your Ayushman Card, you can contact the PMJAY Helpline at 14555. Tips to Maximize Ayushman Card Benefits. Keep Your Card Handy: Always carry your Ayushman Card for emergencies. Verify the Hospital: Check the empanelment status before visiting any hospital.",
        "sentiment": "5 (Positive)",
        "link": "https://krushimantri.com/ayushman-card-hospital-list-check-pmjay-benefits/"
    },
    {
        "title": "About Us - Chirayu Medical College & Hospital",
        "snippet": "After 5 years of incredible hard work and a distant vision and efforts of our founder Dr. Ajay Goenka, we managed to upgrade into a premier super specialty hospital with 100 beds. ... In 2010, Chirayu Medical College & Hospital (CMCH), a higher education institute with NABL and NABH accreditation and an ISO certified Hospital with 800 beds was ...",
        "sentiment": "5 (Positive)",
        "link": "https://cmchbhopal.com/about/"
    },
    {
        "title": "Aakriti Hospital",
        "snippet": "Empanelled under Ayushman Bharat PM-JAY(ENT) Specialities Gallery About Contact. ... Aakriti Hospital provides Expert Team Work in Ear,Nose and Throat Surgery as well as Maternity Care ... Dr. Amarnath Prasad has acquired his MBBS at Burdwan Medical College, Burdwan, West Bengal and MS from The prestigious Ramakrishana Mission Seva Pratishthan ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.aakritihospital.com/"
    },
    {
        "title": "Ayushman Bharat (PMJAY) Hospitals List India - Download PDF - HexaHealth",
        "snippet": "The complete Ayushman Bharat hospital list can be found on the official PMJAY website. However, to find the nearest registered hospital under the PMJAY scheme, here's what you need to do. Step 1: Visit the PMJAY website, to get the Ayushman Bharat Hospital List. Click on 'Find Hospital' on the upper left bar",
        "sentiment": "4 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Indore - Download PDF - HexaHealth",
        "snippet": "To view the AB-PMJAY panelled hospitals in Indore, you need to visit the official website https://hospitals.pmjay.gov.in. Click on 'Find Hospitals' and enter Indore, along with the District, Hospital Type, Speciality, Hospital Name, and Empanelment Type. Click on the Search button and get the list of all hospitals in one place.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-indore"
    },
    {
        "title": "Critical Care & Ayushman Card Facility Hospital in West Indore",
        "snippet": "Greetings from our Indore hospital, which provides Ayushman Card facilities and cutting-edge critical care services. We put the health of our patients first and offer cutting-edge medical treatment for serious illnesses as one of the critical care hospital in West Indore. ... Dr. Pramod Neema. Director & Joint Replacement Surgeon. M.B.B.S., M.N ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.uniquehospitalindore.com/general_unique.php"
    },
    {
        "title": "How to Make Ayushman Card - National Health Authority | GOI",
        "snippet": "How to Make Ayushman Card National Health Authority",
        "sentiment": "3 (Neutral)",
        "link": "https://nha.gov.in/Ayushman-Card"
    },
    {
        "title": "Ahmedabad Ayushman Card Hospital List - 1PDF",
        "snippet": "Ahmedabad Ayushman Card Hospital List. Ayushman Bharat hospitals list in Ahmadabad includes the top empanelled hospitals along with their address and contact details. To download the Ayushman Bharat Hospital list PDF in Ahmadabad, visit the official website. Select Ahmadabad, Hospital Type, Speciality, Empanelment Type and Click on 'Search'",
        "sentiment": "5 (Positive)",
        "link": "https://1pdf.in/ayushman-card-hospital-list-ahmedabad/"
    },
    {
        "title": "Chirayu Medical College and Hospital",
        "snippet": "In a small 20-bed hospital in the year 1992, an establishment that would grow into one of Central India's biggest healthcare group was born. After 5 years of incredible hard work and a distant vision and efforts of our founder Dr. Ajay Goenka, we managed to upgrade into a premier super specialty hospital with 100 beds.",
        "sentiment": "5 (Positive)",
        "link": "https://cmchbhopal.com/"
    },
    {
        "title": "Ayushman Bharat PM-JAY - ESIC",
        "snippet": "3.Beneficiaries of ESIC can use their ESIS card to access free treatment at AB PM-JAY empanelled hospitals. 4.Similarly, beneficiaries of AB PM-JAY can use their PM-JAY card to access free treatment at ESIC empanelled hospitals. 5.For more information beneficiaries can call ESIC toll-free number: 1800 112 526/ 1800 113 839. For More Information. 1.",
        "sentiment": "5 (Positive)",
        "link": "https://www.esic.gov.in/ab-pm-jay"
    },
    {
        "title": "Ayushman Bharat Vaya Vandana: Full, state-wise list of hospitals ...",
        "snippet": "As part of this new scheme, any individual issued an Ayushman Vaya Vandana card in 2024 will be entitled to receive cost-free medical treatment of up to Rs 5 lakh at any hospital that is linked ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.businesstoday.in/personal-finance/insurance/story/ayushman-bharat-vaya-vandana-full-state-wise-list-of-hospitals-entitled-to-serve-senior-citizens-for-ab-pm-jay-health-cover-452884-2024-11-07"
    },
    {
        "title": "Contact Us - Ayushman Hospital and Health Services",
        "snippet": "Address: Ayushman Hospital & Health Services, Sector 10, Dwarka, Delhi - 110075. Contact Number: (011) 49495566, (011) 49495555 For Emergency Cases: (011) 49495500 E-Mail: info@ayushmanhhs.in Toll-Free Number: 1800 313131 111 OPD Timings : Morning :- 09:00 AM to 01:00 PM",
        "sentiment": "5 (Positive)",
        "link": "https://www.ayushmanhhs.in/contact-us/"
    },
    {
        "title": "Jupiter Hospital Indore | Best Multispeciality Hospital in Indore ...",
        "snippet": "Jupiter Hospital is the best multispecialty hospital in Indore, Madhya Pradesh, tertiary care Hospital that lays its foundation on a 'Patient first' ideology. The hospital is equipped with the infrastructure, medical facilities and much more. Book an appointment online for treatment.",
        "sentiment": "5 (Positive)",
        "link": "https://www.jupiterhospital.com/indore/"
    },
    {
        "title": "PMJAY Landing Page",
        "snippet": "Ayushman Bharat is the Pradhan Mantri Jan Arogya Yojna or PM-JAY as it is popularly known. This scheme was launched on 23rd September, 2018 in Ranchi, Jharkhand by the Hon'ble Prime Minister of India, Shri Narendra Modi. ... PM-JAY provides cashless access to health care services for the beneficiary at the point of service, that is, the ...",
        "sentiment": "5 (Positive)",
        "link": "https://hospitals.pmjay.gov.in/LandingPage.htm"
    },
    {
        "title": "About Us | Ayushman Hospital and Health Services Orthopaedics",
        "snippet": "1800 313131 111. EWS Nodal Officer Details Name- Dr. Anita Mor Telephone - 09205481439 dr.anita.mor@ayushmanhhs.in",
        "sentiment": "5 (Positive)",
        "link": "https://www.ayushmanhhs.in/about-us/"
    },
    {
        "title": "How to Use Ayushman Card in Private and Govt. Hospital? - HexaHealth",
        "snippet": "The Ayushman Bharat Yojna, popularly known as Pradhan Mantri Jan Sangh Aarogya Yojna, is a noble initiative that caters for providing necessary medical services to the less powerful economic sections of the country.The scheme allows a certain class of citizens to avail of these services, where they get an annual coverage of INR 5,00,000 to undergo any medical treatment which is necessary for ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.hexahealth.com/blog/how-to-use-ayushman-card-in-hospital"
    },
    {
        "title": "Ayushman Bharat, Haryana | India",
        "snippet": "Welcome to the Official Government Website of Ayushman Bharat Haryana Health Protection Authority! At Ayushman Bharat, we are committed to realizing the vision of Universal Health Coverage (UHC) as outlined in the National Health Policy 2017.",
        "sentiment": "5 (Positive)",
        "link": "https://ayushmanbharat.haryana.gov.in/"
    },
    {
        "title": "Ayushman Card Hospital List in Indore, Madhya Pradesh: Download PDF 2023",
        "snippet": "Ayushman Card Hospital List in Indore, Madhya Pradesh: Download PDF 2023. Ayushman Card Hospital List in Indore, Madhya Pradesh: Download PDF 2023. Skip to content. About us; ... GOKULDAS HOSPITAL PVT.LTD: 11,Dr.Sarju Prasad Marg South Tukoganj , Indore, Madhya Pradesh: 9826031212: 13:",
        "sentiment": "4 (Positive)",
        "link": "https://atozsarkarimahiti.com/ayushman-card-hospital-list-in-indore/"
    },
    {
        "title": "3.42 lakh fraud cases detected under Ayushman Bharat-PMJAY ... - ThePrint",
        "snippet": "With 8.39 crore hospital admissions under the scheme, fraudulent cases are under 0.5%. Saturday, January 11, 2025 ... 3.42 lakh fraud cases detected under Ayushman Bharat-PMJAY. Over 56,000 unnecessary surgeries ... Medical industry uses this scheme to catch money sometime it's really emergency depend on case rather than they just compulsory ...",
        "sentiment": "1 (Negative)",
        "link": "https://theprint.in/india/3-42-lakh-fraud-cases-detected-under-ayushman-bharat-pmjay-over-56000-unnecessary-surgeries/2402377/"
    },
    {
        "title": "Ayushman Hospital And Health Service, Delhi Doctors List (51)",
        "snippet": "Ayushman Hospital And Health Service is a multi-speciality hospital in Delhi. View Ayushman Hospital And Health Service, Delhi contact number, photos, doctors list, reviews, and book appointments online. ... Delhi is located at GD Goenka School Rd, Pocket 1 Sector 10, Dwarka, Delhi, Delhi - 110075. ... Is Ayushman Bharat Card applicable in ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/delhi/hospital/ayushman-hospital-and-health-services-delhi"
    },
    {
        "title": "Goenka Hospital, Multispecialty Hospital Gujarat, Hospital in Gujarat ...",
        "snippet": "Welcome to Goenka Hospital. Goenka Hospital is having ultramodern infrastructure with state of art facilities, equipments, trained, educated and dedicated medical and paramedical staff. Hospital is equipped to cater all kind of medical, surgical and accidental emergencies.",
        "sentiment": "5 (Positive)",
        "link": "https://www.goenkahospital.org/home.html"
    },
    {
        "title": "Eligibility Of Pradhan Mantri Ayushman Bharat Yojana - ClearTax",
        "snippet": "The benefits of the scheme can be availed at any government hospital or empanelled private hospital. The eligibility of beneficiaries targeted towards the poor, deprived rural families and identified occupational category of urban workers' families based on the Socio-Economic Caste Census (SECC) 2011 data.",
        "sentiment": "5 (Positive)",
        "link": "https://cleartax.in/s/pradhan-mantri-ayushman-bharat-yojana"
    },
    {
        "title": "Super Specialty Hospital in Patna - Jay Prabha Medanta",
        "snippet": "Brining world-class, holistic healthcare at an affordable cost to the citizens of Bihar, Jay Prabha Medanta Super Specialty Hospital has transformed the healthcare landscape in the state and surrounding areas with its exceptional medical professionals, advanced technology, and comprehensive range of specialties. With an expansive campus sprawled across 1 million square feet, the hospital ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.medanta.org/hospitals-near-me/patna-hospital"
    },
    {
        "title": "Ayushman Hospital & Health Services - Practo",
        "snippet": "Book Appointments Online, View Doctor Fees, address, for Ayushman Hospital & Health Services in Delhi | Practo ... Sector 10, Elephanta Road Landmark: Near GD Goenka School & Oppsoite Plot Number 41 Dwarka, Delhi Landmark: Near GD Goenka School & Oppsoite Plot Number ... Please dont consult with dr vikas Gupta and ayushman hospital sector 10 ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.practo.com/delhi/hospital/ayushman-hospital-and-health-services-dwarka"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Haryana - Download PDF - HexaHealth",
        "snippet": "To view the AB-PMJAY panelled hospitals in Haryana, you need to visit the official website https://hospitals.pmjay.gov.in. Click on 'Find Hospitals' and enter Haryana, along with the District, Hospital Type, Speciality, Hospital Name, and Empanelment Type. Click on the Search button and get the list of all hospitals in one place.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-haryana"
    },
    {
        "title": "Ayushman Hospital | Best Orthopaedic Hospital in India | Orthopedic Dr ...",
        "snippet": "Ayushman Hospital is Nagpur-based best Orthopaedic hospital in India known for specialized surgeries like orthopedics, Neuro, and Joint replacement. Call us @ (703) 097-4619.",
        "sentiment": "5 (Positive)",
        "link": "https://theayushmanhospital.com/"
    },
    {
        "title": "Best Hospital in Indore | Top Hospital in Indore | Kokilaben Hospital ...",
        "snippet": "Kokilaben Hospital is the best hospital in Indore providing state-of-the-art healthcare services and world class treatment including heart, cancer, and neurology disease. 24 HRS +91-731-4811111 Emergency +91-731-4811000",
        "sentiment": "5 (Positive)",
        "link": "https://indore.kokilabenhospital.com/"
    },
    {
        "title": "List Of Empaneled Hospitals Under Ayushman Bharat Yojana For Free ...",
        "snippet": "Every senior citizen of the country above the age of 70 years will get free treatment in the hospital. Such elderly people will be given Ayushman Vaya Vandana Card. ... Ex-Servicemen Contributory Health Scheme (ECHS) and Ayushman Central Armed Police Force (CAPF) may either choose their existing scheme or opt for AB PM-JAY.",
        "sentiment": "4 (Positive)",
        "link": "https://zeenews.india.com/personal-finance/list-of-empaneled-hospitals-under-ayushman-bharat-yojana-for-free-treatment-check-direct-link-here-2813786.html"
    },
    {
        "title": "Chirayu National Hospital",
        "snippet": "Chirayu National Hospital and Medical Institute (CNHMI), strategically located at Maharajgunj, Kathmandu, is a private hospital providing ethical and personalized care within an infrastructure on par with the best facility in the country. CNHMI commenced its operation in December 2013, offering both out-patient services and in-patient services.",
        "sentiment": "5 (Positive)",
        "link": "https://www.chirayuhospital.com.np/"
    },
    {
        "title": "Ayushman Card Hospital List in Chennai",
        "snippet": "The document appears to be a list of 20 hospitals in Tamil Nadu, India that have been approved for empanelment under the PMJAY public health insurance program. It includes information on each hospital's ID number, name, location, contact details, specialties, and application status. All 20 hospitals are listed as having their empanelment application approved but not yet onboarded or having any ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.scribd.com/document/706070401/Ayushman-Card-Hospital-List-In-Chennai"
    },
    {
        "title": "List of Diseases Covered in Ayushman Bharat - Download PDF - HexaHealth",
        "snippet": "The Ayushman Bharat Yojana has led to the creation of new healthcare facilities and the strengthening of existing ones, which has improved the overall healthcare infrastructure in the country.. Access to Quality Healthcare: The Ayushman Bharat Covered Diseases List provides the beneficiaries with quality healthcare services.It ensures that they receive the necessary medical treatment without ...",
        "sentiment": "2 (Negative)",
        "link": "https://www.hexahealth.com/blog/ayushman-bharat-covered-diseases-list"
    },
    {
        "title": "Dr. Aruna Singh - Ayushman Hospital and Health Services",
        "snippet": "Ayushman Hopsital & Health Services, Sector 10, Dwarka, Delhi - 110075. Contact Number: +91 9205481438 (011) 49495566 & (011) 49495555 In Case of Emergency: (011) 49495500 E-Mail: info@ayushmanhhs.in",
        "sentiment": "4 (Positive)",
        "link": "https://www.ayushmanhhs.in/dr-aruna-singh/"
    },
    {
        "title": "Our Doctors | Ayushman Hospital and Health Services",
        "snippet": "1800 313131 111. EWS Nodal Officer Details Name- Dr. Anita Mor Telephone - 09205481439 dr.anita.mor@ayushmanhhs.in",
        "sentiment": "5 (Positive)",
        "link": "https://www.ayushmanhhs.in/our-doctors/"
    },
    {
        "title": "Ayushman Bharat health card scam - Ayushman Bharat health card scam ...",
        "snippet": "Ahmedabad Police has uncovered a major Ayushman Bharat card scam involving Khyati Hospital, where 3,000 cards were fraudulently issued for Rs 1,500 each, enabling ineligible treatment. ... Police now focused on identifying how much money was extorted and the extent of fraudulent claims under the scheme. Published By:",
        "sentiment": "1 (Negative)",
        "link": "https://www.indiatoday.in/india/story/ayushman-bharat-health-card-scam-gujarat-police-6-arrested-khyati-hospital-fake-patients-2651167-2024-12-18"
    },
    {
        "title": "Private Hospitals Caught in Fake Ayushman Card Reimbursement Scam",
        "snippet": "The Union Government revealed a fake Ayushman Cards scam involving empaneled hospitals; the ED seized Rs 88 lakh and probed Rs 25 crore in proceeds of crime. ... Ayushman Vaya Vandana Card to provide free hospital treatment to all above 70 years: ... Neelkanth Hospital for collection of the evidence of the offense of money-laundering. ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.ibtimes.co.in/private-hospitals-caught-fake-ayushman-card-reimbursement-scam-876809"
    },
    {
        "title": "Ayushman Card PDF Download Online Process (3 Methods)",
        "snippet": "Step 6: Download the Ayushman Card. Next, select and tick the box beside the name whose Ayushman card is to be downloaded. Next, click on the 'Download' button. A pop-up will appear showing that the Ayushman card has been downloaded successfully. Next, click on the 'OK' button.",
        "sentiment": "5 (Positive)",
        "link": "https://www.govtjobslatest.in/ayushman-card-pdf-download-online/"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Delhi - Download PDF - HexaHealth",
        "snippet": "To view the AB-PMJAY panelled hospitals in Delhi, you need to visit the official website https://hospitals.pmjay.gov.in. Click on 'Find Hospitals' and enter Delhi, along with the District, Hospital Type, Speciality, Hospital Name, and Empanelment Type. Click on the Search button and get the list of all hospitals in one place.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-delhi"
    },
    {
        "title": "Money Laundering and Terrorist Financing Risks Arising from Migrant ...",
        "snippet": "The report highlights the need for countries to understand the money laundering risks they face from migrant smuggling and to proactively follow the money linked to this criminal activity, including through increased collaboration with national and international authorities and the private sector. ... The FATF calls on countries to proactively ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.fatf-gafi.org/en/publications/Methodsandtrends/Migrant-smuggling.html"
    },
    {
        "title": "Ayushman Vaya Vandana Card 2025: How to Apply Online",
        "snippet": "The Ayushman Vaya Vandana Card would provide free hospital treatment to all seniors in the country who are over 70. With the new scheme, everyone who receives an Ayushman Vaya Vandana card in 2025 will get free medical care at any hospital associated with AB PMJAY up to Rs 5 lakh. Objective of Ayushman Vaya Vandana Card",
        "sentiment": "4 (Positive)",
        "link": "https://pmgovtschemehub.com/ayushman-vaya-vandana-card/"
    },
    {
        "title": "Best Hospital in Indore - CARE CHL Hospitals",
        "snippet": "Pioneering Healthcare in Madhya Pradesh . CARE CHL Hospitals, Indore a 200-bedded hospital is the first corporate Hospital in Madhya Pradesh. Being a multi-speciality hospital, we provide services in over 30 medical specialities: Cardiology, Cardiac Surgery, Urology, Neurology, Gastroenterology, Oncology, Laparoscopic and General Surgery, Obstetrics and Gynaecology, Transplants to name a few.",
        "sentiment": "5 (Positive)",
        "link": "https://www.carehospitals.com/indore/"
    },
    {
        "title": "आयुष्मान भारत योजना (Mera PMJAY) पात्रता मापदंड और योग्यता",
        "snippet": "आयुष्मान भारत योजना पात्रता - मेरा पीएमजेएवाई आधिकारिक वेबसाइट पर आयुष्मान भारत योजना कार्ड के लिए विस्तृत पात्रता मानदंड ऑनलाइन देखें।",
        "sentiment": "4 (Positive)",
        "link": "https://www.hexahealth.com/hi/blog/ayushman-card-eligibility-in-hindi"
    },
    {
        "title": "PMJAY Hospital List Ahmedabad - A to Z Sarkari Mahiti",
        "snippet": "The scheme covers a total of 197 hospitals in Ahmedabad district including 122 private hospitals and 75 government hospitals. We have provided the name of the hospital, full address of the hospital and contact number of the hospital in the list of hospitals in Ahmedabad district that provide free treatment under the Ayushman card scheme.. If you want to get more detailed information about the ...",
        "sentiment": "4 (Positive)",
        "link": "https://atozsarkarimahiti.com/pmjay-hospital-list-ahmedabad/"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Patna - Download PDF - HexaHealth",
        "snippet": "To view the AB-PMJAY panelled hospitals in Patna, you need to visit the official website https://hospitals.pmjay.gov.in. Click on 'Find Hospitals' and enter Patna, along with the District, Hospital Type, Speciality, Hospital Name, and Empanelment Type. Click on the Search button and get the list of all hospitals in one place.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-patna"
    },
    {
        "title": "Ayushman Card Hospital List Indore - 1PDF",
        "snippet": "Ayushman Card Hospital List Indore. Ayushman Card or Pradhan Mantri Jan Arogya Yojana (PMJAY) will provide financial protection (Swasthya Suraksha) to 10.74 crore poor, deprived rural families and identified occupational categories of urban workers' families as per the latest Socio-Economic Caste Census (SECC) data (approx. 50 crore beneficiaries).",
        "sentiment": "1 (Negative)",
        "link": "https://1pdf.in/ayushman-hospital-list-indore/"
    },
    {
        "title": "Ayushman Hospital Dwarka | Doctors Appointment - Medintu India",
        "snippet": "Ayushman Hospital & Health Services in Sector 10, Dwarka, is a modern 105-bed multi-specialty hospital. For over 17 years, Ayushman Hospital, Dwarka offering world-class healthcare at affordable prices. The hospital is equipped with the latest medical technology and staffed by top medical professionals.",
        "sentiment": "4 (Positive)",
        "link": "https://medintu.in/hospital/delhi/ayushman-hospital-dwarka/"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Ranchi - Download PDF - HexaHealth",
        "snippet": "To view the AB-PMJAY panelled hospitals in Ranchi, you need to visit the official website https://hospitals.pmjay.gov.in. Click on 'Find Hospitals' and enter Ranchi, along with the District, Hospital Type, Speciality, Hospital Name, and Empanelment Type. Click on the Search button and get the list of all hospitals in one place.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-ranchi"
    },
    {
        "title": "Dr. Rajkumar - Orthopedic surgeon - Book Appointment Online ... - Practo",
        "snippet": "Dr. Rajkumar practices at Ayushman Hospital & Health Services in Dwarka Sector 10, Delhi. ... Pocket 1, Sector 10, Elephanta Road Landmark: Near GD Goenka School & Oppsoite Plot Number 41 Dwarka, Delhi, Landmark: Near GD Goenka School & Oppsoite Plot Number 41, Delhi ... Doctor friendliness Explanation of the health issue Treatment satisfaction ...",
        "sentiment": "3 (Neutral)",
        "link": "https://www.practo.com/delhi/doctor/dr-rajkumar-21-orthopedist-1"
    },
    {
        "title": "Ayushman Card Correction 2025 Online! [e-KYC] abdm.gov.in, Document",
        "snippet": "The Ayushman Bharat Pradhan Mantri Jan Arogya Yojana (PM-JAY) is a flagship initiative of the Government of India aimed at providing financial protection to vulnerable families through health insurance. Beneficiaries under this scheme receive an Ayushman Card, which serves as proof of eligibility for medical coverage and other health benefits.",
        "sentiment": "4 (Positive)",
        "link": "https://hrybed.in/ayushman-card-correction-online/"
    },
    {
        "title": "Ayushman Hospital and Health services - pnyhealthcare",
        "snippet": "Established in 2018, Ayushman Hospital and Health services has 150 bedded Multi & Super Specialty Hospital located at Sec - 10 in Dwarka, New Delhi. Contains the finest combination of Medical, Surgical, Nursing and Technical support under the single roof.",
        "sentiment": "5 (Positive)",
        "link": "https://www.pnyhealthcare.com/solution/ayushman-hospital-and-health-services-dwarka-new-delhi/"
    },
    {
        "title": "Dr. Geet Bajpai | Ayushman Hospital and Health Services",
        "snippet": "Dr.Geet Bajpai is a Consultant in the department of Nephrology at Ayushman Hospital and Health Services, Dwarka Sec 10, New Delhi. He graduated from Vardhaman Mahavir Medical College, Safdarjung Hospital, New Delhi then underwent higher specialist training (MD) from the same college, and DNB (Nephrology) from Sir Ganga Ram Hospital, New Delhi ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.ayushmanhhs.in/dr-geet-bajpai/"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Gurugram - Download PDF - HexaHealth",
        "snippet": "To view the AB-PMJAY panelled hospitals in Gurugram, you need to visit the official website https://hospitals.pmjay.gov.in. Click on 'Find Hospitals' and enter Gurugram, along with the District, Hospital Type, Speciality, Hospital Name, and Empanelment Type. Click on the Search button and get the list of all hospitals in one place.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-gurugram"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Thane - Download PDF - HexaHealth",
        "snippet": "To view the AB-PMJAY panelled hospitals in Thane, you need to visit the official website https://hospitals.pmjay.gov.in. Click on 'Find Hospitals' and enter Thane, along with the District, Hospital Type, Speciality, Hospital Name, and Empanelment Type. Click on the Search button and get the list of all hospitals in one place.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-thane"
    },
    {
        "title": "Medanta Indore - Advanced Multi-Speciality Hospital in Central India",
        "snippet": "Medanta Indore is one of central India's most advanced multi-super speciality hospitals that has redefined the standard of excellence in healthcare delivery by bringing together the best of medical expertise, infrastructure, technology, training and education. With an expansive building spanning over 73,700 square feet, the hospital stands as a testament to Medanta's commitment of taking ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.medanta.org/hospitals-near-me/indore-hospital"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Mumbai - Download PDF - HexaHealth",
        "snippet": "To view the AB-PMJAY panelled hospitals in Mumbai, you need to visit the official website https://hospitals.pmjay.gov.in. Click on 'Find Hospitals' and enter Mumbai, along with the District, Hospital Type, Speciality, Hospital Name, and Empanelment Type. Click on the Search button and get the list of all hospitals in one place.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-mumbai"
    },
    {
        "title": "Ayushman Hospital in Dwarka Sector-10, Delhi - Lybrate",
        "snippet": "Near, Elephenta Line, GD Goenka School Rd, Sector 10 Dwarka. 4.3. 1 Doctor",
        "sentiment": "4 (Positive)",
        "link": "https://www.lybrate.com/delhi/clinic/ayushman-hospital-dwarka-sector-10-b"
    },
    {
        "title": "Ayushman Vaya Vandana Card List 2025 Search Beneficiary",
        "snippet": "All seniors over 70 in the nation will be eligible for free hospital care through the Ayushman Vaya Vandana Card 2025. Everyone who obtains an Ayushman Vaya Vandana card in 2025 would be eligible for free medical care up to Rs 5 lakh at any facility connected to AB PMJAY under the new program. Helpful Summary of Ayushman Vaya Vandana Card List",
        "sentiment": "4 (Positive)",
        "link": "https://pmgovtschemehub.com/ayushman-vaya-vandana-card-list/"
    },
    {
        "title": "Ayushman Card Hospital List in Gujarat - ગુજરાતમાં આયુષ્માન કાર્ડ ...",
        "snippet": "With the Ayushman card, you can access free health services worth up to ₹5 lakh at any Ayushman Bharat hospital in Gujarat. This scheme is specifically designed for the poor. Many government and private hospitals across India have been included in the Ayushman Bharat scheme. You can visit any Ayushman card-affiliated hospital in Gujarat ...",
        "sentiment": "5 (Positive)",
        "link": "https://mahitiapp.in/ayushman-card-hospital-list-in-gujarat/"
    }
]