[
    {
        "title": "सेज ग्रुप के मालिक संजीव अग्रवाल की पत्नी किरण को तीन साल की सश्रम सजा",
        "snippet": "52 साल की किरण अग्रवाल भोपाल के Sage Group के मालिक संजीव अग्रवाल की पत्नी हैं। संजीव अग्रवाल करोड़ों रुपए के आसामी हैं। सेज के रियल एस्टेट ...",
        "sentiment": "2 (Negative)",
        "link": "https://thesootr.com/state/madhya-pradesh/kiran-wife-sage-group-owner-sanjeev-aggarwal-sentenced-three-years-rigorous-imprisonment-8426316"
    },
    {
        "title": "Er. Sanjeev Agrawal - Zealous Educationist, visionary entrepreneur, and ...",
        "snippet": "Er. Sanjeev Agrawal's journey has been noticed by all, including the national and international level organizations, institutions, and media, Forbes and Fortune magazines had featured him, and a ...",
        "sentiment": "2 (Negative)",
        "link": "https://timesofindia.indiatimes.com/education/news/er-sanjeev-agrawal-zealous-educationist-visionary-entrepreneur-and-a-man-of-sheer-will-and-commitment/articleshow/95443350.cms"
    },
    {
        "title": "Dozens charged in Atlanta-based money laundering operation that ...",
        "snippet": "Federal agents have arrested twenty-four individuals for their involvement in a large-scale fraud and money laundering operation that targeted citizens, corporations, and financial institutions throughout the United States. Business email compromise schemes, romance fraud scams, and retirement account scams, among other frauds, duped numerous victims into losing more than $30",
        "sentiment": "1 (Negative)",
        "link": "https://www.justice.gov/usao-ndga/pr/dozens-charged-atlanta-based-money-laundering-operation-funneled-30-million-proceeds"
    },
    {
        "title": "Er. Sanjeev Agrawal - Chairman, The Sage Group",
        "snippet": "Er. Sanjeev Agrawal - Chairman, The Sage Group. Home; Chairman's Message; My mission is nation-building! With a global vision and dedication to serve the needs of every client, we are \"Shaping a better tomorrow\". We are a company with zeal and a mission for excellence. ... (Sage Group of Institution) to Power, Media, Industry & Construction. We ...",
        "sentiment": "5 (Positive)",
        "link": "https://agrawalconstruction.com/chairmans-message/"
    },
    {
        "title": "Er. Sanjeev Agrawal, Featured in Globally Recognized Fortune Magazine ...",
        "snippet": "In Madhya Pradesh, Er. Sanjeev Agrawal is known as the most promising business leader in the field of real estate and education. siness leaders in the July Edition 2021. Er. Sanjeev Agrawal, CMD at The Sage Group and chancellor at SAGE University, Bhopal< Madhya Pradesh, is also featured as the promising business leader in India.",
        "sentiment": "5 (Positive)",
        "link": "https://sageuniversity.edu.in/blogs/Ersanjeevagrawalfeaturedinfortunemagazine"
    },
    {
        "title": "The SAGE Group Bhopal - Company in India | Group in India",
        "snippet": "The SAGE Group - The SAGE Group one of the Best Company in India, is a parent firm of Agrawal Construction Co, Sagar Group of Institutions, SAGE University and Agrawal Power ... Power; CSR; Work With Us; Blogs; Connect With Us. Contact; Grievances; Who Behind Us Our Core Team. Er. Sanjeev Agrawal. CMD, The SAGE Group. Mrs. Kiran Agrawal ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.thesage.co.in/core-team"
    },
    {
        "title": "Bay Area developer strikes key deal in SEC fraud case - East Bay Times",
        "snippet": "Developer Sanjeev Acharya and his real estate firm Silicon Sage Builders have reached a partial settlement with the Securities and Exchange Commission in a fraud case, according to an order issued ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.eastbaytimes.com/2021/03/26/real-estate-bay-area-developer-deal-sec-fraud-silicon-sage/"
    },
    {
        "title": "Our Leader | SAGE University Indore, MP",
        "snippet": "SAGE University Indore is established with a great vision of epitome in imparting approach with the motto of contemporary and pragmatic visionary of our Founder Chairman Er. Sanjeev Agrawal .The University is established in more than 25 acre land areas in Indore with lush greeneries and hill top view under the SAGE Group.",
        "sentiment": "5 (Positive)",
        "link": "https://sageuniversity.in/the-leadership/"
    },
    {
        "title": "CMD Corner - SAGE University",
        "snippet": "Er. Sanjeev Agrawal, The Sage group sharing his views on how scenarios will change post-COVID and how we should cope with the current situation. Er. Sanjeev Agrawal leads central India's biggest educational group SIRT, Sage University and Sage International School and with his experience of years, he guided how the education sector can overcome ...",
        "sentiment": "4 (Positive)",
        "link": "https://sageuniversity.edu.in/Chancellor-Corner"
    },
    {
        "title": "The SAGE Group Bhopal - Company in India | Group in India",
        "snippet": "Agrawal Construction Co., one of the best builders in Bhopal, started the glorious journey in real estate in the year 1987 under the guidance of Er. Sanjeev Agrawal and achieved the benchmark to be the best construction company in Bhopal. Agrawal Construction Co. is the pioneer in the real estate business since it was founded four decades ago.",
        "sentiment": "5 (Positive)",
        "link": "https://www.thesage.co.in/"
    }
]