[
    {
        "title": "MP Land Fraud Case: Sage Group Director's Wife Among Five Get 3-Year Jail",
        "snippet": "MP Land Fraud Case: Sage Group Director's Wife Among Five Get 3-Year Jail They hatched a conspiracy and sold off a farmer's 4.92 acer mortgaged land for Rs 1.50 lakh; the actual cost of which ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.freepressjournal.in/bhopal/mp-land-fraud-case-sage-group-directors-wife-among-five-get-3-year-jail"
    },
    {
        "title": "Bhopal Court News Sanjeev Agarwal Wife Kiran Agrawal Punished - द ...",
        "snippet": "Bhopal Court News The wife of a billionaire businessman of the capital was convicted in a case registered under the Prevention of Corruption Act in Bhopal District Court. ... Sage Group News, Sage Group Property Fraud, Sanjeev Agrawal News, ... MP Digital Arrest: Digital Arrest की शिकार शेयर कारोबारी ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.thecrimeinfo.com/national-news/madhya-pradesh/bhopal-court-pronounced-punishment-in-land-auction-fraud/"
    },
    {
        "title": "सेज ग्रुप के मालिक संजीव अग्रवाल की पत्नी किरण को तीन साल की सश्रम सजा",
        "snippet": "52 साल की किरण अग्रवाल भोपाल के Sage Group के मालिक संजीव अग्रवाल की पत्नी हैं। संजीव अग्रवाल करोड़ों रुपए के आसामी हैं। सेज के रियल एस्टेट ...",
        "sentiment": "2 (Negative)",
        "link": "https://thesootr.com/state/madhya-pradesh/kiran-wife-sage-group-owner-sanjeev-aggarwal-sentenced-three-years-rigorous-imprisonment-8426316"
    },
    {
        "title": "Bhopal news | सेज ग्रुप के मालिक संजीव अग्रवाल की पत्नी किरण को तीन साल ...",
        "snippet": "भोपाल से एक बड़ा मामला सामने आया है, जिसमें सेज ग्रुप के मालिक संजीव अग्रवाल की पत्नी किरण अग्रवाल को तीन साल की सजा सुनाई गई है |",
        "sentiment": "2 (Negative)",
        "link": "https://thesootr.com/video/society/bhopal-news-kiran-wife-of-sage-group-owner-sanjeev-aggarwal-sentenced-to-three-years-imprisonment-8429672"
    },
    {
        "title": "Er. Sanjeev Agrawal - Zealous Educationist, visionary entrepreneur, and ...",
        "snippet": "Er. Sanjeev Agrawal's journey has been noticed by all, including the national and international level organizations, institutions, and media, Forbes and Fortune magazines had featured him, and a ...",
        "sentiment": "2 (Negative)",
        "link": "https://timesofindia.indiatimes.com/education/news/er-sanjeev-agrawal-zealous-educationist-visionary-entrepreneur-and-a-man-of-sheer-will-and-commitment/articleshow/95443350.cms"
    },
    {
        "title": "Our Leader | SAGE University Indore, MP",
        "snippet": "SAGE University Indore is established with a great vision of epitome in imparting approach with the motto of contemporary and pragmatic visionary of our Founder Chairman Er. Sanjeev Agrawal .The University is established in more than 25 acre land areas in Indore with lush greeneries and hill top view under the SAGE Group.",
        "sentiment": "5 (Positive)",
        "link": "https://sageuniversity.in/the-leadership/"
    },
    {
        "title": "Er. Sanjeev Agrawal - Chairman, The Sage Group",
        "snippet": "Er. Sanjeev Agrawal - Chairman, The Sage Group. Home; Chairman's Message; My mission is nation-building! With a global vision and dedication to serve the needs of every client, we are \"Shaping a better tomorrow\". We are a company with zeal and a mission for excellence. ... (Sage Group of Institution) to Power, Media, Industry & Construction. We ...",
        "sentiment": "5 (Positive)",
        "link": "https://agrawalconstruction.com/chairmans-message/"
    },
    {
        "title": "Er. Sanjeev Agrawal | Chancellor of SAGE University Indore",
        "snippet": "Er. Sanjeev Agrawal (CMD, The Sage Group) started his journey alone, following his passion and today he is one of the most celebrated business tycoons of Central India. He is a teacher, motivator, visionary, entrepreneur, an educationist, a renowned Builder and an idol for many. He has helped and created works for lakhs of people around.",
        "sentiment": "5 (Positive)",
        "link": "https://sageuniversity.in/Chancellor-Corner"
    },
    {
        "title": "Er. Sanjeev Agrawal, Featured in Globally Recognized Fortune Magazine ...",
        "snippet": "In Madhya Pradesh, Er. Sanjeev Agrawal is known as the most promising business leader in the field of real estate and education. siness leaders in the July Edition 2021. Er. Sanjeev Agrawal, CMD at The Sage Group and chancellor at SAGE University, Bhopal< Madhya Pradesh, is also featured as the promising business leader in India.",
        "sentiment": "5 (Positive)",
        "link": "https://sageuniversity.edu.in/blogs/Ersanjeevagrawalfeaturedinfortunemagazine"
    },
    {
        "title": " Er. Sanjeev Agrawal - SAGE University",
        "snippet": "Ms. Shivani Agrawal Executive Director (The Sage Group) Ms. Sakshi Agrawal Executive Director (The Sage Group) Dr. Anurag Verma (Group Coordinator, R&D) Dr. Minal Saxena (Group Co-Coordinator, R&D) For details contact at deanrnd@sageuniversity.in Sage University, Indore Sagar Group of Institutions (SIRT), Bhopal Sage University, Bhopal",
        "sentiment": "1 (Negative)",
        "link": "https://sageuniversity.edu.in/assets/publication/R&D-Handbook.pdf"
    },
    {
        "title": "The SAGE Group Bhopal - Company in India | Group in India",
        "snippet": "The SAGE Group - The SAGE Group one of the Best Company in India, is a parent firm of Agrawal Construction Co, Sagar Group of Institutions, SAGE University and Agrawal Power ... Power; CSR; Work With Us; Blogs; Connect With Us. Contact; Grievances; Who Behind Us Our Core Team. Er. Sanjeev Agrawal. CMD, The SAGE Group. Mrs. Kiran Agrawal ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.thesage.co.in/core-team"
    },
    {
        "title": "CMD Corner - SAGE University",
        "snippet": "Er. Sanjeev Agrawal, The Sage group sharing his views on how scenarios will change post-COVID and how we should cope with the current situation. Er. Sanjeev Agrawal leads central India's biggest educational group SIRT, Sage University and Sage International School and with his experience of years, he guided how the education sector can overcome ...",
        "sentiment": "4 (Positive)",
        "link": "https://sageuniversity.edu.in/Chancellor-Corner"
    },
    {
        "title": " Er. Sanjeev Agrawal National Workshop - sageuniversity.edu.in",
        "snippet": "Er. Sanjeev Agrawal CMD, The Sage Group Chancellor, SAGE University (Indore, Bhopal) Dr. Prashant Jain Ar. Shivani Agrawal National Workshop Chief Patron Patrons Advisors Pro-Chancellor SAGE University (Indore, Bhopal) Executive Director The SAGE Group Dr. Ashish Dutta Director General SAGE University Bhopal Registration 08:30 - 09:00 am",
        "sentiment": "1 (Negative)",
        "link": "https://sageuniversity.edu.in/assets/seminar/Researchmethology-3.pdf"
    },
    {
        "title": "The SAGE Group Bhopal - Company in India | Group in India",
        "snippet": "Agrawal Construction Co., one of the best builders in Bhopal, started the glorious journey in real estate in the year 1987 under the guidance of Er. Sanjeev Agrawal and achieved the benchmark to be the best construction company in Bhopal. Agrawal Construction Co. is the pioneer in the real estate business since it was founded four decades ago.",
        "sentiment": "5 (Positive)",
        "link": "https://www.thesage.co.in/"
    },
    {
        "title": "True Sage Foundation",
        "snippet": "The SAGE Group - The SAGE Group one of the Best Company in India, is a parent firm of Agrawal Construction Co, Sagar Group of Institutions, SAGE University and Agrawal Power ... Patron - Er. Sanjeev Agrawal, CMD, The Sage Group Chairperson - Mrs. Kiran Agrawal . Board Members; Ar. Shivani Agarwal, Executive Director, The SAGE Group;",
        "sentiment": "5 (Positive)",
        "link": "https://www.thesage.co.in/corporate-social-responsibility"
    },
    {
        "title": " E-Newsletter SAGE UNIVERSITY, INDORE Inspiring Future",
        "snippet": "venture as SAGE University joined hands with Garuda Aerospace Ltd. Chennai to launch the city's premier Drone Training Center. The inauguration ceremony, graced by Hon'ble Chancellor of the SAGE Group, Er. Sanjeev Agrawal, and distinguished guests, marked the dawn of a new era in Drone Technology. This collaboration opened up",
        "sentiment": "1 (Negative)",
        "link": "https://sageuniversity.in/assets/newslatterpdf/October2023.pdf"
    },
    {
        "title": "The SAGE Group Bhopal - Company in India | Group in India",
        "snippet": "Agrawal Construction Co., one of the best builders in Bhopal, started the glorious journey in real estate in the year 1987 under the guidance of Er. Sanjeev Agrawal and achieved the benchmark to be the best construction company in Bhopal. Agrawal Construction Co. is the pioneer in the real estate business since it was founded four decades ago.",
        "sentiment": "5 (Positive)",
        "link": "https://thesage.co.in/real-estate/"
    }
]