[
    {
        "title": "UK fraud agency opens investigation into alleged £140mn property scam",
        "snippet": "The UK Serious Fraud Office has opened an investigation into an alleged £140mn property fraud and arrested four people in a series of raids. The prosecutor is probing Liverpool-based Signature ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.ft.com/content/8aa0979e-097f-4263-b4f6-83b1c85b83ff"
    },
    {
        "title": "Signature Group - GOV.UK",
        "snippet": "Operating for over seven years, Signature Group, an international property investment scheme, attracted investors in the redevelopment of landmarks including Belfast's Scottish Mutual Building ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.gov.uk/sfo-cases/signature-group"
    },
    {
        "title": "Four arrested in Signature Group '£140m property fraud' probe - BBC",
        "snippet": "\"Investors loaned money to Signature or purchased a hotel room, apartment or office space in one of the group's properties, with promised returns on their investment of between 8% and 15%,\" he said.",
        "sentiment": "1 (Negative)",
        "link": "https://www.bbc.com/news/uk-england-merseyside-68359320"
    },
    {
        "title": "Four arrested in Signature Group '£140m property fraud' probe",
        "snippet": "Four arrested in Signature Group '£140m property fraud' probe. Published. 21 February 2024. ... SFO director Nick Ephgrave said the scheme \"offered attractive returns and used much-loved local ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.bbc.co.uk/news/uk-england-merseyside-68359320"
    },
    {
        "title": "Office of Public Affairs | National Health Care Fraud Enforcement ...",
        "snippet": "The Justice Department today announced the 2024 National Health Care Fraud Enforcement Action, which resulted in criminal charges against 193 defendants, including 76 doctors, nurse practitioners, and other licensed medical professionals in 32 federal districts across the United States, for their alleged participation in various health care fraud schemes involving approximately $2.75 billion ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.justice.gov/opa/pr/national-health-care-fraud-enforcement-action-results-193-defendants-charged-and-over-275-0"
    },
    {
        "title": "DOJ charges nearly 200 people in $2.7B health care fraud crackdown | AP ...",
        "snippet": "FILE - Attorney General Merrick Garland speaks at the Department of Justice, Aug. 11, 2023, in Washington. The Justice Department has charged nearly 200 people in a sweeping crackdown on health care fraud schemes nationwide with false claims topping $2.7 billion.",
        "sentiment": "1 (Negative)",
        "link": "https://apnews.com/article/justice-department-health-care-fraud-garland-24948b951896d0f265c29ba3fcacf858"
    },
    {
        "title": "Draft of Medical Negligence Complaint Against The Signature Hospital ...",
        "snippet": "The complaint alleges gross medical negligence by doctors at The Signature Hospital in Gurugram that led to the wrongful death of the complainant's father. Key details include: 1) The complainant's father, aged 66, was in good health prior to the surgery and only needed a minor gallbladder removal procedure. 2) The surgery was conducted in a negligent manner without proper tests, discussion of ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.scribd.com/document/711679464/Draft-of-Medical-Negligence-Complaint-Against-The-Signature-Hospital-Park-Hospital-Gurgaon"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Signature Hospital Quick Appointment Appointment. Contact Us Ambulance/Emergency. Park Emergency +91-9916699166. Delhi +91-7533033025. Gurugram +91-7503141435. Palam Vihar +91-9891424242. The Signature, Gurugram +91-6262828213 ... Dr. Ajit Gupta is the Founder of the Park Group of Hospitals. His avid passion for subject of healthcare in respect ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/visionaries"
    },
    {
        "title": "Advance Super Multi Speciality Hospital in Gurugram Sector 37D",
        "snippet": "Signature Hospital, part of Park Hospital is a fully-equipped private hospital with state-of-the-art medical facilities, 300 plus beds multispecialty hospital in Gurugram ... About the Group . About Us; Our Journey; Our Visionaries; Our Management; Awards & Accolades; Accreditations; Our Hospitals . Our Hospitals; Delhi; Gurugram; Palam Vihar;",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/hospital/super-multispeciality-hospital-in-gurgaon-37D"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Address. Meera Enclave(Chowkhandi), Outer Ring Road, New Delhi. Email info@parkhospital.in; Telephones 1800-102-6767; Working Hours. 24/7 (Emergency Department)",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/contact-us"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Park hospital is the fastest growing chain of advanced super speciality hospitals, Provides patients with best & affordable healthcare treatment. ... Group Director - Legal. Rakesh Bhardwaj. Vice President - Legal. Atin Mehta. Senior Law Officer. ... The Signature Hospital. Dr. Pardeep Singh. Deputy Medical Superintendent. Panipat. Brig. Yesh ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.parkhospital.in/meet-our-management"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Park hospital is the fastest growing chain of advanced super speciality hospitals, Provides patients with best & affordable healthcare treatment. ... At Park Group of Hospitals, we foster a healthy, safe, and productive work environment with a well-defined positive culture for our employees, while promoting a rewarding work & learning ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/career"
    },
    {
        "title": "Prove the Security of Schnorr's Signature Scheme",
        "snippet": "$\\begingroup$ Usually one doesn't proof this directly on the signature scheme. Instead, prove properties of the underlying identification scheme, and then use Fiat-Shamir to get a secure signature scheme. The property you are looking for is soundness, and the proof technique is called rewinding (which may be a bit unintuitive).",
        "sentiment": "4 (Positive)",
        "link": "https://crypto.stackexchange.com/questions/48616/prove-the-security-of-schnorrs-signature-scheme"
    },
    {
        "title": "Park Group of Hospitals | LinkedIn",
        "snippet": "Book an Appointment with Dr. Sachin Abrol, Consultant - Urology at Park Hospital, Panipat Consult Now: 7027 8989 89, 99166 99166 Park Group of Hospitals: NABL & NABH Accredited 30+ Specialties 10 Lakhs+ Patients Treated 1.5 Lakhs+ International Patients Treated 1 Lakh+ Surgeries Completed . . .",
        "sentiment": "5 (Positive)",
        "link": "https://in.linkedin.com/company/park-hospital"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "The Signature Hospital +91-7496949425. Faridabad +91-7531818181. Sonipat +91-8944000000. Panipat +91-7027898989. Karnal +91-9643000000. Ambala +91-7432000000. Behror +91-7658000000. ... Park Group of Hospitals has witnessed incredible growth to become one of the most advanced & comprehensive healthcare institutions in the region.",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/our-journey"
    },
    {
        "title": " Foundations of Group Signatures: Formal De nitions, Simpli ed ...",
        "snippet": "As indicated above, the notion of group signature was introduced by Chaum and Heyst in [14]. They also gave the rst schemes. Since then, many other schemes were proposed, including [15, 11, 25, 13, 4]. These schemes improve on the performance of the original group signature scheme",
        "sentiment": "1 (Negative)",
        "link": "https://cseweb.ucsd.edu/~mihir/papers/gs.pdf"
    },
    {
        "title": "Know more about Park Hospital, who we are and our people",
        "snippet": "Park Group of Hospitals, equipped with world class facilities is one of the most advanced and comprehensive healthcare institutions. ... Signature Hospital Quick Appointment Appointment. Contact Us Ambulance/Emergency. Park Emergency +91-9916699166. Delhi +91-7533033025. Gurugram +91-7503141435. Palam Vihar +91-9891424242. The Signature ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.parkhospital.in/about-us"
    },
    {
        "title": "Provably Secure Group Signature Schemes from Code-Based Assumptions",
        "snippet": "2 scheme constructed in this paper is an illustrative example. We observe that existing code-based signatures fall into two categories. The \"hash-and-sign\" category consists of the CFS signature [15] and its modiﬁed versions [16], [17], [18].",
        "sentiment": "1 (Negative)",
        "link": "https://arxiv.org/pdf/1909.04472"
    },
    {
        "title": "In conversation with Dr. Ankit Gupta on the journey of trust, quality ...",
        "snippet": "With all major Super Specialties in each Hospital, the Park Group of Hospitals is committed to delivering quality healthcare and boasts of a team of highly proficient, 1000+ full-time experienced ...",
        "sentiment": "5 (Positive)",
        "link": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/in-conversation-with-dr-ankit-gupta-on-the-journey-of-trust-quality-and-future-expansion-at-park-group-of-hospitals/articleshow/103962887.cms"
    },
    {
        "title": " Park Hospitals - Credit Rating",
        "snippet": "The existing management of the hospital is ably supported by a team of renowned medics and professionals. Super-specialty Hospital with strong brand image and committed to women and children health care Bhagirathi Neotia Women and Child Care Centre (BNWCCC)- under Park Hospitals is one of the reputed hospitals in Kolkata. It",
        "sentiment": "1 (Negative)",
        "link": "https://www.careratings.com/upload/CompanyFiles/PR/07012022061901_Park_Hospitals.pdf"
    },
    {
        "title": "Park Group of Hospitals - LinkedIn",
        "snippet": "Book an Appointment with Dr. Barkha Pandey, HOD of Pediatrics and Neonatology at Park Hospital, Palam Vihar Consult Now: 8695 000 000 Park Group of Hospitals: NABL & NABH Accredited 30 ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.linkedin.com/company/park-hospital"
    },
    {
        "title": "Advance Super Multi Speciality Hospital in New Delhi | Park Hospital",
        "snippet": "Park Hospital is a fully-equipped private hospital with state-of-the-art medical facilities, 250 plus beds multispecialty hospital in Delhi ... Signature Hospital Quick Appointment Appointment. Contact Us Ambulance/Emergency. Park Emergency +91-9916699166. Delhi +91-7533033025 ... Delhi is an ambitious initiative from Park Group. This is a ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/hospital/super-multispeciality-hospital-in-Delhi"
    },
    {
        "title": "The Signature Hospital | LinkedIn",
        "snippet": "The Signature Hospital | 1,129 followers on LinkedIn. A 300 bedded advanced super speciality hospital | As a 300-bedded premium hospital, we offer the best in class services and personalized medical care, all dedicated to adding value to your life and health. Our inherent focus is on serving our community, by setting a standard of excellence in providing comprehensive facilities, luxury ...",
        "sentiment": "5 (Positive)",
        "link": "https://in.linkedin.com/company/signaturehospital"
    },
    {
        "title": "An efficient full dynamic group signature scheme over ring - SpringerOpen",
        "snippet": "The group signature scheme is an important primitive in cryptography, it allows members in a group to generate signatures anonymously on behalf of the whole group. In view of the practical application of such schemes, it is necessary to allow users' registration and revocation when necessary, which makes the construction of dynamic group signature schemes become a significant direction. On ...",
        "sentiment": "4 (Positive)",
        "link": "https://cybersecurity.springeropen.com/articles/10.1186/s42400-019-0037-8"
    },
    {
        "title": " A New ID-based Group Signature Scheme from Bilinear Pairings - IACR",
        "snippet": "We then propose a group signature scheme from bilinear pairings under the new ID-based systems. 1 Recently, Castelluccia [10] described how to convert any ID-based signature scheme into a group signature scheme. In his scheme, ID of the user is the public key of a RSA key pair generated by the user himself. The group signature can not forge the",
        "sentiment": "1 (Negative)",
        "link": "https://eprint.iacr.org/2003/116.pdf"
    },
    {
        "title": "The Signature Hospital - LinkedIn",
        "snippet": "Park Group of Hospitals Hospitals and Health Care Gurgaon, Haryana CK Birla Hospital Hospitals and Health Care ... The Signature Hospital | 1,113 followers on LinkedIn. A 300 bedded advanced super ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.linkedin.com/company/signaturehospital/"
    }
]