[
    {
        "title": "BJP leader, wife caught taking Rs 10-lakh bribe | Latest News India ...",
        "snippet": "BJP leader Ganesh Malviya and his wife Poonam Rai, an income tax official, were arrested by the CBI on charges of accepting Rs 10 lakh as bribe from a builder, on Saturday. | Latest News India",
        "sentiment": "1 (Negative)",
        "link": "https://www.hindustantimes.com/india/bjp-leader-wife-caught-taking-rs-10-lakh-bribe/story-S8x7I2zK0JTiBQZ11CnoPN.html",
        "base_query": "Ganesh Malviya",
        "keyword": "news"
    },
    {
        "title": "CBI nabs IT official, husband for bribery in Madhya Pradesh",
        "snippet": "In the intervening night of Friday and Saturday, a Central Bureau of Investigation team from New Delhi arrested Income Tax Deputy Commissioner Poonam Rai and her husband Ganesh Malviya — a ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.thehindu.com/news/national/other-states/cbi-nabs-it-official-husband-for-bribery-in-madhya-pradesh/article5848903.ece"
    },
    {
        "title": "BJP leader Ganesh Malviya, I-T officer, others get bail in ... - News18",
        "snippet": "A local court in Bhopal on Tuesday granted bail to Deputy Commissioner of Income Tax Department Poonam Rai, her husband and BJP leader Ganesh Malviya and two others arrested on Friday by CBI for allegedly accepting a bribe of Rs 10 lakh from a builder.",
        "sentiment": "1 (Negative)",
        "link": "https://www.news18.com/news/india/bjp-leader-ganesh-malviya-i-t-officer-others-get-bail-in-bribery-case-677974.html"
    },
    {
        "title": "Bhopal: IT officer, husband and two others get bail in bribery case",
        "snippet": "A local court here today granted bail to Deputy Commissioner of Income Tax Department Poonam Rai, her husband and BJP leader Ganesh Malviya and two others arrested on Friday by CBI for allegedly ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.ndtv.com/bhopal-news/bhopal-it-officer-husband-and-two-others-get-bail-in-bribery-case-555857"
    },
    {
        "title": "How Do Ganesh Malviya And BJP Choose To Come Through Amidst the EVM's ...",
        "snippet": "We will see how Ganesh Malviya, a prominent man in the BJP from Bhopal, Madhya Pradesh, along with the party itself choose to handle the news about the EVMs. The Electronic Voting Machines, or EVMs, that are used by India in order for their elections to be conducted have been under scrutiny in the last couple of years.",
        "sentiment": "4 (Positive)",
        "link": "https://newsblaze.com/world/south-asia/how-do-ganesh-malviya-and-bjp-choose-to-come-through-amidst-the-evms-allegations-and-what-is-their-plan_155133/",
        "base_query": "Ganesh Malviya",
        "keyword": "news"
    },
    {
        "title": "Bhopal: CBI arrests I-T officer, husband for taking Rs 10 lakh ... - News18",
        "snippet": "Poonam Rai, the Deputy Commissioner of Income Tax, and her husband Ganesh Malviya, a BJP leader, were arrested for accepting a bribe of Rs 10 lakh from a builder. The incident happened at Rai's official residence late on Friday night in Bhopal.",
        "sentiment": "1 (Negative)",
        "link": "https://www.news18.com/news/india/it-commissioner-bribe-677226.html"
    },
    {
        "title": "CBI traps Modi's man accepting Rs 10 lakh bribe - Times of India",
        "snippet": "BHOPAL: In a big embarrassment to BJP's prime ministerial candidate the CBI on Saturday arrested Ganesh Malviya, the co-convener of Narendra Modi's election cell. He was caught along with his wife ...",
        "sentiment": "1 (Negative)",
        "link": "https://timesofindia.indiatimes.com/news/cbi-traps-modis-man-accepting-rs-10-lakh-bribe/articleshow/32933322.cms"
    },
    {
        "title": "Malviya was collecting fund for Narendra Modi: Opposition leader",
        "snippet": "National election co-convenor of BJP Ganesh Malviya, who was arrested along with his wife deputy commissioner of income tax Poonam Rai by CBI while ac",
        "sentiment": "1 (Negative)",
        "link": "https://timesofindia.indiatimes.com/city/indore/Malviya-was-collecting-fund-for-Narendra-Modi-Opposition-leader/articleshow/33134250.cms",
        "base_query": "Ganesh Malviya",
        "keyword": "news"
    },
    {
        "title": "Isha Malviya Collaborates With Ganesh Acharya? Her Dance Clip Goes ...",
        "snippet": "After Bigg Boss 17, Isha Malviya is getting back to work. A picture is now going viral on the internet which shows the actress posing with ace choreographer Ganesh Archarya. A video has also surfaced online which shows Isha flaunting her dance moves. Read full story below, TV News - Times Now",
        "sentiment": "1 (Negative)",
        "link": "https://www.timesnownews.com/entertainment-news/tv/bigg-boss-17s-isha-malviya-collaborates-with-ganesh-acharya-her-dance-clip-goes-viral-article-107541960",
        "base_query": "Ganesh Malviya",
        "keyword": "news"
    },
    {
        "title": "Isha Malviya Visits Lalbaugcha Raja On Ganesh Chaturthi, Seeks ... - News18",
        "snippet": "Now, TV actress Isha Malviya, known for her role in Udaariyaan, has taken some time off her busy schedule to offer prayers at Mumbai's renowned Ganesh pandal, Lalbaugcha Raja. The video shared by Instant Bollywood shows Isha going for darshan.",
        "sentiment": "4 (Positive)",
        "link": "https://www.news18.com/movies/isha-malviya-visits-lalbaugcha-raja-on-ganesh-chaturthi-seeks-blessings-from-bappa-9049373.html",
        "base_query": "Ganesh Malviya",
        "keyword": "news"
    },
    {
        "title": "Top OPG Test Centre in Malviya Nagar, Delhi - ganeshdiagnostic.com",
        "snippet": "OPG Test Is Available at Ganesh Diagnostics in Malviya Nagar, Delhi. Book Your Orthopantomography Test With the Most Reputed Diagnostic Centre and Pathology Lab. Check Out Latest Price and Other Details. Free Ambulance Services.",
        "sentiment": "5 (Positive)",
        "link": "https://www.ganeshdiagnostic.com/opg-test-centre-in-malviya-nagar"
    },
    {
        "title": "Best Diagnostic Centre in Malviya Nagar, Delhi",
        "snippet": "Ganesh Diagnostic is the reliable and best Diagnostic centre in Malviya Nagar for all your Diagnostic tests under one roof, PET Scan, Ultrasound, MRI, CT Scan, X-Ray and much more. ... Ganesh Diagnostic & Imaging Centre. 109, Pocket A-1, Near Deepali Chowk, Sector 08, Rohini, New Delhi 110085 ... News; PACKAGES; Branch. Yamuna VIhar Model Town ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.ganeshdiagnostic.com/diagnostic-centre-in-malviya-nagar"
    },
    {
        "title": "Cancer Test Centre Near Me in Malviya Nagar, Delhi | Test Price and ...",
        "snippet": "Cancer Test Is Available at Ganesh Diagnostics in Malviya Nagar, Delhi. Book Your Cancer Test With the Most Reputed Diagnostic Centre and Pathology Lab. Check Out Latest Price and Other Details. ... Ganesh Diagnostic & Imaging Centre. 109, Pocket A-1, Near Deepali Chowk, Sector 08, Rohini, New Delhi 110085 ... News; PACKAGES; Branch. Yamuna ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.ganeshdiagnostic.com/cancer-testing-lab-in-malviya-nagar"
    },
    {
        "title": "Top Ultrasound Scan Centre Near me in Malviya Nagar | Test Price & Cost",
        "snippet": "Best Ultrasound Centre in Malviya Nagar with Latest and Highly Advanced Technology at an Affordable Price. Ultrasound scan, also known as ultrasonography or sonography or USG test is an imaging tool that utilizes sound waves and a computer to produce images (often known as sonogram) of soft tissues, organs and other structures inside your body.It helps in the identification and evaluation of ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.ganeshdiagnostic.com/ultrasound-scans-in-malviya-nagar",
        "base_query": "Ganesh Malviya",
        "keyword": "news"
    },
    {
        "title": "Top NCV Test Centre in Malviya Nagar, Delhi - ganeshdiagnostic.com",
        "snippet": "NCV Test Is Available at Ganesh Diagnostics in Malviya Nagar, Delhi. Book Your Nerve Conduction Velocity Test With the Most Reputed Radiology and Pathology Lab. Check Out Latest Price and Other Details. ... Ganesh Diagnostic & Imaging Centre. 109, Pocket A-1, Near Deepali Chowk, Sector 08, Rohini, New Delhi 110085 ... News; PACKAGES; Branch ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.ganeshdiagnostic.com/ncv-test-centre-in-malviya-nagar"
    },
    {
        "title": "Full Body Health Checkup Near Me in Malviya Nagar, Delhi | Test ...",
        "snippet": "Full Body Health Checkup Is Available at Ganesh Diagnostics in Malviya Nagar, Delhi. ... Ganesh Diagnostic & Imaging Centre. 109, Pocket A-1, Near Deepali Chowk, Sector 08, Rohini, New Delhi 110085 ... News; PACKAGES; Branch. Yamuna VIhar Model Town Hari Nagar Mangol Puri Nangloi Rohini Firozabad; Others Services.",
        "sentiment": "5 (Positive)",
        "link": "https://www.ganeshdiagnostic.com/full-body-checkup-in-malviya-nagar",
        "base_query": "Ganesh Malviya",
        "keyword": "news"
    },
    {
        "title": "Top Diabetes Test Labs in Malviya Nagar, Delhi - ganeshdiagnostic.com",
        "snippet": "Diabetes Test Is Available at Ganesh Diagnostics in Malviya Nagar, Delhi. Book Your Diabetes Test With the Most Reputed Diagnostic Centre and Pathology Lab. Check Out Latest Price and Other Details. ... Ganesh Diagnostic & Imaging Centre. 109, Pocket A-1, Near Deepali Chowk, Sector 08, Rohini, New Delhi 110085 Sno. Name Rate Action; Login X ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.ganeshdiagnostic.com/diabetes-test-centre-in-malviya-nagar"
    },
    {
        "title": "Shree Ganesh Apartment in Malviya Nagar, Jaipur | MagicBricks",
        "snippet": "At Shree Ganesh Apartment, you can enjoy a modern lifestyle as all conveniences are easily available. Top Amenities in Shree Ganesh Apartment. Lift; Reserved Parking; Shree Ganesh Apartment Address The Shree Ganesh Apartment is strategically located at Diamond Colony, Saraswati Nagar Extension, Malviya Nagar, Jaipur, Rajasthan, 302017.",
        "sentiment": "4 (Positive)",
        "link": "https://www.magicbricks.com/shree-ganesh-apartment-malviya-nagar-jaipur-pdpid-4d4235323937343537",
        "base_query": "Ganesh Malviya",
        "keyword": "news"
    },
    {
        "title": "Ganesh Chaturthi 2024: Isha Malviya Shines at Lalbaugcha Raja Visit",
        "snippet": "Ganesh Chaturthi 2024: As Ganesh Chaturthi festivities illuminate the streets with fervor and devotion, actress Isha Malviya, known for her prominent roles in 'Udaariyaan' and her impactful journey on Bigg Boss 17, has joined in the celebrations by paying a visit to one of Mumbai's most revered Ganesh pandals, Lalbaugcha Raja.",
        "sentiment": "4 (Positive)",
        "link": "https://bollyy.com/entertainment/ganesh-chaturthi-2024-isha-malviya-shines-at-lalbaugcha-raja-visit-7065063",
        "base_query": "Ganesh Malviya",
        "keyword": "news"
    },
    {
        "title": "Gansha Malviya Profiles - Facebook",
        "snippet": "View the profiles of people named Gansha Malviya. Join Facebook to connect with Gansha Malviya and others you may know. Facebook gives people the power...",
        "sentiment": "3 (Neutral)",
        "link": "https://www.facebook.com/public/Gansha-Malviya/",
        "base_query": "Ganesh Malviya",
        "keyword": "news"
    },
    {
        "title": "Mumbai: Congress Candidate Arif Naseem Khan's Poster Found ... - LatestLY",
        "snippet": "BJP's Amit Malviya criticised Congress after a video showed a poster of candidate Arif Naseem Khan on a Lord Ganesha photo, calling it an insult to Hindus and accusing Congress of \"Vote Jihad\" to appeal to Muslim voters. The incident has intensified political tensions ahead of Maharashtra assembly elections on November 20. 📰 Mumbai: Congress Candidate Arif Naseem Khan's Poster Found ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.latestly.com/socially/india/news/mumbai-congress-candidate-arif-naseem-khans-poster-found-pasted-on-lord-ganeshas-photo-bjp-terms-it-outright-insult-to-hindu-community-watch-video-6415966.html",
        "base_query": "Ganesh Malviya",
        "keyword": "news"
    },
    {
        "title": "Radiology and Pathology Services In Delhi, India | Ganesh Diagnostic",
        "snippet": "Ganesh Diagnostic and Imaging Centre Pvt. Ltd. Address: 109, Pocket A-1, Near Deepali Chowk, Sector 08, Rohini, New Delhi 110085",
        "sentiment": "5 (Positive)",
        "link": "https://www.ganeshdiagnostic.com/our-services",
        "base_query": "Ganesh Malviya",
        "keyword": "news"
    }
]