[
    {
        "title": "Bhopal: CBI arrests I-T officer, husband for taking Rs 10 lakh bribe",
        "snippet": "Poonam Rai, the Deputy Commissioner of Income Tax, and her husband Ganesh Malviya, a BJP leader, were arrested for accepting a bribe of Rs 10 lakh from a builder. The incident happened at Rai's official residence late on Friday night in Bhopal.",
        "sentiment": "1 (Negative)",
        "link": "https://www.news18.com/news/india/it-commissioner-bribe-677226.html"
    },
    {
        "title": "BJP leader Ganesh Malviya, I-T officer, others get bail in bribery case",
        "snippet": "A local court in Bhopal on Tuesday granted bail to Deputy Commissioner of Income Tax Department Poonam Rai, her husband and BJP leader Ganesh Malviya and two others arrested on Friday by CBI for allegedly accepting a bribe of Rs 10 lakh from a builder.",
        "sentiment": "1 (Negative)",
        "link": "https://www.news18.com/news/india/bjp-leader-ganesh-malviya-i-t-officer-others-get-bail-in-bribery-case-677974.html"
    },
    {
        "title": "Bhopal: IT officer, husband and two others get bail in bribery case",
        "snippet": "A local court here today granted bail to Deputy Commissioner of Income Tax Department Poonam Rai, her husband and BJP leader Ganesh Malviya and two others arrested on Friday by CBI for allegedly ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.ndtv.com/bhopal-news/bhopal-it-officer-husband-and-two-others-get-bail-in-bribery-case-555857"
    },
    {
        "title": "CBI nabs IT official, husband for bribery in Madhya Pradesh",
        "snippet": "The bribe was sent through two conduits — an accountant and an employee of Mr. Malviya — who led the CBI to the couple's residence where they were nabbed. In court, the judge reprimanded Mr ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.thehindu.com/news/national/other-states/cbi-nabs-it-official-husband-for-bribery-in-madhya-pradesh/article5848903.ece"
    },
    {
        "title": "BJP leader, wife caught taking Rs 10-lakh bribe",
        "snippet": "BJP leader Ganesh Malviya and his wife Poonam Rai, an income tax official, were arrested by the CBI on charges of accepting Rs 10 lakh as bribe from a builder, on Saturday. | Latest News India",
        "sentiment": "1 (Negative)",
        "link": "https://www.hindustantimes.com/india/bjp-leader-wife-caught-taking-rs-10-lakh-bribe/story-S8x7I2zK0JTiBQZ11CnoPN.html"
    },
    {
        "title": "CBI nabs I-T officer for asking bribe worth Rs 10 lakh from builder",
        "snippet": "The official, Poonam Rai, is a 2007-batch officer of Indian Revenue Service (IRS), and her husband Ganesh Malviya is a convener in the BJP's election cell, CBI authorities said. The CBI conducted the raid on Friday night and nabbed two other persons, including a chartered accountant.",
        "sentiment": "1 (Negative)",
        "link": "https://www.indiatoday.in/india/story/income-tax-officer-poonam-rai-deputy-commissioner-arrested-cbi-r-s-bhadoria-186785-2014-03-29"
    },
    {
        "title": "CBI traps Modi's man accepting Rs 10 lakh bribe - Times of India",
        "snippet": "Malviya's wife, an IRS officer, had allegedly demanded a bribe of Rs 25 lakh from Bhadoria, who also owns Ramayan Constructions, to correct discrepancies in his firm's I-T returns, a CBI official ...",
        "sentiment": "1 (Negative)",
        "link": "https://timesofindia.indiatimes.com/news/cbi-traps-modis-man-accepting-rs-10-lakh-bribe/articleshow/32933322.cms"
    },
    {
        "title": "Bhopal: CBI arrests I-T officer, husband for taking Rs 10 lakh bribe",
        "snippet": "CBI ARRESTS A DEPUTY COMMISSIONER OF INCOME TAX AND THREE OTHERS IN AN ALLEGED BRIBERY OF RS.TEN LAKHS. The Central Bureau of Investigation has arrested Poonam Rai, the Deputy Commissioner of Income Tax, and her husband Ganesh Malviya, a BJP leader, and another private person in an alleged bribery case of Rs. 10 Lakhs.",
        "sentiment": "1 (Negative)",
        "link": "https://taxguru.in/income-tax/bhopal-cbi-arrests-officer-husband-rs-10-lakh-bribe.html"
    },
    {
        "title": "BJP leader, his I-T officer wife held - The Indian Express",
        "snippet": "MP Sent to three-day CBI custody for taking bribe; complaint made by a party functionary. ... The CBI arrested deputy commissioner Poonam Rai, an IRS officer of the 2007 batch, and her husband Ganesh Malviya after the first instalment of Rs 10 lakh was paid to a tax consultant and the money was taken to the couple's house in I-T Colony in ...",
        "sentiment": "1 (Negative)",
        "link": "https://indianexpress.com/article/political-pulse/bjp-leader-his-i-t-officer-wife-held/"
    },
    {
        "title": "CBI traps Modi's man accepting Rs 10 lakh bribe - Rediff.com",
        "snippet": "In a big embarrassment to BJP's prime ministerial candidate the CBI on Saturday arrested Ganesh Malviya, the co-convener of Narendra Modi's election cell. ... Poonam Rai, deputy commissioner of income tax, while accepting a bribe of Rs 10 lakh. When CBI laid a trap for Malviya, the agency, ironically, was acting on a complaint of another state ...",
        "sentiment": "1 (Negative)",
        "link": "https://m.rediff.com/news/commentary/2014/mar/31/cbi-traps-modis-man-accepting-rs-10-lakh-bribe/1f9041e866a128667408be1929fbe224"
    },
    {
        "title": "I-T targeting me, alleges Bhadoria | Bhopal News - Times of India",
        "snippet": "State BJP leader Rajesh Bhadoria, who got a deputy commissioner of Income Tax department Poonam Rai and her husband Ganesh Malviya arrested by CBI for allegedly taking Rs 10-lakh bribe to settle a ...",
        "sentiment": "1 (Negative)",
        "link": "https://timesofindia.indiatimes.com/City/Bhopal/I-T-targeting-me-alleges-Bhadoria/articleshow/46803419.cms"
    },
    {
        "title": "CBI nabs I- T officer for taking bribe. - Free Online Library",
        "snippet": "The official, Poonam Rai, is a 2007- batch officer of Indian Revenue Service ( IRS), and her husband Ganesh Malviya is a convener in the BJP's election cell, CBI authorities said. The CBI conducted the raid on Friday night and nabbed two other persons, including a chartered accountant.",
        "sentiment": "1 (Negative)",
        "link": "https://www.thefreelibrary.com/CBI+nabs+I-+T+officer+for+taking+bribe.-a0363334105"
    },
    {
        "title": "Woman I-T officer arrested by CBI in Bhopal suspended",
        "snippet": "It was further alleged in the CBI complaint that Rai's husband Ganesh Malviya and middleman, identified as Preetam Chotrani, were negotiating the bribe amount at her behest.",
        "sentiment": "1 (Negative)",
        "link": "https://timesofindia.indiatimes.com/city/bhopal/Woman-I-T-officer-arrested-by-CBI-in-Bhopal-suspended/articleshow/33083330.cms"
    },
    {
        "title": "BJP leader caught taking Rs 10 lakh bribe",
        "snippet": "bjp leader ganesh malviya and his wife poonam rai a deputy it commissioner were arrested by the cbi on charges of accepting rs10 lakh as bribe from a builder on saturday the builder also from the bjp alleged that malviya was using the bjprsquos state headquarters in bhopal to strike lsquodealsrsquo with influential people caught in the it net.",
        "sentiment": "1 (Negative)",
        "link": "https://inshorts.com/en/news/bjp-leader-caught-taking-rs-10-lakh-bribe"
    },
    {
        "title": "CBI arrests top I-T officer, husband, two others for bribery",
        "snippet": "Bhopal: A deputy commissioner of Income Tax department has been arrested along with her husband, a BJP leader, and two others by CBI here",
        "sentiment": "1 (Negative)",
        "link": "https://www.indiatvnews.com/news/india/cbi-arrests-top-i-t-officer-husband-two-others-for-bribery-34932.html"
    },
    {
        "title": "Income Tax officer, BJP leader held for taking Rs 10 Lakh bribe",
        "snippet": "CBI laid a trap and the bribe amount was allegedly accepted by the middleman at his office",
        "sentiment": "1 (Negative)",
        "link": "https://www.deccanchronicle.com/140330/nation-crime/article/income-tax-officer-bjp-leader-held-taking-rs-10-lakh-bribe"
    },
    {
        "title": "Malviya was collecting fund for Narendra Modi: Opposition leader",
        "snippet": "National election co-convenor of BJP Ganesh Malviya, who was arrested along with his wife deputy commissioner of income tax Poonam Rai by CBI while ac",
        "sentiment": "1 (Negative)",
        "link": "https://timesofindia.indiatimes.com/city/indore/Malviya-was-collecting-fund-for-Narendra-Modi-Opposition-leader/articleshow/33134250.cms"
    },
    {
        "title": "Breaking: CBI traps Modi's man accepting Rs 10 lakh bribe",
        "snippet": "In a big embarrassment to BJP's prime ministerial candidate the CBI on Saturday arrested Ganesh Malviya, the co-convener of Narendra Modi's election cell. ... Poonam Rai, deputy commissioner of income tax, while accepting a bribe of Rs 10 lakh. When CBI laid a trap for Malviya, the agency, ironically, was acting on a complaint of another ...",
        "sentiment": "1 (Negative)",
        "link": "https://aapnewslive.in/breaking-cbi-traps-modis-man-accepting-rs-10-lakh-bribe/"
    },
    {
        "title": "Mumbai: Arif Naseem Khan's Poster Found on Lord Ganesha's Photo in ...",
        "snippet": "A political controversy has erupted in Mumbai ahead of the upcoming Maharashtra assembly elections as BJP leader Amit Malviya shared a video on social media showing a poster of Congress candidate Arif Naseem Khan placed over an image of Lord Ganesha. Malviya criticized the Congress, calling it \"the new Muslim League\" and accusing it of ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.lokmattimes.com/mumbai/mumbai-arif-naseem-khans-poster-found-on-lord-ganeshas-photo-in-chandivali-bjp-calls-it-disrespect-to-hindus-watch-video-a475/"
    },
    {
        "title": "CBI arrests Income Tax officer Poonam Rai, her husband Ganesh Malviya ...",
        "snippet": "CBI arrests Income Tax officer Poonam Rai, her husband Ganesh Malviya for taking Rs 10 lakh bribe. The central bureau of investigation (CBI) has arrested deputy commissioner income tax (IT) Poonam Rai for taking a bribe of Rs 10 lakh. Rai and her husband were caught for taking the money from a builder. She was asking for the money to settle the ...",
        "sentiment": "1 (Negative)",
        "link": "https://ebhopal.blogspot.com/2014/04/cbi-arrests-income-tax-officer-poonam.html"
    },
    {
        "title": "2019 Indian Elections - Interview With Ganesh Malviya",
        "snippet": "Ganesh Malviya Madhya Pradesh.. Photo courtesy of Ganesh Malviya. Q: In the BJP manifesto, the plan is to put an end to Article 370 and 35(A). However, this has seen opposition from a number of leaders in Kashmir, Mehbooba Mufti Sayeed, and Abdullah family. What can you tell us about that?",
        "sentiment": "4 (Positive)",
        "link": "https://axcessnews.com/world/top/2019-indian-elections-interview-with-ganesh-malviya_11164/"
    },
    {
        "title": "Shree Ganesh Apartment in Malviya Nagar, Jaipur | MagicBricks",
        "snippet": "Situated at a prime location of Malviya Nagar, Shree Ganesh Apartment is a meticulously designed project of Jaipur. Shree Ganesh Apartment project is an offering from the well-established developer Shree Ganesh Builders & Developers. The address of this smartly planned project is Diamond Colony, Saraswati Nagar Extension, Malviya Nagar, Jaipur ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.magicbricks.com/shree-ganesh-apartment-malviya-nagar-jaipur-pdpid-4d4235323937343537"
    },
    {
        "title": "CBI arrests top I-T officer, BJP leader Malviya for accepting ... - News18",
        "snippet": "A deputy commissioner of Income Tax department has been arrested along with her husband, a BJP leader, and two others by CBI in Bhopal for allegedly accepting a bribe of Rs 10 lakh from a complainant.",
        "sentiment": "1 (Negative)",
        "link": "https://www.news18.com/news/india/cbi-arrests-top-i-t-officer-bjp-leader-malviya-for-accepting-rs-10-lakh-bribe-677324.html"
    },
    {
        "title": "Top NCV Test Centre Near Me in Malviya Nagar, Delhi | Test Price and ...",
        "snippet": "NCV Test Is Available at Ganesh Diagnostics in Malviya Nagar, Delhi. Book Your Nerve Conduction Velocity Test With the Most Reputed Radiology and Pathology Lab. Check Out Latest Price and Other Details. ... Ganesh Diagnostic & Imaging Centre. 109, Pocket A-1, Near Deepali Chowk, Sector 08, Rohini, New Delhi 110085 Sno. Name Rate Action; Login X ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.ganeshdiagnostic.com/ncv-test-centre-in-malviya-nagar"
    },
    {
        "title": "Top OPG Test Centre in Malviya Nagar, Delhi - ganeshdiagnostic.com",
        "snippet": "If you are searching for OPG Scan in Malviya Nagar. Contact Ganesh Diagnostic and Imaging Centre Today. Our diagnostic services are available 24X7. What Is an Opg Test? OPG Dental Scan is a radio diagnostic imaging technique which is used to see the tooth, jaw and surrounding structures in 2 dimensions.",
        "sentiment": "5 (Positive)",
        "link": "https://www.ganeshdiagnostic.com/opg-test-centre-in-malviya-nagar"
    },
    {
        "title": "Ganesh Malviya Ganesh Profiles - Facebook",
        "snippet": "View the profiles of people named Ganesh Malviya Ganesh. Join Facebook to connect with Ganesh Malviya Ganesh and others you may know. Facebook gives...",
        "sentiment": "3 (Neutral)",
        "link": "https://www.facebook.com/public/Ganesh-Malviya-Ganesh/"
    },
    {
        "title": " Unclaimed Deposit Inoperative Accounts not operated for last 10 years ...",
        "snippet": "125 Sohini Ghosh Flat No. 3, Talbot House, 55 Castle Street, 55 Castle Street, Reading 126 MUJAHID UDDIN C/O JEET SINGH, B-138, SECTOR-92 SECTOR-92 NOIDA",
        "sentiment": "1 (Negative)",
        "link": "https://www.barclays.in/content/dam/barclays-in/documents/information/Unclaimed-Deposit-Inoperative-Account-List.pdf"
    },
    {
        "title": "Cancer Test Centre Near Me in Malviya Nagar, Delhi | Test Price and ...",
        "snippet": "Cancer Test Is Available at Ganesh Diagnostics in Malviya Nagar, Delhi. Book Your Cancer Test With the Most Reputed Diagnostic Centre and Pathology Lab. Check Out Latest Price and Other Details. ... Ganesh Diagnostic & Imaging Centre. 109, Pocket A-1, Near Deepali Chowk, Sector 08, Rohini, New Delhi 110085 Sno. Name Rate Action; Login X ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.ganeshdiagnostic.com/cancer-testing-lab-in-malviya-nagar"
    },
    {
        "title": "How will India's PM Modi navigate the Adani firestorm?",
        "snippet": "When the Hindenburg report was released in January 2023, Adani's market value dropped by more than $100 billion (€93.21 billion), prompting the group to abandon a $2.5-billion stock offering.",
        "sentiment": "1 (Negative)",
        "link": "https://www.dw.com/en/how-will-indias-pm-narendra-modi-handle-the-gautam-adani-bribery-scandal/a-64632399"
    },
    {
        "title": "Ganesh Malviya Profiles - Facebook",
        "snippet": "View the profiles of people named Ganesh Malviya. Join Facebook to connect with Ganesh Malviya and others you may know. Facebook gives people the power...",
        "sentiment": "3 (Neutral)",
        "link": "https://www.facebook.com/public/Ganesh-Malviya/"
    },
    {
        "title": "Ganesh Malviya II Profiles - Facebook",
        "snippet": "View the profiles of people named Ganesh Malviya II. Join Facebook to connect with Ganesh Malviya II and others you may know. Facebook gives people the...",
        "sentiment": "3 (Neutral)",
        "link": "https://www.facebook.com/public/Ganesh-Malviya-II/"
    },
    {
        "title": "Top Diagnostic Centre in Delhi | Radiology & Pathology Lab | Ganesh ...",
        "snippet": "Ganesh Diagnostic is one of the Top Diagnostic Centres and pathology labs in Delhi. We offer a wide range of radiology and pathology testing services with the latest and advanced technology. Free Blood Collection. Appointment. Online Report. Login . 011-47-444-444, 011-47-333-333, +91-9811067479, +91-9810183948 ;",
        "sentiment": "5 (Positive)",
        "link": "https://www.ganeshdiagnostic.com/"
    },
    {
        "title": "Eklavya Team",
        "snippet": "Akaash Malviya Ashok Hanote Baliram Evane Budhram Akhande Dinoo Bhaiyalal Ganesh Keer Hemraj Malviya Jirati Shelu Kavita Babra Khemprakash Yadav Lakhan Kajle Mithlesh Namdeo Monika Uikey Nidesh Soni Prakash Narke Ram Kumar Saroj Rajendra Deshmukh Saroj Verma Shivanti Dhurvey Sunil Hanote Vinayak Rao Magarde. Indore",
        "sentiment": "4 (Positive)",
        "link": "https://eklavya.in/index.php/about-us-eklavya/who-we-are/eklavya-team"
    },
    {
        "title": "Eklavya Team",
        "snippet": "Akaash Malviya Ashok Hanote Baliram Evane Budhram Akhande Dinoo Bhaiyalal Ganesh Keer Hemraj Malviya Jirati Shelu Kavita Babra Khemprakash Yadav Lakhan Kajle Mithlesh Namdeo Monika Uikey Nidesh Soni Prakash Narke Ram Kumar Saroj Rajendra Deshmukh Saroj Verma Shivanti Dhurvey Sunil Hanote Vinayak Rao Magarde. Indore",
        "sentiment": "4 (Positive)",
        "link": "https://eklavya.in/about-us-eklavya/who-we-are/eklavya-team"
    }
]