[
    {
        "title": "BJP leader Ganesh Malviya, I-T officer, others get bail in ... - News18",
        "snippet": "A local court in Bhopal on Tuesday granted bail to Deputy Commissioner of Income Tax Department Poonam Rai, her husband and BJP leader Ganesh Malviya and two others arrested on Friday by CBI for allegedly accepting a bribe of Rs 10 lakh from a builder.",
        "sentiment": "1 (Negative)",
        "link": "https://www.news18.com/news/india/bjp-leader-ganesh-malviya-i-t-officer-others-get-bail-in-bribery-case-677974.html",
        "base_query": "Ganesh Malviya",
        "keyword": "crime"
    },
    {
        "title": "CBI traps Modi's man accepting Rs 10 lakh bribe - m.rediff.com",
        "snippet": "In a big embarrassment to BJP's prime ministerial candidate the CBI on Saturday arrested Ganesh Malviya, the co-convener of Narendra Modi's election cell. He was caught along with his wife, Poonam Rai, deputy commissioner of income tax, while accepting a bribe of Rs 10 lakh. ... Maintaining that other persons were also involved in the crime ...",
        "sentiment": "1 (Negative)",
        "link": "https://m.rediff.com/news/commentary/2014/mar/31/cbi-traps-modis-man-accepting-rs-10-lakh-bribe/1f9041e866a128667408be1929fbe224",
        "base_query": "Ganesh Malviya",
        "keyword": "crime"
    },
    {
        "title": "CBI traps Modi's man accepting Rs 10 lakh bribe - Times of India",
        "snippet": "BHOPAL: In a big embarrassment to BJP's prime ministerial candidate the CBI on Saturday arrested Ganesh Malviya, the co-convener of Narendra Modi's election cell. He was caught along with his wife ...",
        "sentiment": "1 (Negative)",
        "link": "https://timesofindia.indiatimes.com/news/cbi-traps-modis-man-accepting-rs-10-lakh-bribe/articleshow/32933322.cms",
        "base_query": "Ganesh Malviya",
        "keyword": "crime"
    },
    {
        "title": "Bhopal: CBI arrests I-T officer, husband for taking Rs 10 lakh ... - News18",
        "snippet": "On a complaint from the builder, the central agency laid a trap and caught a person, who works with Malviya and had taken Rs 10 lakh from the developer as part of the bribe money, from a Chartered Accountant's office in MP Nagar area. A CBI team accompanied the person to Malviya's residence, from where the BJP leader was apprehended.",
        "sentiment": "1 (Negative)",
        "link": "https://www.news18.com/news/india/it-commissioner-bribe-677226.html",
        "base_query": "Ganesh Malviya",
        "keyword": "crime"
    },
    {
        "title": "Bhopal: IT officer, husband and two others get bail in bribery case",
        "snippet": "A local court here today granted bail to Deputy Commissioner of Income Tax Department Poonam Rai, her husband and BJP leader Ganesh Malviya and two others arrested on Friday by CBI for allegedly ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.ndtv.com/bhopal-news/bhopal-it-officer-husband-and-two-others-get-bail-in-bribery-case-555857",
        "base_query": "Ganesh Malviya",
        "keyword": "crime"
    },
    {
        "title": "CBI arrests top I-T officer, BJP leader Malviya for accepting ... - News18",
        "snippet": "A deputy commissioner of Income Tax department has been arrested along with her husband, a BJP leader, and two others by CBI in Bhopal for allegedly accepting a bribe of Rs 10 lakh from a complainant.",
        "sentiment": "1 (Negative)",
        "link": "https://www.news18.com/news/india/cbi-arrests-top-i-t-officer-bjp-leader-malviya-for-accepting-rs-10-lakh-bribe-677324.html",
        "base_query": "Ganesh Malviya",
        "keyword": "crime"
    },
    {
        "title": "Bhopal: CBI arrests I-T officer, husband for taking Rs 10 lakh bribe",
        "snippet": "CBI ARRESTS A DEPUTY COMMISSIONER OF INCOME TAX AND THREE OTHERS IN AN ALLEGED BRIBERY OF RS.TEN LAKHS. The Central Bureau of Investigation has arrested Poonam Rai, the Deputy Commissioner of Income Tax, and her husband Ganesh Malviya, a BJP leader, and another private person in an alleged bribery case of Rs. 10 Lakhs.",
        "sentiment": "1 (Negative)",
        "link": "https://taxguru.in/income-tax/bhopal-cbi-arrests-officer-husband-rs-10-lakh-bribe.html",
        "base_query": "Ganesh Malviya",
        "keyword": "crime"
    },
    {
        "title": "CBI nabs IT official, husband for bribery in Madhya Pradesh",
        "snippet": "In the intervening night of Friday and Saturday, a Central Bureau of Investigation team from New Delhi arrested Income Tax Deputy Commissioner Poonam Rai and her husband Ganesh Malviya — a ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.thehindu.com/news/national/other-states/cbi-nabs-it-official-husband-for-bribery-in-madhya-pradesh/article5848903.ece",
        "base_query": "Ganesh Malviya",
        "keyword": "crime"
    },
    {
        "title": "I-T targeting me, alleges Bhadoria | Bhopal News - Times of India",
        "snippet": "State BJP leader Rajesh Bhadoria, who got a deputy commissioner of Income Tax department Poonam Rai and her husband Ganesh Malviya arrested by CBI for allegedly taking Rs 10-lakh bribe to settle a ...",
        "sentiment": "1 (Negative)",
        "link": "https://timesofindia.indiatimes.com/City/Bhopal/I-T-targeting-me-alleges-Bhadoria/articleshow/46803419.cms",
        "base_query": "Ganesh Malviya",
        "keyword": "crime"
    },
    {
        "title": "BJP leader, his I-T officer wife held - The Indian Express",
        "snippet": "The CBI arrested deputy commissioner Poonam Rai, an IRS officer of the 2007 batch, and her husband Ganesh Malviya after the first instalment of Rs 10 lakh was paid to a tax consultant and the money was taken to the couple's house in I-T Colony in Bharatnagar late Friday. The couple and two others were remanded in CBI custody for three days on ...",
        "sentiment": "1 (Negative)",
        "link": "https://indianexpress.com/article/political-pulse/bjp-leader-his-i-t-officer-wife-held/",
        "base_query": "Ganesh Malviya",
        "keyword": "crime"
    },
    {
        "title": "2019 Indian Elections - Interview With Ganesh Malviya",
        "snippet": "Ganesh Malviya Madhya Pradesh.. Photo courtesy of Ganesh Malviya. Q: In the BJP manifesto, the plan is to put an end to Article 370 and 35(A). However, this has seen opposition from a number of leaders in Kashmir, Mehbooba Mufti Sayeed, and Abdullah family. What can you tell us about that?",
        "sentiment": "4 (Positive)",
        "link": "https://axcessnews.com/world/top/2019-indian-elections-interview-with-ganesh-malviya_11164/",
        "base_query": "Ganesh Malviya",
        "keyword": "crime"
    },
    {
        "title": "Ganesh Malviya Ganesh Profiles - Facebook",
        "snippet": "View the profiles of people named Ganesh Malviya Ganesh. Join Facebook to connect with Ganesh Malviya Ganesh and others you may know. Facebook gives...",
        "sentiment": "3 (Neutral)",
        "link": "https://www.facebook.com/public/Ganesh-Malviya-Ganesh/",
        "base_query": "Ganesh Malviya",
        "keyword": "crime"
    },
    {
        "title": "Ganesh Malviya Profiles - Facebook",
        "snippet": "View the profiles of people named Ganesh Malviya. Join Facebook to connect with Ganesh Malviya and others you may know. Facebook gives people the power...",
        "sentiment": "3 (Neutral)",
        "link": "https://www.facebook.com/public/Ganesh-Malviya/",
        "base_query": "Ganesh Malviya",
        "keyword": "crime"
    },
    {
        "title": "Top OPG Test Centre in Malviya Nagar, Delhi - ganeshdiagnostic.com",
        "snippet": "If you are searching for OPG Scan in Malviya Nagar. Contact Ganesh Diagnostic and Imaging Centre Today. Our diagnostic services are available 24X7. What Is an Opg Test? OPG Dental Scan is a radio diagnostic imaging technique which is used to see the tooth, jaw and surrounding structures in 2 dimensions.",
        "sentiment": "5 (Positive)",
        "link": "https://www.ganeshdiagnostic.com/opg-test-centre-in-malviya-nagar",
        "base_query": "Ganesh Malviya",
        "keyword": "crime"
    },
    {
        "title": "Top NCV Test Centre in Malviya Nagar, Delhi - ganeshdiagnostic.com",
        "snippet": "NCV Test Is Available at Ganesh Diagnostics in Malviya Nagar, Delhi. Book Your Nerve Conduction Velocity Test With the Most Reputed Radiology and Pathology Lab. Check Out Latest Price and Other Details. ... Ganesh Diagnostic & Imaging Centre. 109, Pocket A-1, Near Deepali Chowk, Sector 08, Rohini, New Delhi 110085 Sno. Name Rate Action; Login X ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.ganeshdiagnostic.com/ncv-test-centre-in-malviya-nagar",
        "base_query": "Ganesh Malviya",
        "keyword": "crime"
    },
    {
        "title": "Ganesh Malviya Malviya Profiles - Facebook",
        "snippet": "View the profiles of people named Ganesh Malviya Malviya. Join Facebook to connect with Ganesh Malviya Malviya and others you may know. Facebook gives...",
        "sentiment": "3 (Neutral)",
        "link": "https://www.facebook.com/public/Ganesh-Malviya-Malviya/",
        "base_query": "Ganesh Malviya",
        "keyword": "crime"
    },
    {
        "title": "Ganesh Malviya Ganesh Malvi Profiles - Facebook",
        "snippet": "View the profiles of people named Ganesh Malviya Ganesh Malvi. Join Facebook to connect with Ganesh Malviya Ganesh Malvi and others you may know....",
        "sentiment": "3 (Neutral)",
        "link": "https://www.facebook.com/public/Ganesh-Malviya-Ganesh-Malvi/",
        "base_query": "Ganesh Malviya",
        "keyword": "crime"
    },
    {
        "title": "Best Diagnostic Centre in Malviya Nagar, Delhi",
        "snippet": "Ganesh Diagnostic is the reliable and best Diagnostic centre in Malviya Nagar for all your Diagnostic tests under one roof, PET Scan, Ultrasound, MRI, CT Scan, X-Ray and much more. Check Out Latest Price & Other Details.. ... Ganesh Diagnostic & Imaging Centre. 109, Pocket A-1, Near Deepali Chowk, Sector 08, Rohini, New Delhi 110085 Sno. Name ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.ganeshdiagnostic.com/diagnostic-centre-in-malviya-nagar",
        "base_query": "Ganesh Malviya",
        "keyword": "crime"
    },
    {
        "title": "Cancer Test Centre Near Me in Malviya Nagar, Delhi | Test Price and ...",
        "snippet": "Cancer Test Is Available at Ganesh Diagnostics in Malviya Nagar, Delhi. Book Your Cancer Test With the Most Reputed Diagnostic Centre and Pathology Lab. Check Out Latest Price and Other Details. ... Ganesh Diagnostic & Imaging Centre. 109, Pocket A-1, Near Deepali Chowk, Sector 08, Rohini, New Delhi 110085 Sno. Name Rate Action; Login X ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.ganeshdiagnostic.com/cancer-testing-lab-in-malviya-nagar",
        "base_query": "Ganesh Malviya",
        "keyword": "crime"
    },
    {
        "title": "CBI nabs I-T officer for asking bribe worth Rs 10 lakh from builder",
        "snippet": "The official, Poonam Rai, is a 2007-batch officer of Indian Revenue Service (IRS), and her husband Ganesh Malviya is a convener in the BJP's election cell, CBI authorities said. The CBI conducted the raid on Friday night and nabbed two other persons, including a chartered accountant.",
        "sentiment": "1 (Negative)",
        "link": "https://www.indiatoday.in/india/story/income-tax-officer-poonam-rai-deputy-commissioner-arrested-cbi-r-s-bhadoria-186785-2014-03-29",
        "base_query": "Ganesh Malviya",
        "keyword": "crime"
    },
    {
        "title": "Ganesh Kumar Malviya Profiles - Facebook",
        "snippet": "View the profiles of people named Ganesh Kumar Malviya. Join Facebook to connect with Ganesh Kumar Malviya and others you may know. Facebook gives people...",
        "sentiment": "3 (Neutral)",
        "link": "https://www.facebook.com/public/Ganesh-Kumar-Malviya/",
        "base_query": "Ganesh Malviya",
        "keyword": "crime"
    },
    {
        "title": "Top Diabetes Test Labs in Malviya Nagar, Delhi - ganeshdiagnostic.com",
        "snippet": "Diabetes Test Is Available at Ganesh Diagnostics in Malviya Nagar, Delhi. Book Your Diabetes Test With the Most Reputed Diagnostic Centre and Pathology Lab. Check Out Latest Price and Other Details. ... Ganesh Diagnostic & Imaging Centre. 109, Pocket A-1, Near Deepali Chowk, Sector 08, Rohini, New Delhi 110085 Sno. Name Rate Action; Login X ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.ganeshdiagnostic.com/diabetes-test-centre-in-malviya-nagar",
        "base_query": "Ganesh Malviya",
        "keyword": "crime"
    },
    {
        "title": "Ganesh Malviya II Profiles - Facebook",
        "snippet": "View the profiles of people named Ganesh Malviya II. Join Facebook to connect with Ganesh Malviya II and others you may know. Facebook gives people the...",
        "sentiment": "3 (Neutral)",
        "link": "https://www.facebook.com/public/Ganesh-Malviya-II/",
        "base_query": "Ganesh Malviya",
        "keyword": "crime"
    },
    {
        "title": "Ganesh Malviya Kerli Profiles - Facebook",
        "snippet": "View the profiles of people named Ganesh Malviya Kerli. Join Facebook to connect with Ganesh Malviya Kerli and others you may know. Facebook gives people...",
        "sentiment": "3 (Neutral)",
        "link": "https://www.facebook.com/public/Ganesh-Malviya-Kerli/",
        "base_query": "Ganesh Malviya",
        "keyword": "crime"
    }
]