[
    {
        "title": "List of railway accidents and incidents in India - Wikipedia",
        "snippet": "As per the Ministry of Railways, there have been more than 38,500 railway accidents from 1961 to 2019. [2] In 2019-20, the Indian Railways reported zero passenger deaths due to accidents for the first time in its history. [3] At least 313 people died in 40 train accidents in 2023-24 and 748 people have died in 638 train accidents in the previous ten years.",
        "sentiment": "1 (Negative)",
        "link": "https://en.wikipedia.org/wiki/List_of_railway_accidents_and_incidents_in_India"
    },
    {
        "title": "2023 Odisha train collision - Wikipedia",
        "snippet": "Members of the National Disaster Response Force on the site. Indian Railways published the reservation charts for both the passenger trains on its website. [‡ 1] [‡ 2] The railways and the governments of Odisha, West Bengal and Tamil Nadu issued helpline numbers.[12] [13] According to the Chief Secretary of Odisha, three National Disaster Response Force (NDRF) units, four Odisha Disaster ...",
        "sentiment": "1 (Negative)",
        "link": "https://en.wikipedia.org/wiki/2023_Odisha_train_collision"
    },
    {
        "title": "India train crash kills over 280, injures 900 in one of nation's worst ...",
        "snippet": "Rescuers work at the site of passenger trains accident, in Balasore district, in the eastern Indian state of Orissa, Saturday, June 3, 2023. Rescuers are wading through piles of debris and wreckage to pull out bodies and free people after two passenger trains derailed in India, killing more than 280 people. ... India train crash kills over 280 ...",
        "sentiment": "1 (Negative)",
        "link": "https://apnews.com/article/india-passenger-train-derail-deadly-accident-dceafe2a5fe9c287f2ebd8b6cce37f93"
    },
    {
        "title": "India train crash: More than 260 dead after Odisha accident",
        "snippet": "At least 261 people have been killed and 1,000 are injured in a crash involving three trains in India's eastern Odisha state. One passenger train derailed on to the adjacent track and was struck ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.bbc.co.uk/news/world-asia-india-65793257"
    },
    {
        "title": "Error in signaling system led to train crash that killed 275 people in ...",
        "snippet": "5 of 20 | . A person shows photo of his relative who was traveling in the train that derailed while looking for him at the site of the accident, in Balasore district, in the eastern Indian state of Orissa, Sunday, June 4, 2023.",
        "sentiment": "1 (Negative)",
        "link": "https://apnews.com/article/india-passenger-train-derail-deadly-accident-dd0c82012f9e14016b58d09eb3adec2d"
    },
    {
        "title": "India train disaster: What we know so far | News | Al Jazeera",
        "snippet": "Indian Railways, a state monopoly, operate the network, which consists of 64,000km (40,000 miles) of track. ... India's deadliest railway accident was in 1981, when a train plunged off a bridge ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.aljazeera.com/news/2023/6/4/india-train-disaster-what-we-know-so-far"
    },
    {
        "title": "India train crash: More than 260 dead after Odisha accident - BBC",
        "snippet": "At least 261 people have been killed and 1,000 are injured in a crash involving three trains in India's eastern Odisha state. One passenger train derailed on to the adjacent track and was struck ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.bbc.com/news/world-asia-india-65793257"
    },
    {
        "title": "India train disaster: Signal fault the likely cause, minister says - BBC",
        "snippet": "A report into India's worst rail accident this century is due later. ... Smog causes travel chaos in Indian capital Delhi. 22 hrs ago. Asia. Glory to gloom: The fall of India's Test cricket supremacy.",
        "sentiment": "1 (Negative)",
        "link": "https://www.bbc.com/news/world-asia-india-65801807"
    },
    {
        "title": "India blames train crash on signal failure as death toll nears 300",
        "snippet": "The crash killed at least 275 people and injured more than 800, making it India's worst railway accident in more than two decades. The rescue operation had been completed on Sunday evening ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.ft.com/content/c4f7d877-2e6c-4587-b3c7-80459acf5cce"
    },
    {
        "title": "Railway accident data (2019-2024) - INSIGHTS IAS",
        "snippet": "Context: Over the past five years, 351 persons were killed and 970 injured in 200 consequential railway accidents, data shared by the Indian Railways from 17 railway zones reveal. Key data points: [Source: Indian Railways] 351 persons killed and 970 injured in 200 consequential railway accidents. Compensation of ₹32 crore distributed (₹26.83 crore to next … Continue reading \"Railway ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.insightsonindia.com/2024/10/03/railway-accident-data-2019-2024/"
    },
    {
        "title": "Odisha train tragedy Highlights: Railway Ministry ... - The Indian Express",
        "snippet": "Odisha Coromandel Express train accident Highlights: The root cause of the accident has been identified and the affected tracks will be restored for normal services by Wednesday, Railway Minister Ashwini Vaishnaw said on Sunday. ... The report — Performance Audit on Derailment in Indian Railways — was tabled in Parliament in December 2022 ...",
        "sentiment": "1 (Negative)",
        "link": "https://indianexpress.com/article/india/coromandel-express-accident-odisha-balasore-deaths-injured-live-updates-8642911/"
    },
    {
        "title": "Increase in train accidents worries Indian Railways - The Hindu",
        "snippet": "Increase in train accidents worries Indian Railways Manpower shortages are causing many loco pilots to work long hours, beyond the 12 hours per day maximum, often without leave or rest; Railway ...",
        "sentiment": "2 (Negative)",
        "link": "https://www.thehindu.com/news/national/increase-in-train-accidents-worries-indian-railways/article66915585.ece"
    },
    {
        "title": "Railway Accidents in India: Causes and Safety Measures",
        "snippet": "The Indian Railways is one of the largest railway networks in the world, with millions of people relying on it for transportation every day. Statistics show that over the last two decades, the number of derailments which constitute the majority of accidents has drastically declined from around 350 per year around the turn of the millennium, to 22 in 2021-22.",
        "sentiment": "2 (Negative)",
        "link": "https://www.drishtiias.com/daily-updates/daily-news-editorials/railway-accidents-in-india-causes-and-safety-measures"
    },
    {
        "title": "India train crash: What we know about the deadly collision in Odisha - Vox",
        "snippet": "A railway accident in the Indian state of Odisha on Friday has killed at least 275 people and injured more than 1,000 — the latest such tragedy to occur in a nation where trains are widely used ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.vox.com/2023/6/3/23747817/india-deadly-train-collision-crash"
    },
    {
        "title": "A look at deadly train crashes in India in recent decades",
        "snippet": "NEW DELHI (AP) — The latest deadly train crash in India happened Friday, when two passenger trains derailed — killing more than 200 people, ... Rescuers work at the site of passenger trains accident, in Balasore district, in the eastern Indian state of Orissa, Saturday, June 3, 2023. Two passenger trains derailed in India, killing more than ...",
        "sentiment": "1 (Negative)",
        "link": "https://apnews.com/article/india-train-crashes-deaths-history-f2ddd925a5b86f317a8f4eff23e6e81e"
    },
    {
        "title": "Balasore: How did three trains collide in Odisha? - BBC",
        "snippet": "A devastating crash involving three trains in the eastern Indian state of Odisha has killed 275 people and left more than 1,000 injured, many of them seriously. The cause of the crash, which is ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.bbc.com/news/world-asia-india-65796173"
    },
    {
        "title": "How the train crash in eastern India unfolded - reuters.com",
        "snippet": "Graphic shows the number of deaths and injuries in Indian railway accidents annually since 2001. The numbers are the highest in 2023. Note: 2023 data based on news reports and as of June 8.",
        "sentiment": "1 (Negative)",
        "link": "https://www.reuters.com/graphics/INDIA-CRASH/RAIL-INVESTIGATION/dwvkdwnbkpm/"
    },
    {
        "title": "Indian Railway Accidents and Related Laws (Simplified)",
        "snippet": "Indian Railways, one of the world's largest railway networks, has encountered various controversies over the years. Some of the notable controversies include: Safety Concerns: Safety has been a significant issue for Indian Railways, with frequent accidents and derailments. Concerns about the ageing infrastructure, lack of maintenance, and need ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.legalserviceindia.com/legal/legal/article-17828-indian-railway-accidents-and-related-laws-simplified-.html"
    },
    {
        "title": "Cause of Indian train crash that killed hundreds remains unknown as ...",
        "snippet": "NEW DELHI, India —Rescuers ended a search for survivors as the death toll from a train crash that killed almost 300 people and injured hundreds more in one of the worst rail disasters in India's ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.nbcnews.com/news/world/hundreds-killed-indian-train-crash-officials-say-rescue-efforts-comple-rcna87555"
    },
    {
        "title": "India train crash death toll rises above 230 with 900 injured as ...",
        "snippet": "Two passenger trains have derailed in India, killing more than 230 people and trapping hundreds of others inside more than a dozen damaged rail cars. The accident, which happened Friday night about 137 miles southwest of Kolkata, created a chaotic scene of twisted wreckage as rescue teams desperately tried to free passengers and recover bodies. The cause was under investigation. The death toll ...",
        "sentiment": "1 (Negative)",
        "link": "https://apnews.com/article/india-train-derailment-odisha-f272d8811ed7826ea2fb110b8eb26441"
    },
    {
        "title": "Does Indian Railways provide compensation for natural deaths on trains ...",
        "snippet": "When a death happens due to an accident on a train, Indian Railways typically offers compensation to the victim's family. Image Source : PTI. 5/9.",
        "sentiment": "2 (Negative)",
        "link": "https://www.indiatvnews.com/photos/india-indian-railways-compensation-natural-death-rules-accidents-2025-01-15-971424"
    },
    {
        "title": "Kavach (train protection system) - Wikipedia",
        "snippet": "KAVACH (lit. ' Armour ') is an Automatic Train Protection (ATP) system indigenously developed by Research Designs & Standards Organisation (RDSO) in collaboration with Medha Servo Drives, Kernex Microsystems and HBL Power Systems. [1] [2] Initially it was known by the name Train Collision Avoidance System (TCAS). [3]Kavach was adopted by Ministry of Railways as the National ATP System in July ...",
        "sentiment": "4 (Positive)",
        "link": "https://en.wikipedia.org/wiki/Kavach_(train_protection_system)"
    },
    {
        "title": "Odisha train accident: Deadly India crash recovery operation in ... - BBC",
        "snippet": "A recovery operation is under way in India after hundreds of people were killed or injured in a three-train crash in the eastern Odisha state. The crash took place on Friday evening, after the ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.bbc.com/news/world-asia-india-65795958"
    },
    {
        "title": "Indian Railways reports 29 train accidents in 8 months; Govt cites ...",
        "snippet": "A total of 29 train accidents occurred in the ongoing financial year up to November 26, resulting in 17 fatalities and 71 injuries. The information was shared by Union Railways Minister Ashwini ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.financialexpress.com/business/railways-indian-railways-reports-29-train-accidents-in-8-months-govt-cites-equipment-failures-sabotage-as-key-causes-3683452/"
    },
    {
        "title": "2004 Sri Lanka tsunami train wreck - Wikipedia",
        "snippet": "The 2004 Sri Lanka tsunami train wreck is the largest single rail disaster in world history by death toll, with 1,000 fatalities or more.It occurred when a crowded passenger train (No 50, Matara Express) was destroyed on a coastal railway in Sri Lanka by a tsunami that followed the 2004 Indian Ocean earthquake.The tsunami subsequently caused over 30,000 reported deaths and billions of rupees ...",
        "sentiment": "1 (Negative)",
        "link": "https://en.wikipedia.org/wiki/2004_Sri_Lanka_tsunami_train_wreck"
    },
    {
        "title": "Drone footage shows extent of India train crash destruction",
        "snippet": "Footage filmed in the daylight has revealed the extent of damage in the wake of a train collision in the Indian state of Odisha. At least 260 people have been killed and 650 are injured, with ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.bbc.co.uk/news/av/world-asia-india-65796254"
    },
    {
        "title": "2024 West Bengal train collision - Wikipedia",
        "snippet": "On 17 June 2024, Kanchanjunga Express (Train No. 13174), a passenger train was traveling from Agartala in Tripura to Sealdah in West Bengal.The train had left New Jalpaiguri Junction, crossed Rangapani railway station, a non-stopping station at 8:27 IST and stopped some distance before the Chatterhat railway station on the Katihar-Siliguri line, waiting for clearance to proceed further.",
        "sentiment": "1 (Negative)",
        "link": "https://en.wikipedia.org/wiki/2024_West_Bengal_train_collision"
    },
    {
        "title": "How Safe Is India's Railway Network? | TIME",
        "snippet": "In February, Hari Shankar Verma, a railways manager, wrote a letter to the government about a \"serious unsafe\" train incident that occurred at the Hosadurga Road Station in the south Indian ...",
        "sentiment": "2 (Negative)",
        "link": "https://time.com/6284837/india-train-accident-odisha-railway-safety/"
    },
    {
        "title": "Railway Accidents and Kavach System - दृष्टि आईएएस",
        "snippet": "Despite recent accidents, Indian railways maintain a strong safety record compared to international standards. In 2022, IR recorded 0.03 significant accidents per million train km, significantly lower than the 0.39 per million train km average across 35 countries. United Kingdom: The UK has one of the lowest rates of train accidents in Europe.",
        "sentiment": "1 (Negative)",
        "link": "https://www.drishtiias.com/daily-updates/daily-news-analysis/railway-accidents-and-kavach-system"
    },
    {
        "title": "India passenger train derailment leaves over 280 dead, 900 injured - NPR",
        "snippet": "A drone shot of rescuers work at the site of passenger trains accident, in Balasore district, in the eastern Indian state of Orissa, on Saturday. Arabinda Mahapatra/AP hide caption",
        "sentiment": "1 (Negative)",
        "link": "https://www.npr.org/2023/06/02/1179865254/india-train-derailment"
    },
    {
        "title": "Chandigarh-Dibrugarh Express Accident: Multiple Coaches ... - Zee News",
        "snippet": "Chandigarh-Dibrugarh Express Accident: In another tragic incident, around six coaches of Chandigarh-Dibrugarh Express derailed near Gonda in Uttar Pradesh.Three people died in the accident while 30 passengers are said to be injured. Earlier, the railways confirmed two deaths but later a seriously injured passenger succumbed to the injury.",
        "sentiment": "1 (Negative)",
        "link": "https://zeenews.india.com/railways/live-chandigarh-dibrugarh-express-accident-multiple-coaches-derailed-near-gonda-rescue-operations-underway-2767819.html"
    },
    {
        "title": "Probe into deadly India train crash focuses on signal failure, as ...",
        "snippet": "Jaya Varma Sinha, an Indian railways ministry official, said on Sunday that the high speed of the Coromandel Express colliding into the goods train, which was carrying iron ore, had contributed to ...",
        "sentiment": "1 (Negative)",
        "link": "https://edition.cnn.com/2023/06/04/asia/india-train-crash-focus-on-clearing-tracks-intl-hnk/index.html"
    },
    {
        "title": "The Issue of Indian Railway Safety- Explained Pointwise - Free UPSC IAS ...",
        "snippet": "The Issue of Indian Railway safety is again under scrutiny with the recent incident of freight train ramming into a passenger train, near Siliguri in West Bengal, which left at least nine people dead and more than 40 injured.Last year, the tragic Balasore train accident also highlighted the grim situation of railway safety prevailing in the country. . These accidents highlight the urgent need ...",
        "sentiment": "1 (Negative)",
        "link": "https://forumias.com/blog/the-issue-of-indian-railway-safety/"
    },
    {
        "title": "Indian Railways: Massive decline in train accidents after ...",
        "snippet": "According to Railway Minister Ashwini Vaishnaw's written reply in Lok Sabha, the number of train accidents has decreased dramatically from 135 in 2014-15 to just 40 in 2023-24.",
        "sentiment": "1 (Negative)",
        "link": "https://www.financialexpress.com/business/railways-indian-railways-massive-decline-in-train-accidents-after-implementation-of-kavach-and-other-enhanced-safety-measures-claims-ashwini-vaishnaw-3678921/"
    },
    {
        "title": "Nearly 300 killed in one of India's deadliest train accidents",
        "snippet": "Nearly 300 killed in train wreck in India 01:33. At least 288 people have been killed and more than 850 others injured in a train accident involving three trains in India's eastern state of Odisha ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.cbsnews.com/news/india-train-derailment-300-killed-in-one-of-the-deadliest-train-accidents/"
    },
    {
        "title": "Indian Railway Accident Insurance Rules : रेल्वेनं प्रवास करताना अचानक ...",
        "snippet": "Indian Railway Accident Insurance Rules : भारतात ट्रेननं प्रवास करणाऱ्या लोकांची संख्या खूप जास्त आहे.कारण ट्रेननं प्रवास करणं हे खूप सुरक्षित, स्वस्त आणि आरामदायक वाटतं.",
        "sentiment": "2 (Negative)",
        "link": "https://zeenews.india.com/marathi/india/indian-railway-accident-insurance-rules-know-in-detail/876251"
    },
    {
        "title": "Indian Railways News - Major Accidents/Disruptions",
        "snippet": "It also hosts a Centralized Database of Indian Railways Trains & Stations, and provides crowd-sourced IRCTC Train Enquiry Services. ... Major Accidents/Disruptions. NCR/North Central. 44 views. 0. Entry# 6404337 Past Edits. Jan 08 2025 (23:51) Station Tag: Prayagraj Junction (Allahabad)/PRYJ added by AdittyaaSharma^~/1421836.",
        "sentiment": "1 (Negative)",
        "link": "https://indiarailinfo.com/news/cat/2"
    },
    {
        "title": "Yet another train derailment: How 2024 has been disastrous ... - Firstpost",
        "snippet": "On Tuesday morning, 18 coaches of the Mumbai-Howrah Mail derailed in Jharkhand's Seraikela-Kharsawan district, killing two people and injuring 20 others. Train derailments, signal failures, collisions, and other accidents have dominated headlines recently. In the first half of 2024, seven major rail accidents have occurred, four of them derailments",
        "sentiment": "1 (Negative)",
        "link": "https://www.firstpost.com/explainers/how-2024-has-been-disastrous-for-the-indian-railways-so-far-13798642.html"
    },
    {
        "title": "Odisha train accident: Indian Railways seek police probe into ... - BBC",
        "snippet": "At least 275 people died in the accident and over 1,100 passengers were injured India's railway ministry has recommended that the country's top detective agency should investigate the deadly crash ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.bbc.com/news/world-asia-india-65785140"
    },
    {
        "title": "Kanchanjungha Express train accident June 17 highlights: Goods train ...",
        "snippet": "Nothing focuses the nation's collective attention on the Indian Railways as a major accident. The triple train collision at Bahanaga Bazar railway station, near Balasore in Odisha on June 2 ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.thehindu.com/news/national/kanchanjungha-express-train-accident-highlights-goods-train-west-bengal-new-jalpaiguri/article68299231.ece"
    },
    {
        "title": "RiyaGarg1999/Indian-Railway-Accidents-Dashboard - GitHub",
        "snippet": "The Indian Railway Accidents Dashboard is a comprehensive tool designed to analyze and visualize data on railway accidents in India. The dashboard aims to enhance decision-making and improve user experience by providing interactive charts and real-time updates. This project is part of my training work at the Centre for Railway Information ...",
        "sentiment": "4 (Positive)",
        "link": "https://github.com/RiyaGarg1999/Indian-Railway-Accidents-Dashboard"
    },
    {
        "title": "India train disaster: Signal fault the likely cause, minister says - BBC",
        "snippet": "A report into India's worst rail accident this century is due later. Meanwhile the death toll has been revised down to 275 after some bodies were counted twice, officials said.",
        "sentiment": "1 (Negative)",
        "link": "https://www.bbc.co.uk/news/world-asia-india-65801807"
    },
    {
        "title": "Bihar: Railway worker crushed to death while decoupling engine and ...",
        "snippet": "The incident took place on Saturday when Amar Kumar Raut was decoupling the engine of Lucknow-Barauni Express (Train No: 15204) after its termination at the Barauni Junction. During the decoupling process, the train driver unexpectedly reversed the engine, resulting in Amar getting trapped. The railway official died on the spot.",
        "sentiment": "1 (Negative)",
        "link": "https://www.indiatoday.in/india/story/bihar-railway-official-gets-trapped-between-engine-coach-dies-begusarai-barauni-lucknow-barauni-express-2630894-2024-11-09"
    },
    {
        "title": "Bihar train derailment - Wikipedia",
        "snippet": "In the Indian state of Bihar, on June 6, 1981, a passenger train carrying more than 800 passengers [1] between Mansi (Dhamara Pul) and Saharsa, derailed while crossing a bridge and plunged into the river Bagmati.. After five days, more than 200 bodies were recovered, with hundreds more missing that were feared washed away by the river. [1] [2] Estimates of total deaths range from 500 to 800 or ...",
        "sentiment": "1 (Negative)",
        "link": "https://en.wikipedia.org/wiki/Bihar_train_derailment"
    }
]