[
    {
        "title": "MP SCAMS - The Economic Times",
        "snippet": "Congress MP Digvijaya Singh urges PM Narendra Modi to initiate a probe by a sitting High Court judge into corruption in Madhya Pradesh Transport Department after substantial assets were seized from a former constable. Singh also calls for ED intervention under the Prevention of Money Laundering Act. 24 Dec, 2024, 09:58 PM IST",
        "sentiment": "1 (Negative)",
        "link": "https://economictimes.indiatimes.com/topic/mp-scams"
    },
    {
        "title": "Bhopal Drug Bust: MP Congress Alleges Deputy CM's Close Aide Involved ...",
        "snippet": "ALSO READ | Madhya Pradesh: ATS, NCB Bust Bhopal Drug Factory, Seize Rs 1,800 Crore Worth of Drugs; 2 Arrested Madhya Pradesh Congress Rejects BJP's 'Coincidence' Claim. Referring to the alleged relationship between Devda and the drug racket's kingpin, Patwari rejected the BJP's defence that photographs of the two together were mere coincidences.",
        "sentiment": "1 (Negative)",
        "link": "https://news.abplive.com/cities/bhopal-drug-bust-mp-congress-jitendra-patwari-alleges-deputy-cm-jagdish-devda-close-aide-involved-in-racket-questions-cm-mohan-yadav-pm-modi-1723695"
    },
    {
        "title": "Madhya Pradesh: Congress seeks Dy CM's resignation over drug bust",
        "snippet": "\"If PM Narendra Modi or his party is really against drug menace, then the MP Deputy CM Jagdish Devda should be asked to resign,\" Patwari demanded while interacting with mediapersons at the ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.newindianexpress.com/nation/2024/Oct/12/madhya-pradesh-congress-seeks-dy-cms-resignation-over-drug-bust"
    },
    {
        "title": "Bhopal drug bust: Congress accuses deputy CM of close links with ...",
        "snippet": "The opposition party demanded Jagdish Devda's resignation alleging that he has links with the kingpin of the drug racket busted recently in Madhya Pradesh.",
        "sentiment": "1 (Negative)",
        "link": "https://www.hindustantimes.com/india-news/bhopal-drug-bust-congress-accuses-deputy-cm-of-close-links-with-kingpin-questions-pm-modis-silence-101728649220051.html"
    },
    {
        "title": "Congress questions PM Modi's 'silence' over 'growing drug trade' in MP ...",
        "snippet": "Congress alleges a close associate of Madhya Pradesh Deputy CM Jagdish Devda is involved in drug trade following a major drug haul in Bhopal. They criticize PM Modi's silence on the issue and highlight the worsening drug addiction problem, purportedly affecting 40 crore people in India.",
        "sentiment": "1 (Negative)",
        "link": "https://economictimes.indiatimes.com/news/politics-and-nation/congress-questions-pm-modis-silence-over-growing-drug-trade-in-mp-slams-bjp/articleshow/114150334.cms"
    },
    {
        "title": "Jagdish Devda - Wikipedia",
        "snippet": "Jagdish Devda is an Indian politician from the Bharatiya Janata Party currently serving as the deputy chief minister of Madhya Pradesh. He is representing Malhargarh Assembly constituency as an MLA for the 6th time in Madhya Pradesh Legislative Assembly. [1] Early life",
        "sentiment": "4 (Positive)",
        "link": "https://en.wikipedia.org/wiki/Jagdish_Devda"
    },
    {
        "title": "Congress accuses MP deputy CM of close links with drug ... - The Week",
        "snippet": "New Delhi, Oct 11 (PTI) Days after a massive drug haul from a factory on the outskirts of Bhopal, the Congress on Friday alleged that a close associate of Madhya Pradesh Deputy Chief Minister Jagdish Devda is involved in drug trade in the state and questioned Prime Minister Narendra Modi's \"silence\" on the issue.",
        "sentiment": "1 (Negative)",
        "link": "https://www.theweek.in/wire-updates/national/2024/10/11/del44-cong-mp-ld-drugs.html"
    },
    {
        "title": "Congress Demands Deputy CM Jagdish Devda's Resignation; Cites His Links ...",
        "snippet": "Bhopal (Madhya Pradesh): The Congress party on Monday sought resignation of deputy chief minister Jagdish Devda claiming he was close to an arrested accused in the case related to seizure of ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.freepressjournal.in/bhopal/congress-demands-deputy-cm-jagdish-devdas-resignation-cites-his-links-with-drug-factory-operators"
    },
    {
        "title": "Political Controversy in MP: Drug Case Links Deputy Chief Minister",
        "snippet": "The Congress party has called for the resignation of Madhya Pradesh Deputy Chief Minister Jagdish Devda, alleging his close connection to a suspect linked to a massive mephedrone drug haul conducted by Gujarat ATS and NCB. The incident has sparked political contention, underscoring alleged ties within the ruling BJP party.",
        "sentiment": "1 (Negative)",
        "link": "https://www.devdiscourse.com/article/politics/3113299-political-controversy-in-mp-drug-case-links-deputy-chief-minister"
    },
    {
        "title": "jagdish devda madhya-pradesh malhargarh candidate Profile,Candidates ...",
        "snippet": "jagdish devda madhya-pradesh malhargarh candidate : jagdish devda madhya-pradesh malhargarh candidate Candidates Net Worth, Education, Property and Family Background Affidavit Submitted To ECI Latest News at ABP न्यूज़ | ABPLive ... BJP MP Says 'Apology Not Accepted' India 'Chairman Biggest Disruptor In House': Kharge On No ...",
        "sentiment": "1 (Negative)",
        "link": "https://news.abplive.com/elections/jagdish-devda-madhya-pradesh-malhargarh-candidate-profile.html"
    },
    {
        "title": "Jagdish Devda(Bharatiya Janata Party(BJP)):Constituency ... - MyNeta",
        "snippet": "JAGDISH DEVDA (Winner) ... Party:BJP . S/o|D/o|W/o: Late. Gendalal Ji Devda . Age: 66 . Name Enrolled as Voter in: 224 Mandsour (Madhya Pradesh) constituency, at Serial no 1104 in Part no 56 . Self Profession:Salary and Rent Received as a Minister in Madhya ... increased misuse of money in elections so as to facilitate a system of transparency ...",
        "sentiment": "1 (Negative)",
        "link": "https://myneta.info/MadhyaPradesh2023/candidate.php?candidate_id=531"
    },
    {
        "title": "Meet the two new deputy CMs in MP: Jagdish Devda and Rajendra Shukla ...",
        "snippet": "He has also served as the Speaker of the Madhya Pradesh Assembly from March 24, 2020 to July 2, 2020.. As finance minister, Devda presented the state's first paperless budget with a focus on women's welfare with an outlay of Rs 8,000 crore for the \"game changing\" Ladli Behna Yojana.. Devda is also known to be a keen sportsperson and was an athletics champion in his youth.",
        "sentiment": "4 (Positive)",
        "link": "https://indianexpress.com/article/political-pulse/meet-the-two-new-deputy-cms-in-mp-jagdish-devda-and-rajendra-shukla-who-rose-up-the-bjp-ranks-9065616/"
    },
    {
        "title": "MP Budget FY25: Key takeaways from Finance Minister Jagdish Devda ...",
        "snippet": "Here are the key takeaways from MP Budget 2024-25 presented by Finance Minister Jagdish Devda A Provision of Rs 26,560 crore for women and child development in the Madhya Pradesh Budget for 2024-25.",
        "sentiment": "4 (Positive)",
        "link": "https://www.financialexpress.com/policy/economy-mp-budget-2024-25-key-takeaways-from-finance-minister-jagdish-devda-speech-in-madhya-pradesh-assembly-3542426/"
    },
    {
        "title": "Jagdish Devda Wiki, Age, Caste, Wife, Family, Biography & More",
        "snippet": "Jagdish Devda is an Indian lawyer and politician. He became the Deputy Chief Minister of Madhya Pradesh in the Bharatiya Janata Party (BJP) government on 11 ... (BJP) government on 11 December 2023. Devda is known for representing the Malhargarh Assembly constituency for eight consecutive terms. He briefly served as the temporary Speaker of the ...",
        "sentiment": "4 (Positive)",
        "link": "https://wikibio.in/jagdish-devda/"
    },
    {
        "title": "Dozens charged in Atlanta-based money laundering operation that ...",
        "snippet": "Federal agents have arrested twenty-four individuals for their involvement in a large-scale fraud and money laundering operation that targeted citizens, corporations, and financial institutions throughout the United States. Business email compromise schemes, romance fraud scams, and retirement account scams, among other frauds, duped numerous victims into losing more than $30",
        "sentiment": "1 (Negative)",
        "link": "https://www.justice.gov/usao-ndga/pr/dozens-charged-atlanta-based-money-laundering-operation-funneled-30-million-proceeds"
    },
    {
        "title": "BJP picks Jagdish Devda, Rajendra Shukla to be new Deputy chief ...",
        "snippet": "Jagdish Devda The party's candidate from Malhargath, Jagdish Devda won in the state assembly elections 2023 by a margin of 59,024 votes, defeating independent candidate Shyamlal Jokchand. Devda has been serving as Malhargarh MLA since 2008. He won three consecutive terms in 2008, 2013, and 2018.",
        "sentiment": "1 (Negative)",
        "link": "https://www.cnbctv18.com/politics/bjp-picks-jagdish-devda-rajendra-shukla-to-be-new-deputy-chief-ministers-of-madhya-pradesh-18539261.htm"
    },
    {
        "title": "Jagdish _ Devda - India Leader",
        "snippet": "Jagdish Devda, representing the BJP in the Malhargarh constituency, emerges as a stalwart leader with a rich blend of education, professional experience, and political acumen. His commitment to public service and governance makes him a formidable candidate in the Madhya Pradesh 2023 elections.",
        "sentiment": "4 (Positive)",
        "link": "https://www.indialeader.com/ViewLeader/47118/"
    },
    {
        "title": "Modi-Shah are grandfathers of corruption: TMC lists A to Z of BJP scams",
        "snippet": "From Bihar CM Nitish Kumar's 'Srinjan scam' to Textiles Minister Smriti Irani's 'land scam', the TMC targeted several BJP ministers. Tweeted with the hashtag \"Save India, Save Democracy\", here are the ABCs of the scams of \"Bhrashtachari Janata Party\", as listed by the TMC:",
        "sentiment": "1 (Negative)",
        "link": "https://www.indiatoday.in/india/story/modi-shah-are-grandfathers-of-corruption-tmc-lists-a-to-z-of-bjp-scams-1448365-2019-02-05"
    },
    {
        "title": "New sextortion scam combines stolen data to target victims directly",
        "snippet": "The latest sexual extortion, or \"sextortion\" scam sees scammers use victims' personal data in order to convince them that Pegasus spyware has been deployed on their device. ... with a 30-day money ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.tomsguide.com/computing/online-security/new-sextortion-scam-combines-stolen-data-to-target-victims-directly"
    },
    {
        "title": "Jagdish Devda Biography Who is Jagdish Devda Next Madhya Pradesh Deputy ...",
        "snippet": "Jagdish Devda Biography: सात बार रहे विधायक, जानिए कौन हैं जगदीश देवड़ा, जो बनेंगे मध्य प्रदेश के डिप्टी सीएम ... MP Deputy CM Jagdish Devda Biography: ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.abplive.com/states/madhya-pradesh/jagdish-devda-biography-who-is-jagdish-devda-next-madhya-pradesh-deputy-cm-malhargarh-bjp-mla-2558486"
    },
    {
        "title": "Jagdish Devda Named Deputy Chief Minister Of Madhya Pradesh; Know All ...",
        "snippet": "The BJP retained power in MP following the 17 November polls, winning 163 seats in the 230-member MP Legislative Assembly, leaving the Congress with only 66 seats.",
        "sentiment": "2 (Negative)",
        "link": "https://english.jagran.com/india/jagdish-deora-named-deputy-chief-minister-of-madhya-pradesh-know-all-about-sixtime-bjp-mla-and-former-mp-finance-minister-10119592"
    },
    {
        "title": "Jagdish Devda: जगदीश देवड़ा को मिली MP के डिप्टी सीएम की जिम्मेदारी, आठ ...",
        "snippet": "Jagdish Devda New Deputy CM of MP भाजपा विधायक दल की बैठक में मध्य प्रदेश के ...",
        "sentiment": "3 (Neutral)",
        "link": "https://www.jagran.com/madhya-pradesh/bhopal-who-is-the-new-deputy-cm-of-madhya-pradesh-jagdish-devda-net-worth-political-background-malhargarh-assembly-constituency-23602044.html"
    },
    {
        "title": "Extortion Scams: What To Know & How To Protect Yourself - Aura",
        "snippet": "Examples of Real-life Extortion Scams. Most extortion scams share similar motives, but their tactics and targets can vary. The following are examples of some of the more common types of extortion scams: 1. Financial sextortion scams. Sextortion or sexploitation scams involve cybercriminals blackmailing minors with illicit material.",
        "sentiment": "1 (Negative)",
        "link": "https://www.aura.com/learn/extortion-scams"
    },
    {
        "title": "Jagdish Devda , जगदीश देवड़ा , Malhargarh , मल्हारगढ़ , BJP , Madhya ...",
        "snippet": "Jagdish Devda , जगदीश देवड़ा , Malhargarh , मल्हारगढ़ , BJP , Madhya Pradesh , मध्यप्रदेश , jammu kashmir and haryana assembly election 2024. शुक्रवार, 17 जनवरी 2025 ... Jagdish Devda Biography In Hindi : मल्हारगढ़ विधानसभा ...",
        "sentiment": "4 (Positive)",
        "link": "https://hindi.webdunia.com/election-candidate/jagdish-devda-38.html"
    },
    {
        "title": "JAGDISH DEVDA(Bharatiya Janata Party(BJP)):Constituency ... - MyNeta",
        "snippet": "JAGDISH DEVDA (Winner) Malhargarh (Mandsour) Party:BJP . S/o|D/o|W/o: GENDA LALJI DEVDA . Age ... 1431 SQ.FT. RIVERA TOWN SHIP IN BHOPAL DUPLICATES BHAWAN MP HOUSING BOARD : 6,00,000 6 Lacs+ 1000 SQ.FT. RESIDENTIAL HOSUE NO.32 SHAYAM NAGAR 2ND MANDSOUR : Nil: ... increased misuse of money in elections so as to facilitate a system of ...",
        "sentiment": "1 (Negative)",
        "link": "https://myneta.info/2008mp/candidate.php?candidate_id=251"
    },
    {
        "title": "MP Oath Taking Ceremony: Jagdish Devda, Rajendra Shukla swear in as ...",
        "snippet": "BJP leaders Jagdish Devda and Rajendra Shukla took oath as the Deputy Chief Ministers of Madhya Pradesh, in Bhopal. Prime Minister Narendra Modi and other senior NDA leaders attend the ceremony ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.indiatvnews.com/madhya-pradesh/madhya-pradesh-cm-swearing-in-ceremony-live-updates-mohan-yadav-take-oath-as-mp-chief-minister-in-presence-of-pm-modi-jagdish-devda-rajendra-shukl-bjp-2023-12-13-907066"
    },
    {
        "title": "Malhargarh Election Result 2023 Live Updates: BJP Won In This Seat of MP",
        "snippet": "In the MP state Assembly election 2023 for Malhargarh constituency, BJP has fielded Jagdish Devda against Congress' Parshuram Sisodiya. BJP has won in this seat of Madhya Pradesh.",
        "sentiment": "4 (Positive)",
        "link": "https://www.thequint.com/elections/madhya-pradesh-election/malhargarh-election-result-2023-live-updates-counting-of-votes-mp-assembly-elections-bjp-congress-candidate-2"
    },
    {
        "title": "ED Files Money Laundering Case Against BJP Leader Digambar Agawane & 8 ...",
        "snippet": "The Enforcement Directorate has filed a prosecution complaint against BJP leader Digambar Rohidas Agawane and eight others in a case related to loan fraud under the provisions of the Prevention of ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.freepressjournal.in/mumbai/ed-files-money-laundering-case-against-bjp-leader-digambar-agawane-8-others-in-loan-fraud-scam"
    },
    {
        "title": "MP Monsoon Session: Finance Minister Jagdish Devda Presents State ...",
        "snippet": "Bhopal (Madhya Pradesh): Madhya Pradesh Finance Minister Jagdish Devda on Wednesday presented state budget for the year 2024-25 in the legislative assembly amid ruckus created by the opposition ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.freepressjournal.in/bhopal/mp-monsoon-session-finance-minister-jagdish-devda-presents-state-budget-amid-oppositionruckus"
    },
    {
        "title": "जगदीश देवड़ा, राजेंद्र शुक्ला... Mp में दो डिप्टी सीएम के पीछे बीजेपी ...",
        "snippet": "mp के सिंगरौली में सेप्टिक टैंक में मिले 4 युवकों के शव, न्यू ईयर पार्टी मनाने निकले थे",
        "sentiment": "2 (Negative)",
        "link": "https://www.aajtak.in/madhya-pradesh/story/rajendra-shukla-jagdish-devda-deputy-cm-mp-bjp-lok-sabha-chunav-2024-ntc-bikt-1837001-2023-12-12"
    },
    {
        "title": "Top Types Of Cyber Extortion Scams And 7 Ways To Stay Safe - Forbes",
        "snippet": "Close up of a computer keyboard with a pay button (Cyber Extortion Concept) getty. Online extortion scams, when scammers make threats and demands to get your money, are becoming more frequent.",
        "sentiment": "1 (Negative)",
        "link": "https://www.forbes.com/sites/alexvakulov/2024/09/09/top-types-of-cyber-extortion-scams-and-7-ways-to-stay-safe/"
    },
    {
        "title": "MP Budget 2024 Highlights: Focus on agriculture, health, roadways as ...",
        "snippet": "MP Budget 2024 Expectations Highlights: Jagdish Devda presented the first budget of the current BJP govt for the financial year 2024-25. Written by FE Business Updated: July 3, 2024 15:44 IST",
        "sentiment": "2 (Negative)",
        "link": "https://www.financialexpress.com/policy/economy-mp-budget-2024-live-updates-jagdish-devda-budget-fy25-3542064/"
    },
    {
        "title": "Who is Jagdish Devda, the new Madhya Pradesh deputy Chief Minister?",
        "snippet": "Jagdish Devda contested the Madhya Pradesh Assembly Elections 2023 from the Malhargarh seat and won the campaign by a margin of 59,024 votes. Republic World. ... Originally trained to be a lawyer, the 66-year-old leader began his political career with the BJP Yuva Morcha (BJYM) BJP's youth wing in 1979. ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.republicworld.com/elections/who-is-jagdish-devda-the-new-madhya-pradesh-deputy-chief-minister"
    },
    {
        "title": "BJP alleges Rs 5,000 crore scam in Rajasthan IT dept ... - India Today",
        "snippet": "Regarding the alleged Rs 5,000 crore scam, the BJP leader said that he will go to the Enforcement Directorate's office on Wednesday and file a complaint against the chief minister, as per news agency PTI. Meena also alleged that Ashok Gehlot's son Vaibhav Gehlot had been involved in money laundering.",
        "sentiment": "1 (Negative)",
        "link": "https://www.indiatoday.in/india/story/rajasthan-it-department-scam-bjp-ashok-gehlot-rs-5000-crore-corruption-2389662-2023-06-06"
    },
    {
        "title": "Jagdish Devda: आठ बार के विधायक जगदीश देवड़ा संभालेंगे MP के डिप्टी ...",
        "snippet": "MP Deputy CM Jagdish Devda: रामपुरा क्षेत्र से आने वाले जगदीश देवड़ा को मप्र का डिप्टी सीएम बनाया गया है। देवड़ा मल्हारगढ़ विधानसभा सीट से आठ बार से विधायक हैं और अब ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.amarujala.com/madhya-pradesh/bhopal/mp-news-jagdish-deora-will-become-deputy-chief-minister-of-madhya-pradesh-2023-12-11"
    },
    {
        "title": "3 common money laundering scams: How to avoid falling for fraud",
        "snippet": "Money scams have risen during the coronavirus and criminals are banking on consumers not knowing how to spot fraud. Here's how to avoid financial and legal trouble.",
        "sentiment": "1 (Negative)",
        "link": "https://www.cnbc.com/2020/09/13/3-common-money-laundering-scams-how-to-avoid-falling-for-fraud.html"
    },
    {
        "title": "Who is Jagdish Devda MP Deputy CM, biography, age, family, education ...",
        "snippet": "Known for his dedication and sociopolitical acumen, Devda swiftly climbed the party's hierarchy. Jagdish Devda career. The recent political landscape in Madhya Pradesh witnessed the BJP taking a decisive step by appointing Mohan Yadav as the Chief Minister, accompanied by Rajendra Shukla and Jagdish Devda as Deputy Chief Ministers.",
        "sentiment": "4 (Positive)",
        "link": "https://thesportsgrail.com/who-is-jagdish-devda-mp-deputy-cm-biography-age-family-education-cast-net-worth/"
    },
    {
        "title": "Jagdish Devda to be Madhya Pradesh's Deputy CM: Who is he? Facts about ...",
        "snippet": "Who is Jagdish Devda? He has been an MLA from the BJP and serving from the Malhargarh constituency since 2008. He defeated Congress party's Shyamlal Jokchand with a margin of 3,688 votes in 2008.",
        "sentiment": "4 (Positive)",
        "link": "https://www.indiatvnews.com/madhya-pradesh/jagdish-devda-to-be-madhya-pradesh-deputy-chief-minister-who-is-he-cm-mohan-yadav-narendra-singh-tomar-jp-nadda-pm-narendra-modi-latest-updates-2023-12-11-906819"
    },
    {
        "title": "Jagdish Devda - PRS Legislative Research",
        "snippet": "This MLA has been the Deputy Chief minister from 13 Dec 2023. Ministers represent the government in debates, so we do not report their participation while they are in the office. They do not sign the attendance register, ask questions, or introduce private member bills. Data corresponds to the period from 03-12-2023 to 14-02-2024.",
        "sentiment": "1 (Negative)",
        "link": "https://prsindia.org/mlatrack/jagdish-devda"
    },
    {
        "title": "MP's budget will be comprehensive & public centric: Jagdish Devda",
        "snippet": "Bhopal : Madhya Pradesh Finance Minister Jagdish Devda on Monday said the upcoming annual budget of the state government would be comprehensive and beneficial for all sections of the people. Devda ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.thehansindia.com/news/national/mps-budget-will-be-comprehensive-public-centric-jagdish-devda-886956"
    },
    {
        "title": "MP Budget: Amid Opposition's uproar, finance minister Jagdish Devda ...",
        "snippet": "Devda aliong with his wife performed puja before leaving his official residence for MP State assembly. ... Finance Minister Jagdish Devda has presented the state budget worth Rs 2,79,237 lakh ...",
        "sentiment": "2 (Negative)",
        "link": "https://www.freepressjournal.in/bhopal/bhopal-finance-minister-jagdish-dewda-to-present-mp-budget-today"
    },
    {
        "title": "Georgia Residents Charged with Conspiracy to Commit Money Laundering ...",
        "snippet": "Georgia Residents Charged With Conspiracy To Commit Money Laundering, Money Laundering, Wire Fraud, and Attempted Extortion; ... Money Laundering, Wire Fraud, and Attempted Extortion . Monday, November 25, 2024. Share. Facebook; X; LinkedIn; Email; For Immediate Release. U.S. Attorney's Office, District of Delaware Wilmington, Del. - On ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.justice.gov/usao-de/pr/georgia-residents-charged-conspiracy-commit-money-laundering-money-laundering-wire-fraud"
    },
    {
        "title": "Jagdish Devda, BJP Candidate from Malhargarh Assembly Election 2024 ...",
        "snippet": "Jagdish Devda representing the BJP contesting for the Malhargarh Assembly Election 2024 Seat. Know His/her opponents, age, educational background, constituency details, electoral track record, date of birth, and more on News18 - Assembly Election 2024 Result News",
        "sentiment": "1 (Negative)",
        "link": "https://www.news18.com/elections/assembly/madhya-pradesh/jagdish-devda-s12aed2008a225e2023c001/"
    },
    {
        "title": "Malhargarh Election Result 2023 LIVE: BJP's Jagdish Devda ... - CNBCTV18",
        "snippet": "During the 2018 polls, Dewra defeated Sisodia by 11,872 votes. The BJP leader garnered 99,839 votes, securing 51.03% of the vote share. In percentage terms, the victory margin was 6.07%.",
        "sentiment": "4 (Positive)",
        "link": "https://www.cnbctv18.com/politics/malhargarh-election-result-2023-live-how-to-check-madhya-pradesh-legislative-assembly-poll-winners-news-bjp-congress-jagdish-dewra-parshuram-sisodia-18463441.htm"
    },
    {
        "title": "BJP leaders Jagdish Devda and Rajendra Shukla take oath as Deputy CM of ...",
        "snippet": "BHOPAL: BJP leaders Jagdish Devda and Rajendra Shukla took oath as the Deputy Chief Ministers of Madhya Pradesh in Bhopal on Wednesday.Earlier BJP MLA Mohan Yadav took oath as the Chief Minister of the state. Governor Mangubhai C. Patel administered the oath of office to him at the sprawling Motilal Nehru Stadium, Lal Parade Ground in Bhopal.",
        "sentiment": "4 (Positive)",
        "link": "https://www.dtnext.in/news/national/bjp-leaders-jagdish-devda-and-rajendra-shukla-take-oath-as-deputy-cm-of-madhya-pradesh-754170"
    },
    {
        "title": "Jagdish Dewra(Bharatiya Janata Party(BJP)):Constituency- MALHARGARH ...",
        "snippet": "Central MP Regional Gramin Bank Pipalya Mandi, Mandsour A/C No.28121 49,479 49 Thou+ Bank of India Bhopal (FD)-0949550 Date-07/10/2010 ... Loan to Jagdish Gendalal Devda 4,00,000 4 Lacs+: Loan to Jagdish Gendalal Devda 2,05,000 2 Lacs+: Nil: Nil: Nil: Nil: ... increased misuse of money in elections so as to facilitate a system of transparency ...",
        "sentiment": "1 (Negative)",
        "link": "https://myneta.info/mp2013/candidate.php?candidate_id=122"
    },
    {
        "title": "Dy CMs, few & far between in MP - Times of India",
        "snippet": "The BJP has appointed two deputy chief ministers, Jagdish Devda and Rajendra Shukla, in Madhya Pradesh for the first time. This move is aimed at maintaining caste equations. Read more about the ...",
        "sentiment": "4 (Positive)",
        "link": "https://timesofindia.indiatimes.com/city/bhopal/dy-cms-in-madhya-pradesh-bjp-appoints-two-deputy-chief-ministers/articleshow/105947364.cms"
    },
    {
        "title": "Jagdish Devda - The Indian Express",
        "snippet": "Jagdish Devda News Updates: Get Latest Breaking News, Photos and Video News on Jagdish Devda. Also find Jagdish Devda latest news headlines, picture gallery, top videos, comments, blog posts and opinion at The Indian Express. ... BJP's Jagdish Devda was sworn in as deputy CM of Madhya Pradesh after the party registered a resounding victory in ...",
        "sentiment": "4 (Positive)",
        "link": "https://indianexpress.com/about/jagdish-devda/"
    },
    {
        "title": "MP Deputy CM: कौन हैं जगदीश देवड़ा, जो बने मध्य प्रदेश के डिप्टी CM",
        "snippet": "MP Deputy CM Jagdish Devda profile: मध्य प्रदेश में कई दिनों के सस्पेंस के बाद, भाजपा ने सोमवार को दक्षिण उज्जैन के विधायक मोहन यादव को मध्य प्रदेश का नया ...",
        "sentiment": "3 (Neutral)",
        "link": "https://hindi.news24online.com/headlines/jagdish-devda-profile-madhya-pradesh-dupty-chief-minister-jagdish-devda-malhargarh/484987/"
    },
    {
        "title": "BJP Is Set To Secure Majority In State: Devda - Free Press Journal",
        "snippet": "Minister Devda acknowledged the contribution of BJP workers and the people in organising over 670 Rath Sabhas, 200 stage meetings and 50 large public gatherings during the yatras.",
        "sentiment": "4 (Positive)",
        "link": "https://www.freepressjournal.in/indore/bjp-is-set-to-secure-majority-in-state-devda"
    },
    {
        "title": "Who are Rajendra Shukla and Jagdish Devda, Madhya Pradesh's ... - The Week",
        "snippet": "Mohan Yadav will be new MP CM and Narendra Singh Tomar will be the Speaker. ... Who are Rajendra Shukla and Jagdish Devda, Madhya Pradesh's new deputy CMs? ... December 12, 2023 08:06 IST. Rajendra Shukla and Jagdish Devda. After days of suspense, the BJP on Monday announced that Mohan Yadav, its three-time MLA from South Ujjain, will be the ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.theweek.in/news/india/2023/12/12/who-are-rajendra-shukla-jagadish-deora-madhay-pradeshs-new-deputy-cms.html"
    },
    {
        "title": "Photos Of Drug Haul Case Accused With Deputy CM Jagdish Devda Goes Viral",
        "snippet": "Bhopal (Madhya Pradesh): A photograph of Deputy Chief Minister Jagdish Devda, with Harish Anjana who was arrested in connection with Rs 1,814 crore drugs trafficking case, has heated up political ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.freepressjournal.in/bhopal/photos-of-drug-haul-case-accused-with-deputy-cm-jagdish-devda-goes-viral"
    },
    {
        "title": "Madhya Pradesh Finance Minister presents state budget in assembly amid ...",
        "snippet": "Budget 2024-25: Madhya Pradesh Finance Minister Jagdish Devda on Wednesday presented the state budget for the year 2024-25 in the legislative assembly, with a total allocation of more than Rs 3 ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.indiatvnews.com/madhya-pradesh/madhya-pradesh-budget-finance-minister-jagdish-devda-presents-assembly-amid-ruckus-by-opposition-latest-updates-2024-07-03-940017"
    },
    {
        "title": "Fraud and scams - Financial Ombudsman service",
        "snippet": "Fraud and scams are crimes where someone cheats someone else out of their money through theft or deception. Anyone can fall victim to fraud or a scam. Criminals often pretend to be a real organisation or person and are always coming up with new ways to cheat people out of their money. Sometimes criminals use more than one way to defraud a victim.",
        "sentiment": "1 (Negative)",
        "link": "https://www.financial-ombudsman.org.uk/consumers/complaints-can-help/fraud-scams"
    },
    {
        "title": "Two Men Sentenced for International Money Laundering and Bank Fraud Scheme",
        "snippet": "In June 2023, the defendants were each convicted following an eight-day jury trial of one count of bank fraud, one count of bank fraud conspiracy and one count of money laundering conspiracy. \"This case demonstrates that if you prey on the elderly and the vulnerable through on-line scams, you can rest assured that federal law enforcement will ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.justice.gov/usao-ma/pr/two-men-sentenced-international-money-laundering-and-bank-fraud-scheme"
    },
    {
        "title": "MP Cabinet: CM Yadav Keeps Home Dept As Portfolio Allotted To 30 ...",
        "snippet": "Deputy CM Jagdish Devda gets finance ministry, and Rajendra Shukla gets public health ministry. ... Madhya Pradesh Cabinet Rajendra Shukla Mohan Yadav BJP MP Cabinet Jagdish Devda. ... Delhi: 26-Year-Old Murdered In Narela For Seeking Back Money He Lent To Man. Cities. Massive Fire Engulfs Hyderabad IT Firm Building, 6 Fire Engines Rush To ...",
        "sentiment": "5 (Positive)",
        "link": "https://news.abplive.com/news/india/mp-cabinet-cm-mohan-yadav-keeps-home-dept-as-portfolio-allotted-to-30-ministers-see-full-list-1653380"
    },
    {
        "title": "Seven-time MLA, know who is Jagdish Devda, who will become - India Herald",
        "snippet": "Jagdish Deora is currently bjp mla from Malhargarh assembly seat of Mandsaur. The newly appointed Deputy. Chief minister of madhya pradesh, Jagdish Deora belongs to the scheduled caste of the state. He was born on 1. July 1957 in Neemuch district. Jagdish Deora is a social worker and lawyer by profession. He started his political",
        "sentiment": "4 (Positive)",
        "link": "https://www.indiaherald.com/Politics/Read/994657891/Seventime-MLA-know-who-is-Jagdish-Devda-who-will-become-Deputy-CM"
    },
    {
        "title": "Finance Minister Jagdish Devda to present MP budget today",
        "snippet": "Deputy Chief Minister of Madhya Pradesh and Finance Minister Jagdish Devda will present the state budget financial year 2024-25 in the state assembly on Wednesday.The State Finance Minister will present the first budget of the current Bharatiya Janata Party (BJP)-led state government for the financi",
        "sentiment": "5 (Positive)",
        "link": "https://thenewsmill.com/2024/07/finance-minister-jagdish-devda-to-present-mp-budget-today/"
    }
]