[
    {
        "title": "Madhya Pradesh: Congress seeks Dy CM's resignation over drug bust",
        "snippet": "CM Mohan Yadav, who is also the state's home minister is silent over the entire issue of one of his two deputy CMs Jagdish Devda's pictures with one of those arrested in the case,\" Patwari said.",
        "sentiment": "1 (Negative)",
        "link": "https://www.newindianexpress.com/nation/2024/Oct/12/madhya-pradesh-congress-seeks-dy-cms-resignation-over-drug-bust"
    },
    {
        "title": "Bhopal Drug Bust: MP Congress Alleges Deputy CM's Close ... - ABP LIVE",
        "snippet": "Madhya Pradesh Congress accuses Deputy Chief Minister Jagdish Devda of involvement in a recent massive drug haul near Bhopal, demanding his resignation. ... Patwari demanded Devda's resignation and criticised the BJP for its inaction on the matter. According to news agency PTI, Patwari claimed, \"Prime Minister Modi did not provide two crore ...",
        "sentiment": "1 (Negative)",
        "link": "https://news.abplive.com/cities/bhopal-drug-bust-mp-congress-jitendra-patwari-alleges-deputy-cm-jagdish-devda-close-aide-involved-in-racket-questions-cm-mohan-yadav-pm-modi-1723695"
    },
    {
        "title": "Congress Demands Deputy CM Jagdish Devda's Resignation; Cites His Links ...",
        "snippet": "Bhopal (Madhya Pradesh): The Congress party on Monday sought resignation of deputy chief minister Jagdish Devda claiming he was close to an arrested accused in the case related to seizure of ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.freepressjournal.in/bhopal/congress-demands-deputy-cm-jagdish-devdas-resignation-cites-his-links-with-drug-factory-operators"
    },
    {
        "title": "Photos Of Drug Haul Case Accused With Deputy CM Jagdish Devda Goes Viral",
        "snippet": "Bhopal (Madhya Pradesh): A photograph of Deputy Chief Minister Jagdish Devda, with Harish Anjana who was arrested in connection with Rs 1,814 crore drugs trafficking case, has heated up political ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.freepressjournal.in/bhopal/photos-of-drug-haul-case-accused-with-deputy-cm-jagdish-devda-goes-viral"
    },
    {
        "title": "Jagdish Devda - Wikipedia",
        "snippet": "Jagdish Devda is an Indian politician from the Bharatiya Janata Party currently serving as the deputy chief minister of Madhya Pradesh. He is representing Malhargarh Assembly constituency as an MLA for the 6th time in Madhya Pradesh Legislative Assembly. [1] Early life",
        "sentiment": "4 (Positive)",
        "link": "https://en.wikipedia.org/wiki/Jagdish_Devda"
    },
    {
        "title": "List of deputy chief ministers of Madhya Pradesh - Wikipedia",
        "snippet": "The deputy chief minister of Madhya Pradesh is a member of the Cabinet of Madhya Pradesh Government in the Government of Madhya Pradesh.Not a constitutional office, it seldom carries any specific powers. [2] A deputy chief minister usually also holds a cabinet portfolio such as home minister or finance minister. In the parliamentary system of government, the chief minister is treated as the ...",
        "sentiment": "1 (Negative)",
        "link": "https://en.wikipedia.org/wiki/List_of_deputy_chief_ministers_of_Madhya_Pradesh"
    },
    {
        "title": "Congress accuses MP deputy CM of close links with drug ... - The Week",
        "snippet": "He said the BJP had come out with a lame defence that just because Devda had been photographed with the kingpin does not mean they were close. It was not about just one or two or three pictures, at least 500 photographs and videos of the kingpin with the deputy chief minister were available on social media and that cannot be a mere coincidence ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.theweek.in/wire-updates/national/2024/10/11/del44-cong-mp-ld-drugs.html"
    },
    {
        "title": "Jagdish _ Devda - India Leader",
        "snippet": "Read About Jagdish Devda, BJP, Malhargarh, Madhya Pradesh Assembly Elections : Jagdish Devda, an esteemed member of the Bharatiya Janata Party (BJP), is contesting from the Malhargarh constituency in Madhya Pradesh. At 66, he is the son of Late Gendalal Ji Devda and holds the 1104th position in Part no 56 as a registered voter in the Mandsour ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.indialeader.com/ViewLeader/47118/"
    },
    {
        "title": "jagdish devda madhya-pradesh malhargarh candidate Profile,Candidates ...",
        "snippet": "jagdish devda madhya-pradesh malhargarh candidate : jagdish devda madhya-pradesh malhargarh candidate Candidates Net Worth, Education, Property and Family Background Affidavit Submitted To ECI Latest News at ABP न्यूज़ | ABPLive ... (BJP) emerged as the single largest party, winning 105 seats, while its ally Shiv Sena secured 56 ...",
        "sentiment": "1 (Negative)",
        "link": "https://news.abplive.com/elections/jagdish-devda-madhya-pradesh-malhargarh-candidate-profile.html"
    },
    {
        "title": "Jagdish Devda(Bharatiya Janata Party(BJP)):Constituency ... - MyNeta",
        "snippet": "JAGDISH DEVDA (Winner) MALHARGARH (SC) (MANDSAUR) Party:BJP . S/o|D/o|W/o: Late. Gendalal Ji Devda . Age: 66 . Name Enrolled as Voter in: 224 Mandsour (Madhya Pradesh) constituency, at Serial no 1104 in Part no 56 . Self Profession:Salary and Rent Received as a Minister in Madhya Pradesh Government",
        "sentiment": "1 (Negative)",
        "link": "https://myneta.info/MadhyaPradesh2023/candidate.php?candidate_id=531"
    },
    {
        "title": "JAGDISH DEVDA(Bharatiya Janata Party(BJP)):Constituency- Malhargarh ...",
        "snippet": "Home → Madhya Pradesh 2008 → Mandsour → Malhargarh → JAGDISH DEVDA(Criminal & Asset Declaration) Madhya Pradesh 2008. JAGDISH DEVDA (Winner) Malhargarh (Mandsour) Party:BJP . S/o|D/o|W/o: GENDA LALJI DEVDA . Age: 47 . Other Elections ; Declaration in Declared Assets Declared Cases; Madhya Pradesh 2023: Rs4,88,13,304 ~4 Crore+: 0: Madhya ...",
        "sentiment": "1 (Negative)",
        "link": "https://myneta.info/2008mp/candidate.php?candidate_id=251"
    },
    {
        "title": "BJP picks Jagdish Devda, Rajendra Shukla to be new Deputy chief ...",
        "snippet": "Jagdish Devda The party's candidate from Malhargath, Jagdish Devda won in the state assembly elections 2023 by a margin of 59,024 votes, defeating independent candidate Shyamlal Jokchand. Devda has been serving as Malhargarh MLA since 2008. He won three consecutive terms in 2008, 2013, and 2018.",
        "sentiment": "1 (Negative)",
        "link": "https://www.cnbctv18.com/politics/bjp-picks-jagdish-devda-rajendra-shukla-to-be-new-deputy-chief-ministers-of-madhya-pradesh-18539261.htm"
    },
    {
        "title": "Meet the two new deputy CMs in MP: Jagdish Devda and Rajendra Shukla ...",
        "snippet": "The party also announced that Mohan will be assisted by two deputies - Jagdish Devda and Rajendra Shukla - in running the government. While Devda belongs to the Scheduled Caste (SC), Shukla has emerged as the undisputed Brahmin face in the Vindhya Pradesh region. ... Devda joined the BJP's youth wing - the Bharatiya Janata Yuva Morcha ...",
        "sentiment": "4 (Positive)",
        "link": "https://indianexpress.com/article/political-pulse/meet-the-two-new-deputy-cms-in-mp-jagdish-devda-and-rajendra-shukla-who-rose-up-the-bjp-ranks-9065616/"
    },
    {
        "title": "Jagdish Devda to be Madhya Pradesh's Deputy CM: Who is he? Facts about ...",
        "snippet": "Who is Jagdish Devda? He has been an MLA from the BJP and serving from the Malhargarh constituency since 2008. He defeated Congress party's Shyamlal Jokchand with a margin of 3,688 votes in 2008.",
        "sentiment": "4 (Positive)",
        "link": "https://www.indiatvnews.com/madhya-pradesh/jagdish-devda-to-be-madhya-pradesh-deputy-chief-minister-who-is-he-cm-mohan-yadav-narendra-singh-tomar-jp-nadda-pm-narendra-modi-latest-updates-2023-12-11-906819"
    },
    {
        "title": "Jagdish Devda Latest News, Photos and Videos - India TV News",
        "snippet": "Jagdish Devda to be Madhya Pradesh's Deputy CM: Who is he? Facts about BJP leader December 11, 2023 19:43 IST . The BJP announced the names of new Chief Minister and Deputy Chief Ministers in ...",
        "sentiment": "3 (Neutral)",
        "link": "https://www.indiatvnews.com/topic/jagdish-devda"
    },
    {
        "title": "Jagdish Devda Biography Who is Jagdish Devda Next Madhya Pradesh Deputy ...",
        "snippet": "MP Deputy CM Jagdish Devda Biography: मध्य प्रदेश में सभी कयासों पर विराम लगाते हुए ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.abplive.com/states/madhya-pradesh/jagdish-devda-biography-who-is-jagdish-devda-next-madhya-pradesh-deputy-cm-malhargarh-bjp-mla-2558486"
    },
    {
        "title": "Jagdish Devda , जगदीश देवड़ा , Malhargarh , मल्हारगढ़ , BJP , Madhya ...",
        "snippet": "Jagdish Devda , जगदीश देवड़ा , Malhargarh , मल्हारगढ़ , BJP , Madhya Pradesh , मध्यप्रदेश , jammu kashmir and haryana assembly election 2024. शुक्रवार, 17 जनवरी 2025 ... Jagdish Devda Biography In Hindi : मल्हारगढ़ विधानसभा ...",
        "sentiment": "4 (Positive)",
        "link": "https://hindi.webdunia.com/election-candidate/jagdish-devda-38.html"
    },
    {
        "title": "Seven-time MLA, know who is Jagdish Devda, who will become - India Herald",
        "snippet": "Jagdish Deora is currently bjp mla from Malhargarh assembly seat of Mandsaur. The newly appointed Deputy. Chief minister of madhya pradesh, Jagdish Deora belongs to the scheduled caste of the state. He was born on 1. July 1957 in Neemuch district. Jagdish Deora is a social worker and lawyer by profession. He started his political",
        "sentiment": "4 (Positive)",
        "link": "https://www.indiaherald.com/Politics/Read/994657891/Seventime-MLA-know-who-is-Jagdish-Devda-who-will-become-Deputy-CM"
    },
    {
        "title": "Who is Jagdish Devda, the new Madhya Pradesh deputy Chief Minister?",
        "snippet": "Jagdish Devda contested the Madhya Pradesh Assembly Elections 2023 from the Malhargarh seat and won the campaign by a margin of 59,024 votes. Republic World. ... Originally trained to be a lawyer, the 66-year-old leader began his political career with the BJP Yuva Morcha (BJYM) BJP's youth wing in 1979. ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.republicworld.com/elections/who-is-jagdish-devda-the-new-madhya-pradesh-deputy-chief-minister"
    },
    {
        "title": "Jagdish Devda Named Deputy Chief Minister Of Madhya Pradesh; Know All ...",
        "snippet": "Jagdish Devda started his political career as a student leader and was the President of the Student Union of Government College, Rampura in 1979. ... Know All About Six-Time BJP MLA And Former MP ...",
        "sentiment": "2 (Negative)",
        "link": "https://english.jagran.com/india/jagdish-deora-named-deputy-chief-minister-of-madhya-pradesh-know-all-about-sixtime-bjp-mla-and-former-mp-finance-minister-10119592"
    },
    {
        "title": "MP Budget FY25: Key takeaways from Finance Minister Jagdish Devda ...",
        "snippet": "Madhya Pradesh Deputy Chief Minister Jagdish Devda, who holds the finance portfolio, on Wednesday, presented the state budget for the financial year 2024-25 in the legislative assembly amid ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.financialexpress.com/policy/economy-mp-budget-2024-25-key-takeaways-from-finance-minister-jagdish-devda-speech-in-madhya-pradesh-assembly-3542426/"
    },
    {
        "title": "BJP Is Set To Secure Majority In State: Devda - Free Press Journal",
        "snippet": "Minister Devda acknowledged the contribution of BJP workers and the people in organising over 670 Rath Sabhas, 200 stage meetings and 50 large public gatherings during the yatras.",
        "sentiment": "4 (Positive)",
        "link": "https://www.freepressjournal.in/indore/bjp-is-set-to-secure-majority-in-state-devda"
    },
    {
        "title": "BJP leaders Jagdish Devda and Rajendra Shukla take oath as Deputy CM of ...",
        "snippet": "BHOPAL: BJP leaders Jagdish Devda and Rajendra Shukla took oath as the Deputy Chief Ministers of Madhya Pradesh in Bhopal on Wednesday.Earlier BJP MLA Mohan Yadav took oath as the Chief Minister of the state. Governor Mangubhai C. Patel administered the oath of office to him at the sprawling Motilal Nehru Stadium, Lal Parade Ground in Bhopal.",
        "sentiment": "4 (Positive)",
        "link": "https://www.dtnext.in/news/national/bjp-leaders-jagdish-devda-and-rajendra-shukla-take-oath-as-deputy-cm-of-madhya-pradesh-754170"
    },
    {
        "title": "Jagdish Dewra(Bharatiya Janata Party(BJP)):Constituency- MALHARGARH ...",
        "snippet": "Home → Madhya Pradesh 2013 → MANDSOUR → MALHARGARH → JAGDISH DEWRA(Criminal & Asset Declaration ... MALHARGARH (MANDSOUR) Party:BJP . S/o|D/o|W/o: Late. Gendalal . Age: 56 . Name Enrolled as Voter in: 224-Mandsour (Madhya Pradesh) constituency, at Serial no ... Loan to Jagdish Gendalal Devda 4,00,000 4 Lacs+: Loan to Jagdish Gendalal ...",
        "sentiment": "1 (Negative)",
        "link": "https://myneta.info/mp2013/candidate.php?candidate_id=122"
    },
    {
        "title": "Who Is Jagdish Devda? Malhargarh MLA To Be New Deputy CM Of ... - Times Now",
        "snippet": "The Bharatiya Janata Party on Monday announced the Chief Ministerial face of the party in Madhya Pradesh, along with the names of two deputy chief ministers. Mohan Yadav will take the oath of the Chief Minister while Rajendra Shukla and Jagdish Devda will be sworn in as his deputies., India News, Times Now",
        "sentiment": "4 (Positive)",
        "link": "https://www.timesnownews.com/india/who-is-jagdish-devda-malhargarh-mla-to-be-new-deputy-cm-of-madhya-pradesh-article-105904955"
    },
    {
        "title": "MP's budget will be comprehensive & public centric: Jagdish Devda",
        "snippet": "Madhya Pradesh Finance Minister Jagdish Devda on Monday said the upcoming annual budget of the state government would be comprehensive and beneficial for all sections of the people.",
        "sentiment": "4 (Positive)",
        "link": "https://www.thehansindia.com/news/national/mps-budget-will-be-comprehensive-public-centric-jagdish-devda-886956"
    },
    {
        "title": "Dy CMs in Madhya Pradesh: BJP Appoints Two Deputy Chief Ministers ...",
        "snippet": "The BJP has appointed two deputy chief ministers, Jagdish Devda and Rajendra Shukla, in Madhya Pradesh for the first time. This move is aimed at maintaining caste equations. Read more about the ...",
        "sentiment": "4 (Positive)",
        "link": "https://timesofindia.indiatimes.com/city/bhopal/dy-cms-in-madhya-pradesh-bjp-appoints-two-deputy-chief-ministers/articleshow/105947364.cms"
    },
    {
        "title": "MP Oath Taking Ceremony: Jagdish Devda, Rajendra Shukla swear in as ...",
        "snippet": "BJP leaders Jagdish Devda and Rajendra Shukla took oath as the Deputy Chief Ministers of Madhya Pradesh, in Bhopal. Prime Minister Narendra Modi and other senior NDA leaders attend the ceremony ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.indiatvnews.com/madhya-pradesh/madhya-pradesh-cm-swearing-in-ceremony-live-updates-mohan-yadav-take-oath-as-mp-chief-minister-in-presence-of-pm-modi-jagdish-devda-rajendra-shukl-bjp-2023-12-13-907066"
    },
    {
        "title": "Malhargarh Election Result 2023 Live: Bjp के Jagdish Devda की हुई जीत ...",
        "snippet": "मतगणना में, Bjp के Jagdish Devda जीतें. मध्य प्रदेश चुनाव 2023 परिणामों (मध्य प्रदेश Election 2023 Results) में Malhargarh विधानसभा सीट पर Bsp के Narendra Malviya इस दौड़ दूसरे नंबर ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.abplive.com/elections/malhargarh-election-result-2023-live-updates-constituency-vote-counting-winner-loser-bjp-congress-bsp-aap-mp-assembly-election-results-news-2551041"
    },
    {
        "title": "Jagdish Devda, BJP Candidate from Malhargarh Assembly Election 2024 ...",
        "snippet": "Jagdish Devda is the Bharatiya Janata Party candidate from Malhargarh (Scheduled Caste) constituency in Mandsaur district of Madhya Pradesh in the 2023 Assembly elections. ... Jagdish Devda has total liabilities of Rs 14.1 lakh. This BJP candidate, in the election affidavit mentioned 0 criminal cases registered against him. 2018 Malhargarh ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.news18.com/elections/assembly/madhya-pradesh/jagdish-devda-s12aed2008a225e2023c001/"
    },
    {
        "title": "Malhargarh Election Result 2023 LIVE: BJP's Jagdish Devda ... - CNBCTV18",
        "snippet": "During the 2018 polls, Dewra defeated Sisodia by 11,872 votes. The BJP leader garnered 99,839 votes, securing 51.03% of the vote share. In percentage terms, the victory margin was 6.07%.",
        "sentiment": "4 (Positive)",
        "link": "https://www.cnbctv18.com/politics/malhargarh-election-result-2023-live-how-to-check-madhya-pradesh-legislative-assembly-poll-winners-news-bjp-congress-jagdish-dewra-parshuram-sisodia-18463441.htm"
    },
    {
        "title": "Jagdish Dewda (Bharatiya Janata Party (BJP)):Constituency- MALHARGARH ...",
        "snippet": "JAGDISH DEWDA (Winner) MALHARGARH (SC) (MANDSOUR) Party:BJP . S/o|D/o|W/o: Late Shri Gaindalal Ji Dewda . Age: 61 . Name Enrolled as Voter in: 224 Mandsour (Madhya Pradesh) constituency, at Serial no 1139 in Part no 56 . Self Profession:Madhya Pradesh Vidhan Sabha Member Salary",
        "sentiment": "1 (Negative)",
        "link": "https://myneta.info/madhyapradesh2018/candidate.php?candidate_id=3348"
    },
    {
        "title": "Madhya Pradesh Finance Minister presents state budget in assembly amid ...",
        "snippet": "Budget 2024-25: Madhya Pradesh Finance Minister Jagdish Devda on Wednesday presented the state budget for the year 2024-25 in the legislative assembly, with a total allocation of more than Rs 3 ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.indiatvnews.com/madhya-pradesh/madhya-pradesh-budget-finance-minister-jagdish-devda-presents-assembly-amid-ruckus-by-opposition-latest-updates-2024-07-03-940017"
    },
    {
        "title": "Madhya Pradesh cabinet expansion: 28 ministers take oath in Shivraj ...",
        "snippet": "Former BJP ministers including Gopal Bhargava, Vijay Shah, Jagdish Devda, Yashodhara Raje Scindia, Bhupendra Singh, Brajendra Pratap Singh and Vishwas Sarang were among those inducted in Thursday ...",
        "sentiment": "4 (Positive)",
        "link": "https://timesofindia.indiatimes.com/india/madhya-pradesh-cabinet-expanded-28-ministers-take-oath/articleshow/76745793.cms"
    },
    {
        "title": "Jagdish Devda Wiki, Biography, Age, Deputy CM, Family - Right Rasta",
        "snippet": "Who is Jagdish Devda. Jagdish Devda is a Madhya Pradesh politician who now serves as the state's Deputy Chief Minister in the newly elected BJP cabinet. He was elected to the Malhargarh Assembly seat eight times. In the Fourth Chouhan Ministry, he also handled positions such as Commercial Taxes, Planning, Economics, and Statistics.",
        "sentiment": "4 (Positive)",
        "link": "https://www.rightrasta.com/jagdish-devda-wiki/"
    },
    {
        "title": "Malhargarh Election Result 2023 Live Updates: BJP Won In ... - The Quint",
        "snippet": "In the MP state Assembly election 2023 for Malhargarh constituency, BJP has fielded Jagdish Devda against Congress' Parshuram Sisodiya. BJP has won in this seat of Madhya Pradesh.",
        "sentiment": "4 (Positive)",
        "link": "https://www.thequint.com/elections/madhya-pradesh-election/malhargarh-election-result-2023-live-updates-counting-of-votes-mp-assembly-elections-bjp-congress-candidate-2"
    },
    {
        "title": "Malhargarh Election Result 2023 Live: Bjp Candidate Jagdish Devda Wins ...",
        "snippet": "Madhya Pradesh Election 2023 Final Results Tally: Bjp Candidate Jagdish Devda Wins 2023 Madhya Pradesh Assembly Elections From Malhargarh , Defeating Bsp Candidate Narendra Malviya. Follow Abp Live For All Madhya Pradesh Election 2023 Results Analysis And Expert Opinion.",
        "sentiment": "1 (Negative)",
        "link": "https://news.abplive.com/elections/malhargarh-election-result-2023-live-updates-constituency-vote-counting-winner-loser-bjp-congress-bsp-mp-assembly-election-results-news-1647009"
    },
    {
        "title": "Shri Jagdish Devda | Bharatiya Janata Party - api.bjp.org",
        "snippet": "Bharatiya Janata Party is the largest political party. Details about founders. Dr. Syama Prasad Mookerjee; Pandit Deendayal Upadhyaya",
        "sentiment": "5 (Positive)",
        "link": "https://api.bjp.org/shri-jagdish-devda"
    },
    {
        "title": "BJP appoints Jagdish Devda and Rajendra Shukla as new Deputy CMs of ...",
        "snippet": "The Bharatiya Janata Party (BJP) on Monday announced Jagdish Devda and Rajendra Shukla as the new Deputy Chief Ministers of Madhya Pradesh. The decision was taken in the legislative party meeting conducted in Bhopal today in the presence of the central observers -- Haryana Chief Minister Manohar Lal Khattar, OBC Morcha head K Laxman and secretary Asha Lakra.",
        "sentiment": "4 (Positive)",
        "link": "https://www.en.etemaaddaily.com/world/national/bjp-appoints-jagdish-devda-and-rajendra-shukla-as-new-deputy-cms-of-madhya-pradesh:143874"
    },
    {
        "title": "Congress Denies Existence Of Lord Shri Ram: Devda - Free Press Journal",
        "snippet": "Barwani (Madhya Pradesh): Deputy Chief Minister Jagdish Devda inaugurated BJP election management office of Khargone-Barwani Lok Sabha constituency here in Barwani district on Monday. MP Gajendra ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.freepressjournal.in/indore/congress-denies-existence-of-lord-shri-ram-devda"
    },
    {
        "title": "Malhargarh Election Result 2023 LIVE Updates and Highlights: Jagdish ...",
        "snippet": "In the 2008 elections, Jagdish Devda of BJP won this seat beating Shyam Lal Jok Chandra of INC by a margin of 3,688 votes which was 2.61% of the total votes polled in the constituency. INC had a vote share of 46.82% in the seat. LOCATION. The geographic coordinates of Malhargarh is: 24°08'29.0\"N 75°08'39.1\"E. Malhargarh shares its borders ...",
        "sentiment": "3 (Neutral)",
        "link": "https://www.news18.com/elections/malhargarh-election-result-2023-live-updates-and-highlights-winner-loser-leading-trailing-mla-margin-8687451.html"
    },
    {
        "title": "MP Budget: Amid Opposition's uproar, finance minister Jagdish Devda ...",
        "snippet": "Bhopal (Madhya Pradesh): Amid opposition's uproar, Finance Minister Jagdish Devda has presented the state budget worth Rs 2,79,237 lakh crore for 2022-23. There is a fiscal deficit worth Rs 55111 ...",
        "sentiment": "2 (Negative)",
        "link": "https://www.freepressjournal.in/bhopal/bhopal-finance-minister-jagdish-dewda-to-present-mp-budget-today"
    },
    {
        "title": "Who is Jagdish Devda MP Deputy CM, biography, age, family, education ...",
        "snippet": "Known for his dedication and sociopolitical acumen, Devda swiftly climbed the party's hierarchy. Jagdish Devda career. The recent political landscape in Madhya Pradesh witnessed the BJP taking a decisive step by appointing Mohan Yadav as the Chief Minister, accompanied by Rajendra Shukla and Jagdish Devda as Deputy Chief Ministers.",
        "sentiment": "4 (Positive)",
        "link": "https://thesportsgrail.com/who-is-jagdish-devda-mp-deputy-cm-biography-age-family-education-cast-net-worth/"
    },
    {
        "title": "Congress questions PM Modi's 'silence' over ... - The Economic Times",
        "snippet": "Congress alleges a close associate of Madhya Pradesh Deputy CM Jagdish Devda is involved in drug trade following a major drug haul in Bhopal. They criticize PM Modi's silence on the issue and highlight the worsening drug addiction problem, purportedly affecting 40 crore people in India. ... The situation is such that even BJP leaders and ...",
        "sentiment": "1 (Negative)",
        "link": "https://economictimes.indiatimes.com/news/politics-and-nation/congress-questions-pm-modis-silence-over-growing-drug-trade-in-mp-slams-bjp/articleshow/114150334.cms"
    },
    {
        "title": "Constituency List Madhya Pradesh Assembly Election 2023",
        "snippet": "The party has also announced the names of two deputy chief ministers -- Jagdish Devda and Rajendra Shukla. Meanwhile, Mohan Yadav was elected as the legislative party leader of the Madhya Pradesh BJP.",
        "sentiment": "3 (Neutral)",
        "link": "https://www.indiatvnews.com/elections/madhya-pradesh-assembly-elections/constituencies"
    },
    {
        "title": "Jagdish Devda - The Indian Express",
        "snippet": "BJP's Jagdish Devda was sworn in as deputy CM of Madhya Pradesh after the party registered a resounding victory in the 2023 assembly polls. Born in Rampura village of Neemuch district, Devda (66) was finance minister in the Shivraj Singh Chouhan government before being elevated to the post of deputy CM.",
        "sentiment": "4 (Positive)",
        "link": "https://indianexpress.com/about/jagdish-devda/"
    },
    {
        "title": "Deputy CM in MP: आठ बार के विधायक जगदीश देवड़ा ने ली डिप्टी CM पद की ...",
        "snippet": "Jagdish Devda: डिजिटल डेस्क, भोपाल। मध्यप्रदेश में थावरचंद गहलोत के बाद ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.naidunia.com/madhya-pradesh/bhopal-bjps-big-dalit-face-jagdish-deora-becomes-deputy-cm-in-mp-becomes-mla-for-the-eighth-time-8255639"
    },
    {
        "title": "MANDLA (ST) Assembly Election Results 2023 - India TV News",
        "snippet": "The party has also announced the names of two deputy chief ministers -- Jagdish Devda and Rajendra Shukla. Meanwhile, Mohan Yadav was elected as the legislative party leader of the Madhya Pradesh BJP.",
        "sentiment": "4 (Positive)",
        "link": "https://www.indiatvnews.com/elections/madhya-pradesh-assembly-elections/mandla/constituencies-mandla-st"
    }
]