[
    {
        "title": "Bhopal drug bust: Congress accuses deputy CM of close links with ...",
        "snippet": "The opposition party demanded Jagdish Devda's resignation alleging that he has links with the kingpin of the drug racket busted recently in Madhya Pradesh. ... there has been a BJP government in ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.hindustantimes.com/india-news/bhopal-drug-bust-congress-accuses-deputy-cm-of-close-links-with-kingpin-questions-pm-modis-silence-101728649220051.html"
    },
    {
        "title": "Jagdish Devda - Wikipedia",
        "snippet": "Jagdish Devda is an Indian politician from the Bharatiya Janata Party currently serving as the deputy chief minister of Madhya Pradesh. He is representing Malhargarh Assembly constituency as an MLA for the 6th time in Madhya Pradesh Legislative Assembly. [1] Early life",
        "sentiment": "4 (Positive)",
        "link": "https://en.wikipedia.org/wiki/Jagdish_Devda"
    },
    {
        "title": "Madhya Pradesh: Congress seeks Dy CM's resignation over drug bust",
        "snippet": "CM Mohan Yadav, who is also the state's home minister is silent over the entire issue of one of his two deputy CMs Jagdish Devda's pictures with one of those arrested in the case,\" Patwari said.",
        "sentiment": "1 (Negative)",
        "link": "https://www.newindianexpress.com/nation/2024/Oct/12/madhya-pradesh-congress-seeks-dy-cms-resignation-over-drug-bust"
    },
    {
        "title": "Political Controversy in MP: Drug Case Links Deputy Chief Minister",
        "snippet": "The Congress party has called for the resignation of Madhya Pradesh Deputy Chief Minister Jagdish Devda, alleging his close connection to a suspect linked to a massive mephedrone drug haul conducted by Gujarat ATS and NCB. The incident has sparked political contention, underscoring alleged ties within the ruling BJP party.",
        "sentiment": "1 (Negative)",
        "link": "https://www.devdiscourse.com/article/politics/3113299-political-controversy-in-mp-drug-case-links-deputy-chief-minister"
    },
    {
        "title": "12 Madhya Pradesh ministers face criminal cases; 30 of 31 ... - The Week",
        "snippet": "CM Yadav and deputy chief ministers Rajendra Shukla, Jagdish Devda are crorepatis By Sravani Sarkar Updated: December 26, 2023 18:05 IST More than one-third of the ministers in the Mohan Yadav cabinet in Madhya Pradesh have criminal records, with 12 out of 31 declaring cases in their election affidavits.",
        "sentiment": "1 (Negative)",
        "link": "https://www.theweek.in/news/india/2023/12/26/12-madhya-pradesh-ministers-face-criminal-cases-30-of-31-have-assets-worth-over-rs-1-cr.html"
    },
    {
        "title": "Congress Demands Deputy CM Jagdish Devda's Resignation; Cites His Links ...",
        "snippet": "Bhopal (Madhya Pradesh): The Congress party on Monday sought resignation of deputy chief minister Jagdish Devda claiming he was close to an arrested accused in the case related to seizure of ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.freepressjournal.in/bhopal/congress-demands-deputy-cm-jagdish-devdas-resignation-cites-his-links-with-drug-factory-operators"
    },
    {
        "title": "Jagdish Devda Wiki, Age, Caste, Wife, Family, Biography & More",
        "snippet": "Jagdish Devda is an Indian lawyer and politician. He became the Deputy Chief Minister of Madhya Pradesh in the Bharatiya Janata Party (BJP) government on 11 ... (BJP) government on 11 December 2023. Devda is known for representing the Malhargarh Assembly constituency for eight consecutive terms. He briefly served as the temporary Speaker of the ...",
        "sentiment": "4 (Positive)",
        "link": "https://wikibio.in/jagdish-devda/"
    },
    {
        "title": "Jagdish Devda Age, Caste, Wife, Family, Biography & More",
        "snippet": "Some Lesser Known Facts About Jagdish Devda. Jagdish Devda is an Indian politician and lawyer. On 11 December 2023, he became the Deputy Chief Minister of Madhya Pradesh in the Bharatiya Janata Party (BJP) government. He is known for representing the Malhargarh Assembly constituency for eight consecutive terms.",
        "sentiment": "4 (Positive)",
        "link": "https://starsunfolded.com/jagdish-devda/"
    },
    {
        "title": "Dy CMs in Madhya Pradesh: BJP Appoints Two Deputy Chief Ministers ...",
        "snippet": "The BJP has appointed two deputy chief ministers, Jagdish Devda and Rajendra Shukla, in Madhya Pradesh for the first time. This move is aimed at maintaining caste equations. Read more about the ...",
        "sentiment": "4 (Positive)",
        "link": "https://timesofindia.indiatimes.com/city/bhopal/dy-cms-in-madhya-pradesh-bjp-appoints-two-deputy-chief-ministers/articleshow/105947364.cms"
    },
    {
        "title": "Jagdish _ Devda - India Leader",
        "snippet": "Read About Jagdish Devda, BJP, Malhargarh, Madhya Pradesh Assembly Elections : Jagdish Devda, an esteemed member of the Bharatiya Janata Party (BJP), is contesting from the Malhargarh constituency in Madhya Pradesh. At 66, he is the son of Late Gendalal Ji Devda and holds the 1104th position in Part no 56 as a registered voter in the Mandsour ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.indialeader.com/ViewLeader/47118/"
    },
    {
        "title": "Jagdish Devda(Bharatiya Janata Party(BJP)):Constituency ... - MyNeta",
        "snippet": "JAGDISH DEVDA (Winner) MALHARGARH (SC) (MANDSAUR) Party:BJP . S/o|D/o|W/o: Late. Gendalal Ji Devda . Age: 66 . Name Enrolled as Voter in: 224 Mandsour (Madhya Pradesh) constituency, at Serial no 1104 in Part no 56 . Self Profession:Salary and Rent Received as a Minister in Madhya Pradesh Government",
        "sentiment": "1 (Negative)",
        "link": "https://myneta.info/MadhyaPradesh2023/candidate.php?candidate_id=531"
    },
    {
        "title": "JAGDISH DEVDA(Bharatiya Janata Party(BJP)):Constituency ... - MyNeta",
        "snippet": "Home → Madhya Pradesh 2008 → Mandsour → Malhargarh → JAGDISH DEVDA(Criminal & Asset Declaration) Madhya Pradesh 2008. JAGDISH DEVDA (Winner) Malhargarh (Mandsour) Party:BJP . S/o|D/o|W/o: GENDA LALJI DEVDA . Age: 47 . Other Elections ; Declaration in Declared Assets Declared Cases; Madhya Pradesh 2023: Rs4,88,13,304 ~4 Crore+: 0: Madhya ...",
        "sentiment": "1 (Negative)",
        "link": "https://myneta.info/2008mp/candidate.php?candidate_id=251"
    },
    {
        "title": "BJP picks Jagdish Devda, Rajendra Shukla to be new Deputy chief ...",
        "snippet": "Jagdish Devda The party's candidate from Malhargath, Jagdish Devda won in the state assembly elections 2023 by a margin of 59,024 votes, defeating independent candidate Shyamlal Jokchand. Devda has been serving as Malhargarh MLA since 2008. He won three consecutive terms in 2008, 2013, and 2018.",
        "sentiment": "1 (Negative)",
        "link": "https://www.cnbctv18.com/politics/bjp-picks-jagdish-devda-rajendra-shukla-to-be-new-deputy-chief-ministers-of-madhya-pradesh-18539261.htm"
    },
    {
        "title": "jagdish devda madhya-pradesh malhargarh candidate Profile,Candidates ...",
        "snippet": "jagdish devda madhya-pradesh malhargarh candidate : jagdish devda madhya-pradesh malhargarh candidate Candidates Net Worth, Education, Property and Family Background Affidavit Submitted To ECI Latest News at ABP न्यूज़ | ABPLive ... (BJP) emerged as the single largest party, winning 105 seats, while its ally Shiv Sena secured 56 ...",
        "sentiment": "1 (Negative)",
        "link": "https://news.abplive.com/elections/jagdish-devda-madhya-pradesh-malhargarh-candidate-profile.html"
    },
    {
        "title": "Jagdish Devda Biography Who is Jagdish Devda Next Madhya Pradesh Deputy ...",
        "snippet": "MP Deputy CM Jagdish Devda Biography: मध्य प्रदेश में सभी कयासों पर विराम लगाते हुए ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.abplive.com/states/madhya-pradesh/jagdish-devda-biography-who-is-jagdish-devda-next-madhya-pradesh-deputy-cm-malhargarh-bjp-mla-2558486"
    },
    {
        "title": "Jagdish Devda , जगदीश देवड़ा , Malhargarh , मल्हारगढ़ , BJP , Madhya ...",
        "snippet": "Jagdish Devda , जगदीश देवड़ा , Malhargarh , मल्हारगढ़ , BJP , Madhya Pradesh , मध्यप्रदेश , jammu kashmir and haryana assembly election 2024. शुक्रवार, 17 जनवरी 2025 ... Jagdish Devda Biography In Hindi : मल्हारगढ़ विधानसभा ...",
        "sentiment": "4 (Positive)",
        "link": "https://hindi.webdunia.com/election-candidate/jagdish-devda-38.html"
    },
    {
        "title": "Meet the two new deputy CMs in MP: Jagdish Devda and Rajendra Shukla ...",
        "snippet": "The party also announced that Mohan will be assisted by two deputies - Jagdish Devda and Rajendra Shukla - in running the government. While Devda belongs to the Scheduled Caste (SC), Shukla has emerged as the undisputed Brahmin face in the Vindhya Pradesh region. ... In 1979, Devda joined the BJP's youth wing - the Bharatiya Janata Yuva ...",
        "sentiment": "4 (Positive)",
        "link": "https://indianexpress.com/article/political-pulse/meet-the-two-new-deputy-cms-in-mp-jagdish-devda-and-rajendra-shukla-who-rose-up-the-bjp-ranks-9065616/"
    },
    {
        "title": "Jagdish Devda to be Madhya Pradesh's Deputy CM: Who is he? Facts about ...",
        "snippet": "Who is Jagdish Devda? He has been an MLA from the BJP and serving from the Malhargarh constituency since 2008. He defeated Congress party's Shyamlal Jokchand with a margin of 3,688 votes in 2008.",
        "sentiment": "4 (Positive)",
        "link": "https://www.indiatvnews.com/madhya-pradesh/jagdish-devda-to-be-madhya-pradesh-deputy-chief-minister-who-is-he-cm-mohan-yadav-narendra-singh-tomar-jp-nadda-pm-narendra-modi-latest-updates-2023-12-11-906819"
    },
    {
        "title": "Who is Jagdish Devda, the new Madhya Pradesh deputy Chief Minister?",
        "snippet": "Jagdish Devda contested the Madhya Pradesh Assembly Elections 2023 from the Malhargarh seat and won the campaign by a margin of 59,024 votes. Republic World. ... Originally trained to be a lawyer, the 66-year-old leader began his political career with the BJP Yuva Morcha (BJYM) BJP's youth wing in 1979. ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.republicworld.com/elections/who-is-jagdish-devda-the-new-madhya-pradesh-deputy-chief-minister"
    },
    {
        "title": "Jagdish Dewra(Bharatiya Janata Party(BJP)):Constituency- MALHARGARH ...",
        "snippet": "Home → Madhya Pradesh 2013 → MANDSOUR → MALHARGARH → JAGDISH DEWRA(Criminal & Asset Declaration ... MALHARGARH (MANDSOUR) Party:BJP . S/o|D/o|W/o: Late. Gendalal . Age: 56 . Name Enrolled as Voter in: 224-Mandsour (Madhya Pradesh) constituency, at Serial no ... Loan to Jagdish Gendalal Devda 4,00,000 4 Lacs+: Loan to Jagdish Gendalal ...",
        "sentiment": "1 (Negative)",
        "link": "https://myneta.info/mp2013/candidate.php?candidate_id=122"
    },
    {
        "title": "MP Oath Taking Ceremony: Jagdish Devda, Rajendra Shukla swear in as ...",
        "snippet": "BJP leaders Jagdish Devda and Rajendra Shukla took oath as the Deputy Chief Ministers of Madhya Pradesh, in Bhopal. Prime Minister Narendra Modi and other senior NDA leaders attend the ceremony ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.indiatvnews.com/madhya-pradesh/madhya-pradesh-cm-swearing-in-ceremony-live-updates-mohan-yadav-take-oath-as-mp-chief-minister-in-presence-of-pm-modi-jagdish-devda-rajendra-shukl-bjp-2023-12-13-907066"
    },
    {
        "title": "MP's budget will be comprehensive & public centric: Jagdish Devda",
        "snippet": "Bhopal : Madhya Pradesh Finance Minister Jagdish Devda on Monday said the upcoming annual budget of the state government would be comprehensive and beneficial for all sections of the people. Devda ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.thehansindia.com/news/national/mps-budget-will-be-comprehensive-public-centric-jagdish-devda-886956"
    },
    {
        "title": "BJP Is Set To Secure Majority In State: Devda - Free Press Journal",
        "snippet": "Mandsaur (Madhya Pradesh): State finance minister Jagdish Devda highlighted the ruling BJP's achievement while addressing the Jan Aashirwad Yatra at the Crown Palace Auditorium in Mandsaur ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.freepressjournal.in/indore/bjp-is-set-to-secure-majority-in-state-devda"
    },
    {
        "title": "MP Budget FY25: Key takeaways from Finance Minister Jagdish Devda ...",
        "snippet": "Here are the key takeaways from MP Budget 2024-25 presented by Finance Minister Jagdish Devda A Provision of Rs 26,560 crore for women and child development in the Madhya Pradesh Budget for 2024-25.",
        "sentiment": "4 (Positive)",
        "link": "https://www.financialexpress.com/policy/economy-mp-budget-2024-25-key-takeaways-from-finance-minister-jagdish-devda-speech-in-madhya-pradesh-assembly-3542426/"
    },
    {
        "title": "Jagdish Devda, BJP Candidate from Malhargarh Assembly Election ... - News18",
        "snippet": "Jagdish Devda representing the BJP contesting for the Malhargarh Assembly Election 2024 Seat. Know His/her opponents, age, educational background, constituency details, electoral track record, date of birth, and more on News18 - Assembly Election 2024 Result News",
        "sentiment": "1 (Negative)",
        "link": "https://www.news18.com/elections/assembly/madhya-pradesh/jagdish-devda-s12aed2008a225e2023c001/"
    },
    {
        "title": "Malhargarh Election Result 2023 Live: Bjp के Jagdish Devda की हुई जीत ...",
        "snippet": "मतगणना में, Bjp के Jagdish Devda जीतें. मध्य प्रदेश चुनाव 2023 परिणामों (मध्य प्रदेश Election 2023 Results) में Malhargarh विधानसभा सीट पर Bsp के Narendra Malviya इस दौड़ दूसरे नंबर ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.abplive.com/elections/malhargarh-election-result-2023-live-updates-constituency-vote-counting-winner-loser-bjp-congress-bsp-aap-mp-assembly-election-results-news-2551041"
    },
    {
        "title": "Jagdish Devda Latest News, Photos and Videos - India TV News",
        "snippet": "Jagdish Devda to be Madhya Pradesh's Deputy CM: Who is he? Facts about BJP leader December 11, 2023 19:43 IST . The BJP announced the names of new Chief Minister and Deputy Chief Ministers in ...",
        "sentiment": "3 (Neutral)",
        "link": "https://www.indiatvnews.com/topic/jagdish-devda"
    },
    {
        "title": "Rajesh Dixit, A Supporter Of Deputy Chief Minister Jagdish Devda ...",
        "snippet": "Hindi News › Madhya Pradesh › Rajesh Dixit, a supporter of Deputy Chief Minister Jagdish Devda, became the BJP district president",
        "sentiment": "2 (Negative)",
        "link": "https://www.amarujala.com/madhya-pradesh/mandsaur/rajesh-dixit-a-supporter-of-deputy-chief-minister-jagdish-devda-became-the-bjp-district-president-mandsaur-news-c-1-1-noi1351-2526248-2025-01-15"
    },
    {
        "title": "BJP leaders Jagdish Devda and Rajendra Shukla take oath as Deputy CM of ...",
        "snippet": "BHOPAL: BJP leaders Jagdish Devda and Rajendra Shukla took oath as the Deputy Chief Ministers of Madhya Pradesh in Bhopal on Wednesday.Earlier BJP MLA Mohan Yadav took oath as the Chief Minister of the state. Governor Mangubhai C. Patel administered the oath of office to him at the sprawling Motilal Nehru Stadium, Lal Parade Ground in Bhopal.",
        "sentiment": "4 (Positive)",
        "link": "https://www.dtnext.in/news/national/bjp-leaders-jagdish-devda-and-rajendra-shukla-take-oath-as-deputy-cm-of-madhya-pradesh-754170"
    },
    {
        "title": "Photos Of Drug Haul Case Accused With Deputy CM Jagdish Devda Goes Viral",
        "snippet": "Bhopal (Madhya Pradesh): A photograph of Deputy Chief Minister Jagdish Devda, with Harish Anjana who was arrested in connection with Rs 1,814 crore drugs trafficking case, has heated up political ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.freepressjournal.in/bhopal/photos-of-drug-haul-case-accused-with-deputy-cm-jagdish-devda-goes-viral"
    },
    {
        "title": "Jagdish Devda - The Indian Express",
        "snippet": "BJP's Jagdish Devda was sworn in as deputy CM of Madhya Pradesh after the party registered a resounding victory in the 2023 assembly polls. Born in Rampura village of Neemuch district, Devda (66) was finance minister in the Shivraj Singh Chouhan government before being elevated to the post of deputy CM.",
        "sentiment": "4 (Positive)",
        "link": "https://indianexpress.com/about/jagdish-devda/"
    },
    {
        "title": "Malhargarh Election Result 2023 Live: Bjp Candidate Jagdish Devda Wins ...",
        "snippet": "Malhargarh Assembly Election Results 2023 LIVE: Catch latest win-loss tally and vote counting updates from Madhya Pradesh Election 2023 here. Malhargarh constituency number of Madhya Pradesh, was won by Jagdish Devda in 2018 from BJP who secured 66138 votes.",
        "sentiment": "1 (Negative)",
        "link": "https://news.abplive.com/elections/malhargarh-election-result-2023-live-updates-constituency-vote-counting-winner-loser-bjp-congress-bsp-mp-assembly-election-results-news-1647009"
    },
    {
        "title": "Malhargarh Election Result 2023 LIVE: BJP's Jagdish Devda ... - CNBCTV18",
        "snippet": "During the 2018 polls, Dewra defeated Sisodia by 11,872 votes. The BJP leader garnered 99,839 votes, securing 51.03% of the vote share. In percentage terms, the victory margin was 6.07%.",
        "sentiment": "4 (Positive)",
        "link": "https://www.cnbctv18.com/politics/malhargarh-election-result-2023-live-how-to-check-madhya-pradesh-legislative-assembly-poll-winners-news-bjp-congress-jagdish-dewra-parshuram-sisodia-18463441.htm"
    },
    {
        "title": "BJP's Mohan Yadav takes oath as Madhya Pradesh CM; Rajendra Shukla ...",
        "snippet": "BJP's Mohan Yadav on Wednesday took oath as the chief minister of Madhya Pradesh. ... From Adani bribery allegations to PayTM Bank ban: Six shocks that rocked India Inc in 2024 ... Rajendra Shukla and Jagdish Devda- also took the charge officially on Wednesday. Former Madhya Pradesh CM Shivraj Singh Chouhan arrived at the venue. Other BJP ...",
        "sentiment": "4 (Positive)",
        "link": "https://economictimes.indiatimes.com/news/politics-and-nation/bjps-mohan-yadav-takes-oath-as-madhya-pradesh-cm/articleshow/105951548.cms"
    },
    {
        "title": "Seven-time MLA, know who is Jagdish Devda, who will become - India Herald",
        "snippet": "Jagdish Deora is currently bjp mla from Malhargarh assembly seat of Mandsaur. The newly appointed Deputy. Chief minister of madhya pradesh, Jagdish Deora belongs to the scheduled caste of the state. He was born on 1. July 1957 in Neemuch district. Jagdish Deora is a social worker and lawyer by profession. He started his political",
        "sentiment": "4 (Positive)",
        "link": "https://www.indiaherald.com/Politics/Read/994657891/Seventime-MLA-know-who-is-Jagdish-Devda-who-will-become-Deputy-CM"
    },
    {
        "title": "Jagdish Devda Named Deputy Chief Minister Of Madhya Pradesh; Know All ...",
        "snippet": "Jagdish Devda started his political career as a student leader and was the President of the Student Union of Government College, Rampura in 1979. ... Know All About Six-Time BJP MLA And Former MP ...",
        "sentiment": "2 (Negative)",
        "link": "https://english.jagran.com/india/jagdish-deora-named-deputy-chief-minister-of-madhya-pradesh-know-all-about-sixtime-bjp-mla-and-former-mp-finance-minister-10119592"
    },
    {
        "title": "Jagdish Devda Wiki, Biography, Age, Deputy CM, Family - Right Rasta",
        "snippet": "Who is Jagdish Devda. Jagdish Devda is a Madhya Pradesh politician who now serves as the state's Deputy Chief Minister in the newly elected BJP cabinet. He was elected to the Malhargarh Assembly seat eight times. In the Fourth Chouhan Ministry, he also handled positions such as Commercial Taxes, Planning, Economics, and Statistics.",
        "sentiment": "4 (Positive)",
        "link": "https://www.rightrasta.com/jagdish-devda-wiki/"
    },
    {
        "title": "Shri Jagdish Devda | Bharatiya Janata Party - api.bjp.org",
        "snippet": "Bharatiya Janata Party is the largest political party. Details about founders. Dr. Syama Prasad Mookerjee; Pandit Deendayal Upadhyaya",
        "sentiment": "5 (Positive)",
        "link": "https://api.bjp.org/shri-jagdish-devda"
    },
    {
        "title": "Who is Jagdish Devda MP Deputy CM, biography, age, family, education ...",
        "snippet": "Known for his dedication and sociopolitical acumen, Devda swiftly climbed the party's hierarchy. Jagdish Devda career. The recent political landscape in Madhya Pradesh witnessed the BJP taking a decisive step by appointing Mohan Yadav as the Chief Minister, accompanied by Rajendra Shukla and Jagdish Devda as Deputy Chief Ministers.",
        "sentiment": "4 (Positive)",
        "link": "https://thesportsgrail.com/who-is-jagdish-devda-mp-deputy-cm-biography-age-family-education-cast-net-worth/"
    },
    {
        "title": "Jagdish Dewda (Bharatiya Janata Party (BJP)):Constituency- MALHARGARH ...",
        "snippet": "JAGDISH DEWDA (Winner) MALHARGARH (SC) (MANDSOUR) Party:BJP . S/o|D/o|W/o: Late Shri Gaindalal Ji Dewda . Age: 61 . Name Enrolled as Voter in: 224 Mandsour (Madhya Pradesh) constituency, at Serial no 1139 in Part no 56 . Self Profession:Madhya Pradesh Vidhan Sabha Member Salary",
        "sentiment": "1 (Negative)",
        "link": "https://myneta.info/madhyapradesh2018/candidate.php?candidate_id=3348"
    },
    {
        "title": "Malhargarh Election Result 2023 LIVE Updates and Highlights: Jagdish ...",
        "snippet": "In the 2008 elections, Jagdish Devda of BJP won this seat beating Shyam Lal Jok Chandra of INC by a margin of 3,688 votes which was 2.61% of the total votes polled in the constituency. INC had a vote share of 46.82% in the seat. LOCATION. The geographic coordinates of Malhargarh is: 24°08'29.0\"N 75°08'39.1\"E. Malhargarh shares its borders ...",
        "sentiment": "3 (Neutral)",
        "link": "https://www.news18.com/elections/malhargarh-election-result-2023-live-updates-and-highlights-winner-loser-leading-trailing-mla-margin-8687451.html"
    },
    {
        "title": "20 साल बाद मध्य प्रदेश को मिलेंगे दो डिप्टी सीएम, बीजेपी ने बनाया जातीय ...",
        "snippet": "Hindi News State Madhya pradesh Deputy cm formula in madhya pradesh after 35 years bjp rajendra shukla jagdish devda caste combination mission 2024. 20 साल बाद मध्य प्रदेश को मिलेंगे दो डिप्टी सीएम, बीजेपी ने बनाया जातीय ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.tv9hindi.com/state/madhya-pradesh/deputy-cm-formula-in-madhya-pradesh-after-35-years-bjp-rajendra-shukla-jagdish-devda-caste-combination-mission-2024-2282030.html"
    },
    {
        "title": "Central BJP settles in new MP CM, bustle to start after portfolio ...",
        "snippet": "It's been almost half-a-month since Chief Minister Mohan Yadav along with his two Cabinet colleagues and deputies - Rajendra Shukla and Jagdish Devda took oath after the BJP registered a ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.thehansindia.com/news/national/central-bjp-settles-in-new-mp-cm-bustle-to-start-after-portfolio-allocation-to-ministers-847127"
    },
    {
        "title": "Cong demands MP Dy CM's resignation - The Statesman",
        "snippet": "Cong demands MP Dy CM's resignation . The opposition Congress in Madhya Pradesh has demanded resignation of Deputy Chief Minister Jagdish Devda, alleging that one of the three accused arrested ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.thestatesman.com/india/cong-demands-mp-dy-cms-resignation-1503350944.html"
    },
    {
        "title": "MP Budget: Amid Opposition's uproar, finance minister Jagdish Devda ...",
        "snippet": "Bhopal (Madhya Pradesh): Amid opposition's uproar, Finance Minister Jagdish Devda has presented the state budget worth Rs 2,79,237 lakh crore for 2022-23. There is a fiscal deficit worth Rs 55111 ...",
        "sentiment": "2 (Negative)",
        "link": "https://www.freepressjournal.in/bhopal/bhopal-finance-minister-jagdish-dewda-to-present-mp-budget-today"
    },
    {
        "title": "Congress questions PM Modi's 'silence' over ... - The Economic Times",
        "snippet": "Congress alleges a close associate of Madhya Pradesh Deputy CM Jagdish Devda is involved in drug trade following a major drug haul in Bhopal. They criticize PM Modi's silence on the issue and highlight the worsening drug addiction problem, purportedly affecting 40 crore people in India. ... The situation is such that even BJP leaders and ...",
        "sentiment": "1 (Negative)",
        "link": "https://economictimes.indiatimes.com/news/politics-and-nation/congress-questions-pm-modis-silence-over-growing-drug-trade-in-mp-slams-bjp/articleshow/114150334.cms"
    },
    {
        "title": "Jagdish Devda, Rajendra Shukla to be new Deputy CMs of ... - Devdiscourse",
        "snippet": "The Bharatiya Janata Party (BJP) on Monday selected Jagdish Devda and Rajendra Shukla as the new Deputy Chief Ministers of Madhya Pradesh. The decision was taken in the Legislative party meeting conducted in Bhopal in the presence of the central observers Haryana Chief Minister Manohar Lal Khattar, OBC Morcha head K Laxman and secretary Asha Lakra.",
        "sentiment": "4 (Positive)",
        "link": "https://www.devdiscourse.com/article/politics/2743077-jagdish-devda-rajendra-shukla-to-be-new-deputy-cms-of-madhya-pradesh"
    },
    {
        "title": "Congress Alleges Drug Case Link to MP Minister, BJP Denies",
        "snippet": "Bhopal: A political row on Monday erupted after the Congress linked a person, arrested in connection with the seizure of a facility manufacturing banned mephedrone (MD) drug here a couple of days...",
        "sentiment": "1 (Negative)",
        "link": "https://www.deccanchronicle.com/nation/current-affairs/mp-congress-links-drug-trafficking-accused-with-mp-mantri-bjp-calls-it-white-lie-mischievous-1828711"
    },
    {
        "title": "Bhopal Drug Bust: MP Congress Alleges Deputy CM's Close ... - ABP LIVE",
        "snippet": "Madhya Pradesh Congress accuses Deputy Chief Minister Jagdish Devda of involvement in a recent massive drug haul near Bhopal, demanding his resignation. ... Patwari demanded Devda's resignation and criticised the BJP for its inaction on the matter. According to news agency PTI, Patwari claimed, \"Prime Minister Modi did not provide two crore ...",
        "sentiment": "1 (Negative)",
        "link": "https://news.abplive.com/cities/bhopal-drug-bust-mp-congress-jitendra-patwari-alleges-deputy-cm-jagdish-devda-close-aide-involved-in-racket-questions-cm-mohan-yadav-pm-modi-1723695"
    },
    {
        "title": "Mega drug haul in Bhopal: Cong seeks MP Dy CM Devda's resignation, BJP ...",
        "snippet": "Bhopal, Oct 7 (PTI) The Congress on Monday sought the resignation of Madhya Pradesh Deputy Chief Minister Jagdish Devda claiming he was close to a man arrested in the case related to seizure of mephedrone worth Rs 1,814 crore by the Gujarat ATS and NCB from a factory in Bhopal. The BJP hit back with […]",
        "sentiment": "1 (Negative)",
        "link": "https://theprint.in/india/mega-drug-haul-in-bhopal-cong-seeks-mp-dy-cm-devdas-resignation-bjp-hits-back/2301275/"
    },
    {
        "title": "Deputy CM in MP: आठ बार के विधायक जगदीश देवड़ा ने ली डिप्टी CM पद की ...",
        "snippet": "Jagdish Devda: डिजिटल डेस्क, भोपाल। मध्यप्रदेश में थावरचंद गहलोत के बाद ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.naidunia.com/madhya-pradesh/bhopal-bjps-big-dalit-face-jagdish-deora-becomes-deputy-cm-in-mp-becomes-mla-for-the-eighth-time-8255639"
    }
]