[
    {
        "title": "Jagdish Devda(Bharatiya Janata Party(BJP)):Constituency ... - MyNeta",
        "snippet": "JAGDISH DEVDA (Winner) MALHARGARH (SC) (MANDSAUR) ... Gendalal Ji Devda . Age: 66 . Name Enrolled as Voter in: 224 Mandsour (Madhya Pradesh) constituency, at Serial no 1104 in Part no 56 . Self Profession:Salary and Rent Received as a ... Whether any other liabilities are in dispute, if so, mention the amount involved and the authority before ...",
        "sentiment": "1 (Negative)",
        "link": "https://myneta.info/MadhyaPradesh2023/candidate.php?candidate_id=531"
    },
    {
        "title": "Bhopal Drug Bust: MP Congress Alleges Deputy CM's Close ... - ABP LIVE",
        "snippet": "Madhya Pradesh Congress accuses Deputy Chief Minister Jagdish Devda of involvement in a recent massive drug haul near Bhopal, demanding his resignation. ... Patwari demanded Devda's resignation and criticised the BJP for its inaction on the matter. According to news agency PTI, Patwari claimed, \"Prime Minister Modi did not provide two crore ...",
        "sentiment": "1 (Negative)",
        "link": "https://news.abplive.com/cities/bhopal-drug-bust-mp-congress-jitendra-patwari-alleges-deputy-cm-jagdish-devda-close-aide-involved-in-racket-questions-cm-mohan-yadav-pm-modi-1723695"
    },
    {
        "title": "Land Scandal: Cong Accuses Deputy CM's Son, BJP Leaders Of Corruption ...",
        "snippet": "When questioned by the media about his son's land ownership, Jagdish Devda chose not to respond and instead held a closed-door meeting with BJP State President VD Sharma, the details of which ...",
        "sentiment": "2 (Negative)",
        "link": "https://www.freepressjournal.in/bhopal/land-scandal-cong-accuses-deputy-cms-son-bjp-leaders-of-corruption-in-bhopal"
    },
    {
        "title": "Jagdish Devda - Wikipedia",
        "snippet": "Jagdish Devda is an Indian politician from the Bharatiya Janata Party currently serving as the deputy chief minister of Madhya Pradesh. He is representing Malhargarh Assembly constituency as an MLA for the 6th time in Madhya Pradesh Legislative Assembly. [1] Early life",
        "sentiment": "4 (Positive)",
        "link": "https://en.wikipedia.org/wiki/Jagdish_Devda"
    },
    {
        "title": "Bhopal drug bust: Congress accuses deputy CM of close links with ...",
        "snippet": "The opposition party demanded Jagdish Devda's resignation alleging that he has links with the kingpin of the drug racket busted recently in Madhya Pradesh. ... there has been a BJP government in ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.hindustantimes.com/india-news/bhopal-drug-bust-congress-accuses-deputy-cm-of-close-links-with-kingpin-questions-pm-modis-silence-101728649220051.html"
    },
    {
        "title": "Political Controversy in MP: Drug Case Links Deputy Chief Minister",
        "snippet": "The Congress party has called for the resignation of Madhya Pradesh Deputy Chief Minister Jagdish Devda, alleging his close connection to a suspect linked to a massive mephedrone drug haul conducted by Gujarat ATS and NCB. The incident has sparked political contention, underscoring alleged ties within the ruling BJP party.",
        "sentiment": "1 (Negative)",
        "link": "https://www.devdiscourse.com/article/politics/3113299-political-controversy-in-mp-drug-case-links-deputy-chief-minister"
    },
    {
        "title": "Jagdish Devda Age, Caste, Wife, Family, Biography & More",
        "snippet": "Some Lesser Known Facts About Jagdish Devda. Jagdish Devda is an Indian politician and lawyer. On 11 December 2023, he became the Deputy Chief Minister of Madhya Pradesh in the Bharatiya Janata Party (BJP) government. He is known for representing the Malhargarh Assembly constituency for eight consecutive terms.",
        "sentiment": "4 (Positive)",
        "link": "https://starsunfolded.com/jagdish-devda/"
    },
    {
        "title": "JAGDISH DEVDA(Bharatiya Janata Party(BJP)):Constituency ... - MyNeta",
        "snippet": "Home → Madhya Pradesh 2008 → Mandsour → Malhargarh → JAGDISH DEVDA(Criminal & Asset Declaration) Madhya Pradesh 2008. JAGDISH DEVDA (Winner) Malhargarh (Mandsour) Party:BJP . S/o|D/o|W/o: GENDA LALJI DEVDA . Age: 47 . Other Elections ; Declaration in Declared Assets Declared Cases; Madhya Pradesh 2023: Rs4,88,13,304 ~4 Crore+: 0: Madhya ...",
        "sentiment": "1 (Negative)",
        "link": "https://myneta.info/2008mp/candidate.php?candidate_id=251"
    },
    {
        "title": "Jagdish _ Devda - India Leader",
        "snippet": "Read About Jagdish Devda, BJP, Malhargarh, Madhya Pradesh Assembly Elections : Jagdish Devda, an esteemed member of the Bharatiya Janata Party (BJP), is contesting from the Malhargarh constituency in Madhya Pradesh. At 66, he is the son of Late Gendalal Ji Devda and holds the 1104th position in Part no 56 as a registered voter in the Mandsour ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.indialeader.com/ViewLeader/47118/"
    },
    {
        "title": "Jagdish Devda Biography Who is Jagdish Devda Next Madhya Pradesh Deputy ...",
        "snippet": "MP Deputy CM Jagdish Devda Biography: मध्य प्रदेश में सभी कयासों पर विराम लगाते हुए ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.abplive.com/states/madhya-pradesh/jagdish-devda-biography-who-is-jagdish-devda-next-madhya-pradesh-deputy-cm-malhargarh-bjp-mla-2558486"
    },
    {
        "title": "jagdish devda madhya-pradesh malhargarh candidate Profile,Candidates ...",
        "snippet": "jagdish devda madhya-pradesh malhargarh candidate : jagdish devda madhya-pradesh malhargarh candidate Candidates Net Worth, Education, Property and Family Background Affidavit Submitted To ECI Latest News at ABP न्यूज़ | ABPLive ... In the 2019 Maharashtra Assembly Election, the Bharatiya Janata Party (BJP) emerged as the single ...",
        "sentiment": "1 (Negative)",
        "link": "https://news.abplive.com/elections/jagdish-devda-madhya-pradesh-malhargarh-candidate-profile.html"
    },
    {
        "title": "Shri Jagdish Devda | Bharatiya Janata Party - api.bjp.org",
        "snippet": "Bharatiya Janata Party is the largest political party. Details about founders. Dr. Syama Prasad Mookerjee; Pandit Deendayal Upadhyaya",
        "sentiment": "5 (Positive)",
        "link": "https://api.bjp.org/shri-jagdish-devda"
    },
    {
        "title": "Jagdish Devda Named Deputy Chief Minister Of Madhya Pradesh; Know All ...",
        "snippet": "Jagdish Devda started his political career as a student leader and was the President of the Student Union of Government College, Rampura in 1979. ... Know All About Six-Time BJP MLA And Former MP ...",
        "sentiment": "2 (Negative)",
        "link": "https://english.jagran.com/india/jagdish-deora-named-deputy-chief-minister-of-madhya-pradesh-know-all-about-sixtime-bjp-mla-and-former-mp-finance-minister-10119592"
    },
    {
        "title": "Jagdish Devda , जगदीश देवड़ा , Malhargarh , मल्हारगढ़ , BJP , Madhya ...",
        "snippet": "Jagdish Devda , जगदीश देवड़ा , Malhargarh , मल्हारगढ़ , BJP , Madhya Pradesh , मध्यप्रदेश , jammu kashmir and haryana assembly election 2024. शुक्रवार, 17 जनवरी 2025 ... Jagdish Devda Biography In Hindi : मल्हारगढ़ विधानसभा ...",
        "sentiment": "4 (Positive)",
        "link": "https://hindi.webdunia.com/election-candidate/jagdish-devda-38.html"
    },
    {
        "title": "Jagdish Devda Wiki, Age, Caste, Wife, Family, Biography & More",
        "snippet": "Jagdish Devda is an Indian lawyer and politician. He became the Deputy Chief Minister of Madhya Pradesh in the Bharatiya Janata Party (BJP) government on 11 ... (BJP) government on 11 December 2023. Devda is known for representing the Malhargarh Assembly constituency for eight consecutive terms. He briefly served as the temporary Speaker of the ...",
        "sentiment": "4 (Positive)",
        "link": "https://wikibio.in/jagdish-devda/"
    },
    {
        "title": "Jagdish Devda Wiki, Biography, Age, Deputy CM, Family - Right Rasta",
        "snippet": "Who is Jagdish Devda. Jagdish Devda is a Madhya Pradesh politician who now serves as the state's Deputy Chief Minister in the newly elected BJP cabinet. He was elected to the Malhargarh Assembly seat eight times. In the Fourth Chouhan Ministry, he also handled positions such as Commercial Taxes, Planning, Economics, and Statistics.",
        "sentiment": "4 (Positive)",
        "link": "https://www.rightrasta.com/jagdish-devda-wiki/"
    },
    {
        "title": "Jagdish Dewra(Bharatiya Janata Party(BJP)):Constituency- MALHARGARH ...",
        "snippet": "Home → Madhya Pradesh 2013 → MANDSOUR → MALHARGARH → JAGDISH DEWRA(Criminal & Asset Declaration) Madhya Pradesh 2013. ... Loan to Jagdish Gendalal Devda 4,00,000 4 Lacs+: Loan to Jagdish Gendalal Devda 2,05,000 ... Whether any other liabilities are in dispute, if so, mention the amount involved and the authority before which it is ...",
        "sentiment": "1 (Negative)",
        "link": "https://myneta.info/mp2013/candidate.php?candidate_id=122"
    },
    {
        "title": "BJP picks Jagdish Devda, Rajendra Shukla to be new Deputy chief ...",
        "snippet": "Jagdish Devda The party's candidate from Malhargath, Jagdish Devda won in the state assembly elections 2023 by a margin of 59,024 votes, defeating independent candidate Shyamlal Jokchand. Devda has been serving as Malhargarh MLA since 2008. He won three consecutive terms in 2008, 2013, and 2018.",
        "sentiment": "1 (Negative)",
        "link": "https://www.cnbctv18.com/politics/bjp-picks-jagdish-devda-rajendra-shukla-to-be-new-deputy-chief-ministers-of-madhya-pradesh-18539261.htm"
    },
    {
        "title": "Malhargarh Election Result 2023 Live: Bjp के Jagdish Devda की हुई जीत ...",
        "snippet": "मतगणना में, Bjp के Jagdish Devda जीतें. मध्य प्रदेश चुनाव 2023 परिणामों (मध्य प्रदेश Election 2023 Results) में Malhargarh विधानसभा सीट पर Bsp के Narendra Malviya इस दौड़ दूसरे नंबर ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.abplive.com/elections/malhargarh-election-result-2023-live-updates-constituency-vote-counting-winner-loser-bjp-congress-bsp-aap-mp-assembly-election-results-news-2551041"
    },
    {
        "title": "Jagdish Devda to be Madhya Pradesh's Deputy CM: Who is he? Facts about ...",
        "snippet": "Who is Jagdish Devda? He has been an MLA from the BJP and serving from the Malhargarh constituency since 2008. He defeated Congress party's Shyamlal Jokchand with a margin of 3,688 votes in 2008.",
        "sentiment": "4 (Positive)",
        "link": "https://www.indiatvnews.com/madhya-pradesh/jagdish-devda-to-be-madhya-pradesh-deputy-chief-minister-who-is-he-cm-mohan-yadav-narendra-singh-tomar-jp-nadda-pm-narendra-modi-latest-updates-2023-12-11-906819"
    },
    {
        "title": "Malhargarh Election Result 2023 Live: Bjp Candidate Jagdish Devda Wins ...",
        "snippet": "Malhargarh Assembly Election Results 2023 LIVE: Catch latest win-loss tally and vote counting updates from Madhya Pradesh Election 2023 here. Malhargarh constituency number of Madhya Pradesh, was won by Jagdish Devda in 2018 from BJP who secured 66138 votes.",
        "sentiment": "1 (Negative)",
        "link": "https://news.abplive.com/elections/malhargarh-election-result-2023-live-updates-constituency-vote-counting-winner-loser-bjp-congress-bsp-mp-assembly-election-results-news-1647009"
    },
    {
        "title": "Mega drug haul in Bhopal: Cong seeks MP Dy CM Devda's resignation, BJP ...",
        "snippet": "Bhopal, Oct 7 (PTI) The Congress on Monday sought the resignation of Madhya Pradesh Deputy Chief Minister Jagdish Devda claiming he was close to a man arrested in the case related to seizure of mephedrone worth Rs 1,814 crore by the Gujarat ATS and NCB from a factory in Bhopal. The BJP hit back with […]",
        "sentiment": "1 (Negative)",
        "link": "https://theprint.in/india/mega-drug-haul-in-bhopal-cong-seeks-mp-dy-cm-devdas-resignation-bjp-hits-back/2301275/"
    },
    {
        "title": "Who is Jagdish Devda MP Deputy CM, biography, age, family, education ...",
        "snippet": "Known for his dedication and sociopolitical acumen, Devda swiftly climbed the party's hierarchy. Jagdish Devda career. The recent political landscape in Madhya Pradesh witnessed the BJP taking a decisive step by appointing Mohan Yadav as the Chief Minister, accompanied by Rajendra Shukla and Jagdish Devda as Deputy Chief Ministers.",
        "sentiment": "4 (Positive)",
        "link": "https://thesportsgrail.com/who-is-jagdish-devda-mp-deputy-cm-biography-age-family-education-cast-net-worth/"
    },
    {
        "title": "Jagdish Devda(Bharatiya Janata Party(BJP)):Constituency- MALHARGARH (SC ...",
        "snippet": "JAGDISH DEVDA MALHARGARH (SC) (MANDSAUR) Party:BJP . S/o|D/o|W/o: Late. Gendalal Ji Devda . Age: 66 . Name Enrolled as Voter in: 224 Mandsour (Madhya Pradesh) constituency, at Serial no 1104 in Part no 56 . Self Profession:Salary and Rent Received as a Minister in Madhya Pradesh Government",
        "sentiment": "1 (Negative)",
        "link": "https://mail.myneta.info/MadhyaPradesh2023/candidate.php?candidate_id=531"
    },
    {
        "title": "20 साल बाद मध्य प्रदेश को मिलेंगे दो डिप्टी सीएम, बीजेपी ने बनाया जातीय ...",
        "snippet": "Hindi News State Madhya pradesh Deputy cm formula in madhya pradesh after 35 years bjp rajendra shukla jagdish devda caste combination mission 2024. 20 साल बाद मध्य प्रदेश को मिलेंगे दो डिप्टी सीएम, बीजेपी ने बनाया जातीय ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.tv9hindi.com/state/madhya-pradesh/deputy-cm-formula-in-madhya-pradesh-after-35-years-bjp-rajendra-shukla-jagdish-devda-caste-combination-mission-2024-2282030.html"
    },
    {
        "title": "Jagdish Devda, BJP Candidate from Malhargarh Assembly Election ... - News18",
        "snippet": "Jagdish Devda representing the BJP contesting for the Malhargarh Assembly Election 2024 Seat. Know His/her opponents, age, educational background, constituency details, electoral track record, date of birth, and more on News18 - Assembly Election 2024 Result News",
        "sentiment": "1 (Negative)",
        "link": "https://www.news18.com/elections/assembly/madhya-pradesh/jagdish-devda-s12aed2008a225e2023c001/"
    },
    {
        "title": "End Of Shiv'Raj' In Madhya Pradesh: Ujjain South MLA Mohan Yadav Is New ...",
        "snippet": "Bhopal: Ending the suspense over Madhya Pradesh CM name, the Bharatiya Janata Party (BJP) on Monday (December 11) named MLA Mohan Yadav as the new CM of the state. The 58-year-old Mohan Yadav is ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.freepressjournal.in/madhya-pradesh/end-of-shivraj-in-madhya-pradesh-ujjain-south-mla-mohan-yadav-is-new-mp-cm"
    },
    {
        "title": "Malhargarh Election Result 2023 Live Updates: BJP Won In ... - The Quint",
        "snippet": "In the MP state Assembly election 2023 for Malhargarh constituency, BJP has fielded Jagdish Devda against Congress' Parshuram Sisodiya. BJP has won in this seat of Madhya Pradesh.",
        "sentiment": "4 (Positive)",
        "link": "https://www.thequint.com/elections/madhya-pradesh-election/malhargarh-election-result-2023-live-updates-counting-of-votes-mp-assembly-elections-bjp-congress-candidate-2"
    },
    {
        "title": "Madhya Pradesh: Congress seeks Dy CM's resignation over drug bust",
        "snippet": "Deputy CM Jagdish Devda, while denying the allegations, however, had said, \"Many people come and get pictures with persons who are in public and political life. By getting his picture clicked ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.newindianexpress.com/nation/2024/Oct/12/madhya-pradesh-congress-seeks-dy-cms-resignation-over-drug-bust"
    },
    {
        "title": "Cong demands MP Dy CM's resignation - The Statesman",
        "snippet": "Cong demands MP Dy CM's resignation . The opposition Congress in Madhya Pradesh has demanded resignation of Deputy Chief Minister Jagdish Devda, alleging that one of the three accused arrested ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.thestatesman.com/india/cong-demands-mp-dy-cms-resignation-1503350944.html"
    },
    {
        "title": "Who is Jagdish Devda, the new Madhya Pradesh deputy Chief Minister?",
        "snippet": "Jagdish Devda contested the Madhya Pradesh Assembly Elections 2023 from the Malhargarh seat and won the campaign by a margin of 59,024 votes. Republic World. ... Originally trained to be a lawyer, the 66-year-old leader began his political career with the BJP Yuva Morcha (BJYM) BJP's youth wing in 1979. ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.republicworld.com/elections/who-is-jagdish-devda-the-new-madhya-pradesh-deputy-chief-minister"
    },
    {
        "title": "Jagdish Devda Latest News, Photos and Videos - India TV News",
        "snippet": "Jagdish Devda to be Madhya Pradesh's Deputy CM: Who is he? Facts about BJP leader December 11, 2023 19:43 IST . The BJP announced the names of new Chief Minister and Deputy Chief Ministers in ...",
        "sentiment": "3 (Neutral)",
        "link": "https://www.indiatvnews.com/topic/jagdish-devda"
    },
    {
        "title": "Asset and declared cases comparison:Jagdish Devda",
        "snippet": "Jagdish Devda:Comparison among different profiles avialable on myneta. Name Constituency Age Party Code Criminal Cases Number of Cases Education Level Total Assets Total Liabilities PAN Given (Y or N) Jagdish Devda in Madhya Pradesh 2023: MALHARGARH (SC) 66: BJP: No: 0: Post Graduate: 4,88,13,304 ~ 4 Crore+: 14,05,000 ~ 14 Lacs+: Y: Jagdish ...",
        "sentiment": "1 (Negative)",
        "link": "https://myneta.info/compare_profile.php?group_id=wJfGFrJ5XQpAkrhWfmP8"
    },
    {
        "title": "Malhargarh Election Result 2023 LIVE: BJP's Jagdish Devda ... - CNBCTV18",
        "snippet": "During the 2018 polls, Dewra defeated Sisodia by 11,872 votes. The BJP leader garnered 99,839 votes, securing 51.03% of the vote share. In percentage terms, the victory margin was 6.07%.",
        "sentiment": "4 (Positive)",
        "link": "https://www.cnbctv18.com/politics/malhargarh-election-result-2023-live-how-to-check-madhya-pradesh-legislative-assembly-poll-winners-news-bjp-congress-jagdish-dewra-parshuram-sisodia-18463441.htm"
    },
    {
        "title": "Jagdish Devda Bjp News in Hindi, Latest Jagdish Devda Bjp News - India.Com",
        "snippet": "Get latest Jagdish Devda Bjp news in hindi. Also Find Jagdish Devda Bjp photos and videos on India.com",
        "sentiment": "5 (Positive)",
        "link": "https://www.india.com/hindi-news/topic/jagdish-devda-bjp/"
    },
    {
        "title": "Malhargarh Election Result 2023 LIVE Updates and Highlights: Jagdish ...",
        "snippet": "In the 2008 elections, Jagdish Devda of BJP won this seat beating Shyam Lal Jok Chandra of INC by a margin of 3,688 votes which was 2.61% of the total votes polled in the constituency. INC had a vote share of 46.82% in the seat. LOCATION. The geographic coordinates of Malhargarh is: 24°08'29.0\"N 75°08'39.1\"E. Malhargarh shares its borders ...",
        "sentiment": "3 (Neutral)",
        "link": "https://www.news18.com/elections/malhargarh-election-result-2023-live-updates-and-highlights-winner-loser-leading-trailing-mla-margin-8687451.html"
    },
    {
        "title": "Jagdish Dewda (Bharatiya Janata Party (BJP)):Constituency- MALHARGARH ...",
        "snippet": "JAGDISH DEWDA (Winner) ... Party:BJP . S/o|D/o|W/o: Late Shri Gaindalal Ji Dewda . Age: 61 . Name Enrolled as Voter in: 224 Mandsour (Madhya Pradesh) constituency, at Serial no 1139 in Part no 56 . Self Profession:Madhya ... Whether any other liabilities are in dispute, if so, mention the amount involved and the authority before which it is ...",
        "sentiment": "1 (Negative)",
        "link": "https://myneta.info/madhyapradesh2018/candidate.php?candidate_id=3348"
    },
    {
        "title": "जगदीश देवड़ा, राजेंद्र शुक्ला... Mp में दो डिप्टी सीएम के पीछे बीजेपी ...",
        "snippet": "ऐसा इसलिए भी है क्योंकि नई सरकार में डिप्टी सीएम बनने जा रहे राजेंद्र शुक्ला 15 महीने की कमलनाथ सरकार की विदाई के बाद जब बीजेपी सरकार बनी, तब मंत्रिमंडल ...",
        "sentiment": "2 (Negative)",
        "link": "https://www.aajtak.in/madhya-pradesh/story/rajendra-shukla-jagdish-devda-deputy-cm-mp-bjp-lok-sabha-chunav-2024-ntc-bikt-1837001-2023-12-12"
    },
    {
        "title": "Jagdish Devda Bjp : Latest News, Videos and Photos on ... - India.Com",
        "snippet": "Get latest Jagdish Devda Bjp news updates & stories. Explore Jagdish Devda Bjp photos and videos on India.com",
        "sentiment": "5 (Positive)",
        "link": "https://www.india.com/topic/jagdish-devda-bjp/"
    },
    {
        "title": "₹1,814 Cr Drug Haul Case: Delhi Taking Feedback On Accused Harish ...",
        "snippet": "Bhopal (Madhya Pradesh): The central leadership of the Bharatiya Janata Party (BJP) has taken exception to the photographs of Jagdish Devda with the accused of drugs factory case Harish Anjana ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.freepressjournal.in/bhopal/1814-cr-drug-haul-case-delhi-taking-feedback-on-accused-harish-anjanas-photos-with-jagdish-devda"
    },
    {
        "title": "BJP Is Set To Secure Majority In State: Devda - Free Press Journal",
        "snippet": "Mandsaur (Madhya Pradesh): State finance minister Jagdish Devda highlighted the ruling BJP's achievement while addressing the Jan Aashirwad Yatra at the Crown Palace Auditorium in Mandsaur ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.freepressjournal.in/indore/bjp-is-set-to-secure-majority-in-state-devda"
    },
    {
        "title": "Deputy CM in MP: आठ बार के विधायक जगदीश देवड़ा ने ली डिप्टी CM पद की ...",
        "snippet": "Jagdish Devda: डिजिटल डेस्क, भोपाल। मध्यप्रदेश में थावरचंद गहलोत के बाद ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.naidunia.com/madhya-pradesh/bhopal-bjps-big-dalit-face-jagdish-deora-becomes-deputy-cm-in-mp-becomes-mla-for-the-eighth-time-8255639"
    },
    {
        "title": "Jagdish Devda Malhargarh Seat Election Result 2023: मल्हारगढ़ में फिर ...",
        "snippet": "Jagdish Devda Malhargarh Vidhan Sabha Result 2023 Update: मध्य प्रदेश विधानसभा चुनाव की मतगणना जारी है. अब तक ...",
        "sentiment": "2 (Negative)",
        "link": "https://www.india.com/hindi-news/madhya-pradesh/malhargarh-madhya-pradesh-election-result-2023-jagdish-devda-parshuram-sisodia-know-update-of-this-vidhan-sabha-seat-6556407/"
    },
    {
        "title": "Central BJP settles in new MP CM, bustle to start after portfolio ...",
        "snippet": "It's been almost half-a-month since Chief Minister Mohan Yadav along with his two Cabinet colleagues and deputies - Rajendra Shukla and Jagdish Devda took oath after the BJP registered a ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.thehansindia.com/news/national/central-bjp-settles-in-new-mp-cm-bustle-to-start-after-portfolio-allocation-to-ministers-847127"
    },
    {
        "title": "MP Cabinet: CM Yadav Keeps Home Dept As Portfolio Allotted To 30 ...",
        "snippet": "Deputy CM Jagdish Devda gets finance ministry, and Rajendra Shukla gets public health ministry. ... Yadav, who took over as chief minister after the BJP retained power in the assembly elections last month, also retained the General Administration Department (GAD), Public Relations, Jails, Mining, Aviation, Industrial Policies, and Investment ...",
        "sentiment": "5 (Positive)",
        "link": "https://news.abplive.com/news/india/mp-cabinet-cm-mohan-yadav-keeps-home-dept-as-portfolio-allotted-to-30-ministers-see-full-list-1653380"
    },
    {
        "title": "Dy CMs in Madhya Pradesh: BJP Appoints Two Deputy Chief Ministers ...",
        "snippet": "The BJP has appointed two deputy chief ministers, Jagdish Devda and Rajendra Shukla, in Madhya Pradesh for the first time. This move is aimed at maintaining caste equations. Read more about the ...",
        "sentiment": "4 (Positive)",
        "link": "https://timesofindia.indiatimes.com/city/bhopal/dy-cms-in-madhya-pradesh-bjp-appoints-two-deputy-chief-ministers/articleshow/105947364.cms"
    },
    {
        "title": "BJP leaders Jagdish Devda and Rajendra Shukla take oath as Deputy CM of ...",
        "snippet": "BHOPAL: BJP leaders Jagdish Devda and Rajendra Shukla took oath as the Deputy Chief Ministers of Madhya Pradesh in Bhopal on Wednesday.Earlier BJP MLA Mohan Yadav took oath as the Chief Minister of the state. Governor Mangubhai C. Patel administered the oath of office to him at the sprawling Motilal Nehru Stadium, Lal Parade Ground in Bhopal.",
        "sentiment": "4 (Positive)",
        "link": "https://www.dtnext.in/news/national/bjp-leaders-jagdish-devda-and-rajendra-shukla-take-oath-as-deputy-cm-of-madhya-pradesh-754170"
    },
    {
        "title": "Jagdish Devda - The Indian Express",
        "snippet": "BJP's Jagdish Devda was sworn in as deputy CM of Madhya Pradesh after the party registered a resounding victory in the 2023 assembly polls. Born in Rampura village of Neemuch district, Devda (66) was finance minister in the Shivraj Singh Chouhan government before being elevated to the post of deputy CM.",
        "sentiment": "4 (Positive)",
        "link": "https://indianexpress.com/about/jagdish-devda/"
    },
    {
        "title": "BJP 3 chief ministers in Rajasthan, Chhattisgarh, Madhya Pradesh, RSS ...",
        "snippet": "In Madhya Pradesh, Mohan Yadav's appointment as the Chief Minister stunned even party members.The 58-year-old is a three-time MLA from Ujjain South and a prominent leader from the OBCs, a group that accounts for more than 48 per cent of the state's population.. Mohan Yadav's deputies, Jagdish Devda and Rajendra Shukla, belong to the Dalit and the Brahmin communities respectively.",
        "sentiment": "4 (Positive)",
        "link": "https://www.indiatoday.in/india/story/bjp-3-chief-ministers-equation-rajasthan-madhya-pradesh-chhattisgarh-sangh-constant-caste-variables-2475126-2023-12-12"
    },
    {
        "title": "Madhya Pradesh Cabinet to be expanded today - India TV News",
        "snippet": "Madhya Pradesh Cabinet expansion: Currently, the cabinet has three members- chief minister Mohan Yadav and two deputy CMs Rajendra Shukla and Jagdish Devda. They were sworn in on December 13.",
        "sentiment": "1 (Negative)",
        "link": "https://www.indiatvnews.com/madhya-pradesh/madhya-pradesh-cabinet-expansion-chief-minister-mohan-yadav-deputy-cms-rajendra-shukla-jagdish-devda-latest-updates-2023-12-24-908786"
    }
]