[
    {
        "title": "Land Scandal: Cong Accuses Deputy CM's Son, BJP Leaders Of Corruption ...",
        "snippet": "When questioned by the media about his son's land ownership, Jagdish Devda chose not to respond and instead held a closed-door meeting with BJP State President VD Sharma, the details of which ...",
        "sentiment": "2 (Negative)",
        "link": "https://www.freepressjournal.in/bhopal/land-scandal-cong-accuses-deputy-cms-son-bjp-leaders-of-corruption-in-bhopal",
        "base_query": "Jagdish_Devda",
        "keyword": "Land Scandal Allegations"
    },
    {
        "title": "Congress accuses MP deputy CM of close links with drug ... - The Week",
        "snippet": "New Delhi, Oct 11 (PTI) Days after a massive drug haul from a factory on the outskirts of Bhopal, the Congress on Friday alleged that a close associate of Madhya Pradesh Deputy Chief Minister Jagdish Devda is involved in drug trade in the state and questioned Prime Minister Narendra Modi's \"silence\" on the issue.",
        "sentiment": "1 (Negative)",
        "link": "https://www.theweek.in/wire-updates/national/2024/10/11/del44-cong-mp-ld-drugs.html"
    },
    {
        "title": "Gujarat ATS' Bhopal drug bust: Congress alleges Deputy CM Devda's links ...",
        "snippet": "Madhya Pradesh Congress president Jitu Patwari held a press conference to demand Mr. Devda's resignation while alleging that Mr. Aanjana was a \"close associate\" of the Deputy CM.",
        "sentiment": "1 (Negative)",
        "link": "https://www.thehindu.com/news/national/madhya-pradesh/gujarat-ats-bhopal-drug-bust-congress-alleges-deputy-cm-devdas-links-with-accused/article68729449.ece"
    },
    {
        "title": "HC refuses to quash FIR filed for land-grabbing",
        "snippet": "HC refuses to quash FIR filed for land-grabbing. Friday, January 10 2025, 12:17 AM. Subscribe ... The court was hearing a petition filed by Jagdish Devda, a resident of Rapar in Kutch district. The complainant and Devda's neighbor Shantilal Suthar had lodged a complaint against him for constructions on the two common plots of the society in ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.ahmedabadmirror.com/hc-refuses-to-quash-fir-filed-for-land-grabbing/81880752.html",
        "base_query": "Jagdish_Devda",
        "keyword": "Land Scandal Allegations"
    },
    {
        "title": "Bhopal drug bust: Congress accuses deputy CM of close links with ...",
        "snippet": "The opposition party demanded Jagdish Devda's resignation alleging that he has links with the kingpin of the drug racket busted recently in Madhya Pradesh. | Latest News India",
        "sentiment": "1 (Negative)",
        "link": "https://www.hindustantimes.com/india-news/bhopal-drug-bust-congress-accuses-deputy-cm-of-close-links-with-kingpin-questions-pm-modis-silence-101728649220051.html"
    },
    {
        "title": "Congress Demands Deputy CM Jagdish Devda's Resignation; Cites His Links ...",
        "snippet": "Bhopal (Madhya Pradesh): The Congress party on Monday sought resignation of deputy chief minister Jagdish Devda claiming he was close to an arrested accused in the case related to seizure of ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.freepressjournal.in/bhopal/congress-demands-deputy-cm-jagdish-devdas-resignation-cites-his-links-with-drug-factory-operators"
    },
    {
        "title": "Why Gujarat land scam, pegged at Rs 10,000 cr, haunts BJP",
        "snippet": "Congress, AAP allege the Bhupendra Patel government is shielding former top BJP ministers in the agricultural land scandal in Gandhinagar district. ... Rupani interestingly addressed a press conference clarifying on the report and denying all allegations and knowledge of illegal actions carried out by Langa. He said the inquiry into the matter ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.indiatoday.in/india-today-insight/story/why-gujarat-land-scam-pegged-at-rs-10000-cr-haunts-bjp-2388424-2023-06-03",
        "base_query": "Jagdish_Devda",
        "keyword": "Land Scandal Allegations"
    },
    {
        "title": "Jagdish Devda - Wikipedia",
        "snippet": "Jagdish Devda is an Indian politician from the Bharatiya Janata Party currently serving as the deputy chief minister of Madhya Pradesh. He is representing Malhargarh Assembly constituency as an MLA for the 6th time in Madhya Pradesh Legislative Assembly. [1] Early life",
        "sentiment": "4 (Positive)",
        "link": "https://en.wikipedia.org/wiki/Jagdish_Devda"
    },
    {
        "title": "Jagdish Devda Wiki, Age, Caste, Wife, Family, Biography & More",
        "snippet": "Jagdish Devda is an Indian lawyer and politician. He became the Deputy Chief Minister of Madhya Pradesh in the Bharatiya Janata Party (BJP) government on 11 ... Non-Agricultural Land: Rs. 5,50,000; Commercial Buildings: Rs. 5,50,000; Residential Buildings: Rs. 2,00,00,000 [4] My Neta; Net Worth.",
        "sentiment": "4 (Positive)",
        "link": "https://wikibio.in/jagdish-devda/"
    },
    {
        "title": "Jagdish Devda(Bharatiya Janata Party(BJP)):Constituency ... - MyNeta",
        "snippet": "Home → Madhya Pradesh 2023 → MANDSAUR → MALHARGARH (SC) → JAGDISH DEVDA(Criminal & Asset Declaration) Madhya Pradesh 2023. JAGDISH DEVDA (Winner) MALHARGARH (SC) (MANDSAUR) Party:BJP . S/o|D/o|W/o: Late. Gendalal Ji Devda ... Non Agricultural Land: Sy no-3022,305406, Mochi Mandir Gali Rampura, Neemuch Total Area 675.38 sq ft Built Up ...",
        "sentiment": "1 (Negative)",
        "link": "https://myneta.info/MadhyaPradesh2023/candidate.php?candidate_id=531"
    },
    {
        "title": "Madhya Pradesh: Congress seeks Dy CM's resignation over drug bust",
        "snippet": "Deputy CM Jagdish Devda, while denying the allegations, however, had said, \"Many people come and get pictures with persons who are in public and political life. By getting his picture clicked ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.newindianexpress.com/nation/2024/Oct/12/madhya-pradesh-congress-seeks-dy-cms-resignation-over-drug-bust"
    },
    {
        "title": "Jagdish _ Devda - India Leader",
        "snippet": "Jagdish Devda's educational qualifications are: Post Graduate and is of 66 years of age. His total declared assets are Rs 4.9 crore which includes Rs 1.2 crore in moveable assets and Rs 3.7 crore as immovable assets. The total declared income is Rs 40.8 lakh of which Rs 21 lakh is self income. Jagdish Devda has total liabilities of Rs 14.1 lakh.",
        "sentiment": "4 (Positive)",
        "link": "https://www.indialeader.com/ViewLeader/47118/"
    },
    {
        "title": "MP Congress Demands Deputy CM's Resignation Amid Drug Scandal",
        "snippet": "MP Congress Demands Deputy CM's Resignation Amid Drug Scandal MPCC chief Jitu Patwari calls for MP Deputy CM Jagdish Devda's resignation, linking him to a major drug bust. Accusations suggest Madhya Pradesh is becoming a drug hub. Deputy CM Devda denies the accusations, emphasizing the need for strict action against criminals.",
        "sentiment": "1 (Negative)",
        "link": "https://www.devdiscourse.com/article/headlines/3118780-mp-congress-demands-deputy-cms-resignation-amid-drug-scandal",
        "base_query": "Jagdish_Devda",
        "keyword": "Land Scandal Allegations"
    },
    {
        "title": "JAGDISH DEVDA(Bharatiya Janata Party(BJP)):Constituency ... - MyNeta",
        "snippet": "Home → Madhya Pradesh 2008 → Mandsour → Malhargarh → JAGDISH DEVDA(Criminal & Asset Declaration) Madhya Pradesh 2008. JAGDISH DEVDA (Winner) Malhargarh (Mandsour) Party:BJP . S/o|D/o|W/o: GENDA ... Agricultural Land: Nil: Nil: Nil: Nil: Nil: Nil: ii: Non Agricultural Land: 4,00,000 4 Lacs+ 1500 SQ.FT. HOUSE IN MEGHDOOT NAGAR PLOT NO.27 ...",
        "sentiment": "1 (Negative)",
        "link": "https://myneta.info/2008mp/candidate.php?candidate_id=251"
    },
    {
        "title": "jagdish devda madhya-pradesh malhargarh candidate Profile,Candidates ...",
        "snippet": "jagdish devda madhya-pradesh malhargarh candidate : jagdish devda madhya-pradesh malhargarh candidate Candidates Net Worth, Education, Property and Family Background Affidavit Submitted To ECI Latest News at ABP न्यूज़ | ABPLive",
        "sentiment": "1 (Negative)",
        "link": "https://news.abplive.com/elections/jagdish-devda-madhya-pradesh-malhargarh-candidate-profile.html"
    },
    {
        "title": "Jagdish Devda , जगदीश देवड़ा , Malhargarh , मल्हारगढ़ , BJP , Madhya ...",
        "snippet": "Jagdish Devda Biography In Hindi : मल्हारगढ़ विधानसभा क्षेत्र से जगदीश देवड़ा को टिकट दिया गया है। जगदीश देवड़ा भी मल्हारगढ़ विधानसभा से 3 बार के विधायक रह चुके हैं और ...",
        "sentiment": "4 (Positive)",
        "link": "https://hindi.webdunia.com/election-candidate/jagdish-devda-38.html"
    },
    {
        "title": "Jagdish Devda - PRS Legislative Research",
        "snippet": "Jagdish Devda; This MLA has been the Deputy Chief minister from 13 Dec 2023. Ministers represent the government in debates, so we do not report their participation while they are in the office. They do not sign the attendance register, ask questions, or introduce private member bills. Data corresponds to the period from 03-12-2023 to 14-02-2024.",
        "sentiment": "1 (Negative)",
        "link": "https://prsindia.org/mlatrack/jagdish-devda"
    },
    {
        "title": "Jagdish Devda Biography Who is Jagdish Devda Next Madhya Pradesh Deputy ...",
        "snippet": "MP Deputy CM Jagdish Devda Biography: मध्य प्रदेश में सभी कयासों पर विराम लगाते हुए ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.abplive.com/states/madhya-pradesh/jagdish-devda-biography-who-is-jagdish-devda-next-madhya-pradesh-deputy-cm-malhargarh-bjp-mla-2558486"
    },
    {
        "title": "MP's budget will be comprehensive & public centric: Jagdish Devda",
        "snippet": "Bhopal : Madhya Pradesh Finance Minister Jagdish Devda on Monday said the upcoming annual budget of the state government would be comprehensive and beneficial for all sections of the people. Devda ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.thehansindia.com/news/national/mps-budget-will-be-comprehensive-public-centric-jagdish-devda-886956"
    },
    {
        "title": "Who is Jagdish Devda, the new Madhya Pradesh deputy Chief Minister?",
        "snippet": "Jagdish Devda contested the Madhya Pradesh Assembly Elections 2023 from the Malhargarh seat and won the campaign by a margin of 59,024 votes. Republic World Republic Business",
        "sentiment": "4 (Positive)",
        "link": "https://www.republicworld.com/elections/who-is-jagdish-devda-the-new-madhya-pradesh-deputy-chief-minister"
    },
    {
        "title": "MP Budget 2024: मध्य प्रदेश ... - Navbharat Times",
        "snippet": "Mp Budget 2024 Finance Minister Jagdish Devda Budget Speech No Extra Tax On People Know Big Important Points MP Budget 2024: मध्य प्रदेश बजट की बड़ी बातें, पुलिस विभाग में होगी 7500 भर्तियां, लाडली बहनों के लिए भी ...",
        "sentiment": "1 (Negative)",
        "link": "https://navbharattimes.indiatimes.com/state/madhya-pradesh/bhopal/mp-budget-2024-finance-minister-jagdish-devda-budget-speech-no-extra-tax-on-people-know-big-important-points/articleshow/111450965.cms"
    },
    {
        "title": "MP Budget FY25: Key takeaways from Finance Minister Jagdish Devda ...",
        "snippet": "Here are the key takeaways from MP Budget 2024-25 presented by Finance Minister Jagdish Devda. A Provision of Rs 26,560 crore for women and child development in the Madhya Pradesh Budget for 2024-25.",
        "sentiment": "4 (Positive)",
        "link": "https://www.financialexpress.com/policy/economy-mp-budget-2024-25-key-takeaways-from-finance-minister-jagdish-devda-speech-in-madhya-pradesh-assembly-3542426/"
    },
    {
        "title": "BJP picks Jagdish Devda, Rajendra Shukla to be new Deputy ... - CNBCTV18",
        "snippet": "Jagdish Devda The party's candidate from Malhargath, Jagdish Devda won in the state assembly elections 2023 by a margin of 59,024 votes, defeating independent candidate Shyamlal Jokchand. Devda has been serving as Malhargarh MLA since 2008. He won three consecutive terms in 2008, 2013, and 2018.",
        "sentiment": "1 (Negative)",
        "link": "https://www.cnbctv18.com/politics/bjp-picks-jagdish-devda-rajendra-shukla-to-be-new-deputy-chief-ministers-of-madhya-pradesh-18539261.htm"
    },
    {
        "title": "Photos Of Drug Haul Case Accused With Deputy CM Jagdish Devda Goes Viral",
        "snippet": "Bhopal (Madhya Pradesh): A photograph of Deputy Chief Minister Jagdish Devda, with Harish Anjana who was arrested in connection with Rs 1,814 crore drugs trafficking case, has heated up political ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.freepressjournal.in/bhopal/photos-of-drug-haul-case-accused-with-deputy-cm-jagdish-devda-goes-viral",
        "base_query": "Jagdish_Devda",
        "keyword": "Land Scandal Allegations"
    },
    {
        "title": "Jagdish Devda: आठ बार के विधायक जगदीश देवड़ा संभालेंगे MP के डिप्टी ...",
        "snippet": "MP Deputy CM Jagdish Devda: रामपुरा क्षेत्र से आने वाले जगदीश देवड़ा को मप्र का डिप्टी सीएम बनाया गया है। देवड़ा मल्हारगढ़ विधानसभा सीट से आठ बार से विधायक हैं और अब ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.amarujala.com/madhya-pradesh/bhopal/mp-news-jagdish-deora-will-become-deputy-chief-minister-of-madhya-pradesh-2023-12-11"
    },
    {
        "title": "Jagdish Devda: जगदीश देवड़ा को मिली MP के डिप्टी सीएम की जिम्मेदारी, आठ ...",
        "snippet": "Jagdish Devda New Deputy CM of MP भाजपा विधायक दल की बैठक में मध्य प्रदेश के ...",
        "sentiment": "3 (Neutral)",
        "link": "https://www.jagran.com/madhya-pradesh/bhopal-who-is-the-new-deputy-cm-of-madhya-pradesh-jagdish-devda-net-worth-political-background-malhargarh-assembly-constituency-23602044.html",
        "base_query": "Jagdish_Devda",
        "keyword": "Land Scandal Allegations"
    },
    {
        "title": "Mp Budget Session 2024 Live Updates Cm Jagdish Devda Will Present The ...",
        "snippet": "Hindi News › Live › Madhya Pradesh › Bhopal News › MP Budget Session 2024 Live Updates CM Jagdish Devda will present the budget in the House News in Hindi MP Budget 2024 Live: विपक्ष के वॉकआउट के बीच वित्त मंत्री ने बजट किया पेश, 3.65 लाख ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.amarujala.com/live/madhya-pradesh/bhopal/mp-budget-session-2024-live-updates-cm-jagdish-devda-will-present-the-budget-in-the-house-news-in-hindi-2024-07-03",
        "base_query": "Jagdish_Devda",
        "keyword": "Land Scandal Allegations"
    },
    {
        "title": "Jagdish Devda Named Deputy Chief Minister Of Madhya Pradesh; Know All ...",
        "snippet": "Jagdish Devda earlier served as the Finance Minister in Shivraj Singh Chouhan's cabinet and has been winning the assembly elections for six consecutive terms. Jagdish Devda, who is popular among ...",
        "sentiment": "2 (Negative)",
        "link": "https://english.jagran.com/india/jagdish-deora-named-deputy-chief-minister-of-madhya-pradesh-know-all-about-sixtime-bjp-mla-and-former-mp-finance-minister-10119592"
    },
    {
        "title": "BJP leaders Jagdish Devda and Rajendra Shukla take oath as Deputy CM of ...",
        "snippet": "BHOPAL: BJP leaders Jagdish Devda and Rajendra Shukla took oath as the Deputy Chief Ministers of Madhya Pradesh in Bhopal on Wednesday.Earlier BJP MLA Mohan Yadav took oath as the Chief Minister of the state. Governor Mangubhai C. Patel administered the oath of office to him at the sprawling Motilal Nehru Stadium, Lal Parade Ground in Bhopal.",
        "sentiment": "4 (Positive)",
        "link": "https://www.dtnext.in/news/national/bjp-leaders-jagdish-devda-and-rajendra-shukla-take-oath-as-deputy-cm-of-madhya-pradesh-754170",
        "base_query": "Jagdish_Devda",
        "keyword": "Land Scandal Allegations"
    },
    {
        "title": "Jagdish Dewra(Bharatiya Janata Party(BJP)):Constituency- MALHARGARH ...",
        "snippet": "Non Agricultural Land: Plot No.-MIG 25, Meghdoot Nagar, Mandsour Total Area 1453 sqft Built Up Area Whether Inherited N ... Loan to Jagdish Gendalal Devda 4,00,000 4 Lacs+: Loan to Jagdish Gendalal Devda 2,05,000 2 Lacs+: Nil: Nil: Nil: Nil: Rs 6,05,000 6 Lacs+: Any other Liability: Nil: Nil: Nil: Nil: Nil: Nil:",
        "sentiment": "1 (Negative)",
        "link": "https://myneta.info/mp2013/candidate.php?candidate_id=122",
        "base_query": "Jagdish_Devda",
        "keyword": "Land Scandal Allegations"
    },
    {
        "title": "MP Budget: Amid Opposition's uproar, finance minister Jagdish Devda ...",
        "snippet": "Bhopal (Madhya Pradesh): Amid opposition's uproar, Finance Minister Jagdish Devda has presented the state budget worth Rs 2,79,237 lakh crore for 2022-23. There is a fiscal deficit worth Rs 55111 ...",
        "sentiment": "2 (Negative)",
        "link": "https://www.freepressjournal.in/bhopal/bhopal-finance-minister-jagdish-dewda-to-present-mp-budget-today"
    },
    {
        "title": "Jagdish Devda Latest News, Photos and Videos - India TV News",
        "snippet": "Jagdish Devda Latest News and Updates, Special Reports, Videos & Photos of Jagdish Devda on India TV. Articles on Jagdish Devda, Complete Coverage on Jagdish Devda. Saturday, December 21, 2024.",
        "sentiment": "3 (Neutral)",
        "link": "https://www.indiatvnews.com/topic/jagdish-devda",
        "base_query": "Jagdish_Devda",
        "keyword": "Land Scandal Allegations"
    },
    {
        "title": "Seven-time MLA, know who is Jagdish Devda, who will become - India Herald",
        "snippet": "Jagdish Deora is currently bjp mla from Malhargarh assembly seat of Mandsaur. The newly appointed Deputy. Chief minister of madhya pradesh, Jagdish Deora belongs to the scheduled caste of the state. He was born on 1. July 1957 in Neemuch district. Jagdish Deora is a social worker and lawyer by profession. He started his political",
        "sentiment": "4 (Positive)",
        "link": "https://www.indiaherald.com/Politics/Read/994657891/Seventime-MLA-know-who-is-Jagdish-Devda-who-will-become-Deputy-CM",
        "base_query": "Jagdish_Devda",
        "keyword": "Land Scandal Allegations"
    },
    {
        "title": "जगदीश देवड़ा, Jagdish Devda - आज तक",
        "snippet": "जगदीश देवड़ा (Jagdish Devda) मध्य प्रदेश के नवनिर्वाचित उप मुख्यमंत्री ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.aajtak.in/topic/jagdish-devda",
        "base_query": "Jagdish_Devda",
        "keyword": "Land Scandal Allegations"
    },
    {
        "title": "MP Oath Taking Ceremony: Jagdish Devda, Rajendra Shukla swear in as ...",
        "snippet": "BJP leaders Jagdish Devda and Rajendra Shukla took oath as the Deputy Chief Ministers of Madhya Pradesh, in Bhopal. Prime Minister Narendra Modi and other senior NDA leaders attend the ceremony ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.indiatvnews.com/madhya-pradesh/madhya-pradesh-cm-swearing-in-ceremony-live-updates-mohan-yadav-take-oath-as-mp-chief-minister-in-presence-of-pm-modi-jagdish-devda-rajendra-shukl-bjp-2023-12-13-907066"
    },
    {
        "title": "Jagdish Devda Wiki, Biography, Age, Deputy CM, Family - Right Rasta",
        "snippet": "Who is Jagdish Devda. Jagdish Devda is a Madhya Pradesh politician who now serves as the state's Deputy Chief Minister in the newly elected BJP cabinet. He was elected to the Malhargarh Assembly seat eight times. In the Fourth Chouhan Ministry, he also handled positions such as Commercial Taxes, Planning, Economics, and Statistics.",
        "sentiment": "4 (Positive)",
        "link": "https://www.rightrasta.com/jagdish-devda-wiki/"
    },
    {
        "title": "MP Breaking: 'Congress is not able to digest defeat', Jagdish Devda ...",
        "snippet": "MP Breaking: 'हार नहीं पचा पा रही Congress', Haryana चुनाव में हार पर बोले Jagdish Devda | ABP News",
        "sentiment": "3 (Neutral)",
        "link": "https://www.abplive.com/videos/news/mp-breaking-congress-is-not-able-to-digest-defeat-jagdish-devda-said-on-defeat-in-haryana-elections-abp-news-2802080",
        "base_query": "Jagdish_Devda",
        "keyword": "Land Scandal Allegations"
    }
]