[
    {
        "title": "PhilHealth's Mismanagement: Billions in Reserve While Hospitals Struggle",
        "snippet": "Under the program, the state agency provides P500 per patient in public hospitals and P750 in private hospitals but this has been getting a lukewarm response. The recent controversy on the siphoning of P89.9 billion in excess funds of PhilHealth made hospitals skeptical about its ability to cover its arrears.",
        "sentiment": "1 (Negative)",
        "link": "https://tribune.net.ph/2024/12/21/wrong-priority-kills"
    },
    {
        "title": "Hospital Mismanagement of a Crisis: Common Themes",
        "snippet": "Hospital administrators are virtually never transparent about their decisions, particularly those that go wrong. The crisis events over the last two decades show the same repeated mismanagement errors. When your instinct after making a bad decision that hurts patients is to skirt accountability, you are the bathwater and not the baby.",
        "sentiment": "2 (Negative)",
        "link": "https://roboticctsurgery.com/2019/11/03/hospital-mismanagement-of-a-crisis-common-themes/"
    },
    {
        "title": "Bipartisan Senate report slams private equity's \"detrimental effects ...",
        "snippet": "The Senate's latest investigation unearthed thousands of documents detailing the financial maneuvers of two private equity firms: Leonard Green & Partners and Apollo Global Management.",
        "sentiment": "1 (Negative)",
        "link": "https://www.cbsnews.com/news/senate-report-private-equity-hospitals/"
    },
    {
        "title": "Hospital Operations Mismanagement: Causes and Implications ... - IvyPanda",
        "snippet": "Causes of hospital operations mismanagement. ... Many failing hospitals lack operation systems that will provide patients access to superior and safe medical care. These institutions tend to possess vertical structures that revolve around medical specialists rather than performances. Doctors and other care professionals lack information, which ...",
        "sentiment": "2 (Negative)",
        "link": "https://ivypanda.com/essays/hospital-operations-mismanagement-causes-and-implications-of-it/"
    },
    {
        "title": "Senate hearing on Steward Health Care depicts consequences of hospital ...",
        "snippet": "Note: This story was updated Sept. 26 and Sept. 30 with additional news, including a lawsuit filed by now-former CEO Ralph de la Torre. After the CEO of Steward Health Care rebuffed a subpoena to appear Thursday at a Senate committee hearing, members and invited panelists used the occasion to bemoan the company's hospital ownership record and the private equity healthcare model generally.",
        "sentiment": "1 (Negative)",
        "link": "https://www.hfma.org/finance-and-business-strategy/senate-hearing-on-steward-health-care-depicts-severe-consequences-of-mismanagement/"
    },
    {
        "title": "Competing Narratives of Hospital Closure: A Case Study of ... - PubMed",
        "snippet": "Results: Three main narratives of the hospital's closure arose: 1.) financial inevitability; 2.) corporate mismanagement; and 3.) systems realignment. Conclusions: Overlapping and discrepant narratives of the closure demonstrated the complicated role of hospitals within communities and health systems. Acknowledgment of both the hospital's ...",
        "sentiment": "3 (Neutral)",
        "link": "https://pubmed.ncbi.nlm.nih.gov/38917313/"
    },
    {
        "title": "The Mismanagement Of Hospitals - Think",
        "snippet": "Many hospitals are nonprofits or owned by large chains. Some facilities - particularly in smaller towns - though are owned by individuals who see them as a source of easy cash. And with little regulation, it's common for these hospitals to fall into disarray.",
        "sentiment": "2 (Negative)",
        "link": "https://think.kera.org/2017/01/16/the-mismanagement-of-hospitals/"
    },
    {
        "title": "The Mismanagement Of Hospitals | KERA",
        "snippet": "The Mismanagement Of Hospitals think.kera.org January 16, 2017 10. ... Many hospitals are nonprofits or owned by large chains. Some facilities - particularly in smaller towns - though are owned by individuals who see them as a source of easy cash. And with little regulation, it's common for these hospitals to fall into disarray. ...",
        "sentiment": "2 (Negative)",
        "link": "https://www.kera.org/think_new/the-mismanagement-of-hospitals/"
    },
    {
        "title": "Advance Super Multi Speciality Hospital in Gurugram Sector 37D",
        "snippet": "Signature Hospital, part of Park Hospital is a fully-equipped private hospital with state-of-the-art medical facilities, 300 plus beds multispecialty hospital in Gurugram",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/hospital/super-multispeciality-hospital-in-gurgaon-37D"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Signature Hospital Quick Appointment Appointment. Contact Us Ambulance/Emergency. Park Emergency +91-9916699166. Delhi +91-7533033025. Gurugram +91-7503141435. Palam Vihar +91-9891424242. The Signature, Gurugram +91-6262828213 ... Park Group of Hospitals, situated in North India, is a landmark healthcare entity of global standards. ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Address. Meera Enclave(Chowkhandi), Outer Ring Road, New Delhi. Email info@parkhospital.in; Telephones 1800-102-6767; Working Hours. 24/7 (Emergency Department)",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/contact-us"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Park hospital is the fastest growing chain of advanced super speciality hospitals, Provides patients with best & affordable healthcare treatment. ... About the Group . About Us; Our Journey; Our Visionaries; Our Management; Awards & Accolades; Accreditations; ... Hospitals in The Signature, Gurugram; Hospitals in Faridabad; Hospitals in Sonipat ...",
        "sentiment": "3 (Neutral)",
        "link": "https://www.parkhospital.in/user-login"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Park hospital is the fastest growing chain of advanced super speciality hospitals, Provides patients with best & affordable healthcare treatment. ... Group Director - Legal. Rakesh Bhardwaj. Vice President - Legal. Atin Mehta. Senior Law Officer. ... The Signature Hospital. Dr. Pardeep Singh. Deputy Medical Superintendent. Panipat. Brig. Yesh ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.parkhospital.in/meet-our-management"
    },
    {
        "title": "Park Group of Hospitals | LinkedIn",
        "snippet": "Book an Appointment with Dr. Sachin Abrol, Consultant - Urology at Park Hospital, Panipat Consult Now: 7027 8989 89, 99166 99166 Park Group of Hospitals: NABL & NABH Accredited 30+ Specialties 10 Lakhs+ Patients Treated 1.5 Lakhs+ International Patients Treated 1 Lakh+ Surgeries Completed . . .",
        "sentiment": "5 (Positive)",
        "link": "https://in.linkedin.com/company/park-hospital"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Signature Hospital Quick Appointment Appointment. Contact Us Ambulance/Emergency. Park Emergency +91-9916699166. Delhi +91-7533033025. Gurugram +91-7503141435. Palam Vihar +91-9891424242. The Signature, Gurugram +91-6262828213 ... Dr. Ajit Gupta is the Founder of the Park Group of Hospitals. His avid passion for subject of healthcare in respect ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/visionaries"
    },
    {
        "title": "Advance Super Multi Speciality Hospital in New Delhi | Park Hospital",
        "snippet": "Park Hospital is a fully-equipped private hospital with state-of-the-art medical facilities, 250 plus beds multispecialty hospital in Delhi ... Signature Hospital Quick Appointment Appointment. Contact Us Ambulance/Emergency. Park Emergency +91-9916699166. Delhi +91-7533033025 ... Delhi is an ambitious initiative from Park Group. This is a ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/hospital/super-multispeciality-hospital-in-Delhi"
    },
    {
        "title": "Ahmedabad: Cong protests 'mismanagement during Covid', AAP criticises ...",
        "snippet": "\"Due to the negligent and irresponsible government, we have seen long queues of ambulances outside hospitals, patients suffering from lack of beds, people dying due to lack of oxygen, black-marketing of medicines to the extent that an injection costing Rs 1,000 was sold at Rs 30,000 to Rs 40,000 and there was token system generated even for ...",
        "sentiment": "1 (Negative)",
        "link": "https://indianexpress.com/article/cities/ahmedabad/ahmedabad-cong-protests-mismanagement-during-covid-aap-criticises-lack-of-hospitals-7435276/"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Park hospital is the fastest growing chain of advanced super speciality hospitals, Provides patients with best & affordable healthcare treatment. ... At Park Group of Hospitals, we foster a healthy, safe, and productive work environment with a well-defined positive culture for our employees, while promoting a rewarding work & learning ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/career"
    },
    {
        "title": "Draft of Medical Negligence Complaint Against The Signature Hospital ...",
        "snippet": "The complaint alleges gross medical negligence by doctors at The Signature Hospital in Gurugram that led to the wrongful death of the complainant's father. Key details include: 1) The complainant's father, aged 66, was in good health prior to the surgery and only needed a minor gallbladder removal procedure. 2) The surgery was conducted in a negligent manner without proper tests, discussion of ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.scribd.com/document/711679464/Draft-of-Medical-Negligence-Complaint-Against-The-Signature-Hospital-Park-Hospital-Gurgaon"
    },
    {
        "title": "Youth group to protest over alleged mismanagement of Karaga District ...",
        "snippet": "4. The propose route would be from the Karaga town park near the Police station as a converging point. And from there, to the District Hospital and from the District hospital to the Karaga District Assembly where a petition would be submitted to the Hon. District Chief Executive and the Assembly back to the converging point for closing.",
        "sentiment": "1 (Negative)",
        "link": "http://www.ghanahospitals.org/news/details.php?id=3920"
    },
    {
        "title": "- Missing Weapons at The National Park Service: Mismanagement and Lack ...",
        "snippet": "[House Hearing, 113 Congress] [From the U.S. Government Publishing Office] MISSING WEAPONS AT THE NATIONAL PARK SERVICE: MISMANAGEMENT AND LACK OF ACCOUNTABILITY ===== JOINT OVERSIGHT HEARING before the SUBCOMMITTEE ON NATIONAL SECURITY of the COMMITTEE ON OVERSIGHT AND GOVERNMENT REFORM and the SUBCOMMITTEE ON PUBLIC LANDS AND ENVIRONMENTAL REGULATION of the COMMITTEE ON NATURAL RESOURCES U.S ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.govinfo.gov/content/pkg/CHRG-113hhrg82717/html/CHRG-113hhrg82717.htm"
    },
    {
        "title": "Medical Park Hospitals Group - Medproper Health Tourism",
        "snippet": "Medical Park Hospitals Group. Medical Park Hospitals, the flagship of MLP Care Group, one of the most established and experienced health groups in Turkey was founded in 1993, is strongly proceeding on its way with brands of Liv Hospital, VM Medical Park and Istinye University Hospital. Currently, this largest group steering the sector and ...",
        "sentiment": "5 (Positive)",
        "link": "https://mlphinternational.com/en/hospitals/medical-park-hospitals-group"
    },
    {
        "title": "Know more about Park Hospital, who we are and our people",
        "snippet": "Park Group of Hospitals, equipped with world class facilities is one of the most advanced and comprehensive healthcare institutions. ... Signature Hospital Quick Appointment Appointment. Contact Us Ambulance/Emergency. Park Emergency +91-9916699166. Delhi +91-7533033025. Gurugram +91-7503141435. Palam Vihar +91-9891424242. The Signature ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.parkhospital.in/about-us"
    },
    {
        "title": "Mismanagement and overcrowding plague Dhaka Medical College Hospital",
        "snippet": "Dhaka Medical College Hospital (DMCH), one of Bangladesh's largest public healthcare facilities, is facing a severe crisis as mismanagement and overcrowding jeopardise patient care. With patient numbers nearly double the intended capacity, the hospital is struggling to provide adequate services, exposing critical issues that burden patients and ...",
        "sentiment": "2 (Negative)",
        "link": "https://www.tbsnews.net/bangladesh/mismanagement-and-overcrowding-plague-dhaka-medical-college-hospital-988321"
    },
    {
        "title": "Park Group of Hospitals - LinkedIn",
        "snippet": "Park Group of Hospital is the fastest growing chain of hospitals in Delhi NCR, which presently has over 1500 beds, and has attained supremacy in the field of healthcare with its crème-de-la ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.linkedin.com/company/parkgroupofhospitals"
    },
    {
        "title": "House Hearing, 113TH Congress - Missing Weapons at The National Park ...",
        "snippet": "This document summarizes a joint oversight hearing held by the House Oversight and Government Reform Subcommittee on National Security and the House Natural Resources Subcommittee on Public Lands and Environmental Regulation. The hearing examined issues of missing weapons, mismanagement, and lack of accountability at the National Park Service. Witnesses included the Assistant Inspector General ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.scribd.com/document/322233222/HOUSE-HEARING-113TH-CONGRESS-MISSING-WEAPONS-AT-THE-NATIONAL-PARK-SERVICE-MISMANAGEMENT-AND-LACK-OF-ACCOUNTABILITY"
    },
    {
        "title": "Pennsylvania AG sues health system for 'mismanagement and neglect' of ...",
        "snippet": "Pennsylvania Attorney General Michelle Henry has sued Prospect Medical Holdings for years of \"mismanagement and neglect\" of Upland, Pa.-based Crozer Health, which has disrupted healthcare services ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.beckershospitalreview.com/legal-regulatory-issues/pennsylvania-ag-sues-health-system-for-mismanagement-and-neglect-of-hospitals.html"
    },
    {
        "title": "Park Group of Hospitals | LinkedIn",
        "snippet": "Park Group of Hospitals | 3,018 followers on LinkedIn. Park Group of Hospital is the fastest growing chain of hospitals in Delhi NCR, which presently has over 1500 beds, and has attained supremacy in the field of healthcare with its crème-de-la-crème tertiary medical care. Started by Dr Ajit Gupta in 1982, with Park Sunil Hospital in Malviya Nagar as the first one, and now it has 8 hospitals ...",
        "sentiment": "5 (Positive)",
        "link": "https://in.linkedin.com/company/parkgroupofhospitals"
    },
    {
        "title": "Medical Park Hospitals Group - Turkey Health Care Group",
        "snippet": "Medical Park Hospitals Group. Medical Park Hospitals Group is one of the biggest and most famous groups which has more than 30 hospitals in various provinces of Turkey. More than 5000 doctors and employees are offering medical services in this Medical group which was founded in 1993. We are growing rapidly and doing our best to be always at the ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.en.turkeyhealthcaregroup.com/medical-park-hospitals-group/"
    },
    {
        "title": "Advance Super Multi Speciality Hospital in Patiala | Park Hospital",
        "snippet": "Park Hospital situated in Phase 1; Patiala is the crown jewel among all the centres of Park Group which is the fastest growing hospital chain in India. Boasting a capacity of 450 beds and 150 ICU beds in Patiala hospital, Park Patiala has the bragging rights to be known as the biggest hospital in Park's resume.",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/hospital/super-multispeciality-hospital-in-patiala"
    },
    {
        "title": "Park Group of Hospitals - LinkedIn",
        "snippet": "Signature Hospital Hospitals and Health Care Fortis Healthcare Hospitals and Health Care ... Park Group of Hospitals | 10,033 followers on LinkedIn. Advanced Super Speciality Hospital.",
        "sentiment": "5 (Positive)",
        "link": "https://www.linkedin.com/company/park-hospital"
    },
    {
        "title": "Youth group to protest over alleged mismanagement of Karaga District ...",
        "snippet": "4. The propose route would be from the Karaga town park near the Police station as a converging point. And from there, to the District Hospital and from the District hospital to the Karaga District Assembly where a petition would be submitted to the Hon. District Chief Executive and the Assembly back to the converging point for closing.",
        "sentiment": "1 (Negative)",
        "link": "https://ghanahospitals.org/news/details.php?id=3920"
    },
    {
        "title": "Ground News - Ahmedabad: Cong protests 'mismanagement during Covid ...",
        "snippet": "Saturday, November 2, 2024 Set Location. Edition. Home",
        "sentiment": "1 (Negative)",
        "link": "https://ground.news/article/ahmedabad-cong-protests-mismanagement-during-covid-aap-criticises-lack-of-hospitals"
    },
    {
        "title": "Advance Super Multi Speciality Hospital in Gurugram Sector 47|Park Hospital",
        "snippet": "Park Hospital is a fully-equipped private hospital with state-of-the-art medical facilities, 250 plus beds multispecialty hospital in Gurugram ... Signature Hospital Quick Appointment Appointment. Contact Us Ambulance/Emergency. Park Emergency +91-9916699166. Delhi +91-7533033025 ... Gurugram is an ambitious initiative from Park Group. This is ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/hospital/super-multispeciality-hospital-in-gurugram"
    },
    {
        "title": "In conversation with Dr. Ankit Gupta on the journey of trust, quality ...",
        "snippet": "Now managed by the father-son duo, Park Group of Hospitals currently holds a bed capacity of 4000, expected to reach 5500 in number in the coming years. For successfully delivering quality super ...",
        "sentiment": "5 (Positive)",
        "link": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/in-conversation-with-dr-ankit-gupta-on-the-journey-of-trust-quality-and-future-expansion-at-park-group-of-hospitals/articleshow/103962887.cms"
    },
    {
        "title": "Medical Park Hospitals Group Reviews - Trustpilot",
        "snippet": "Medical Park Hospital Group founded in 1993, is the largest group of hospitals in Turkey which continues operations with 27 hospitals in 15 cities. Our hospitals, our affiliates and almost 18.000 employees working together with the common goal in our headquarter to dominate the Turkish health sector based on our contributions.",
        "sentiment": "3 (Neutral)",
        "link": "https://www.trustpilot.com/review/www.medicalpark.com.tr"
    },
    {
        "title": "Mismanagement and overcrowding plague Dhaka Medical College Hospital",
        "snippet": "Dhaka Medical College Hospital (DMCH), one of Bangladesh's largest public healthcare facilities, is facing a severe crisis as mismanagement and overcrowding jeopardise patient care. With patient numbers nearly dou . Headline: Govt to procure soybean oil, lentil, LNG and fertiliser to meet domestic needs ...",
        "sentiment": "2 (Negative)",
        "link": "https://unb.com.bd/category/Special/mismanagement-and-overcrowding-plague-dhaka-medical-college-hospital/146603"
    },
    {
        "title": "Hospitals could save $25.4B annually in supply chain costs, study finds",
        "snippet": "Hospitals cumulatively spend $25.4 billion more than necessary each year on supply chain expenses, according to a Navigant study. The study of 2,300 U.S. hospitals found facilities could save an ...",
        "sentiment": "2 (Negative)",
        "link": "https://www.beckershospitalreview.com/supply-chain/hospitals-could-save-25-4b-annually-in-supply-chain-costs-study-finds.html"
    },
    {
        "title": "Signature Bank Failed Because of Mismanagement ... - Markets Insider",
        "snippet": "Signature Bank (SBNY) fell apart due to mismanagement by its officers and \"contagion effects\" after the collapse of Silicon Valley Bank (SVB) and wind-down of Silvergate Bank, a federal bank ...",
        "sentiment": "1 (Negative)",
        "link": "https://markets.businessinsider.com/news/currencies/signature-bank-failed-because-of-mismanagement-contagion-fdic-report-says-1032274709?op=1"
    },
    {
        "title": "Réza Ganjavi - MISMANAGEMENT OF J. KRISHNAMURTI FOUNDATION TRUST KFT ...",
        "snippet": "Both police agencies refused to investigate the Trust's dishonest report due to lack of evidence. ... This research report was done as a collaborative effort by a group of people concerned with mismanagement and scandals at Krishnamurti Foundation Trust (\"KFT\") / Brockwood Park Krishnamurti Educational Center (\"Brockwood\"), which ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.rezamusic.com/writings/on-j-krishnamurtis-work/KFT-Mismanagement"
    },
    {
        "title": "Best Oncologist & Gastroenterologist in Palam Vihar, Gurgaon",
        "snippet": "The brand new Park Hospital & Heart Institute in Palam Vihar, Gurgaon is a 250 bedded hospital with Minor & Major OTs, Advanced ICUs (Including NICU, PICU, SICU and Heart Command) Cath lab, dialysis Centre and several other specialized wards for specific treatments.",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/hospital/super-multispeciality-hospital-in-palam-vihar-gurugram"
    },
    {
        "title": "North India's Fastest-growing Chain Of Super-specialty Hospitals Plans ...",
        "snippet": "Park Group of Hospitals added 5 new hospitals to its chain of hospitals from FY 2019 to FY 2021 alone, which is truly unheard of in the business of individually owned hospitals. Park Group of ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.prnewswire.com/in/news-releases/north-india-s-fastest-growing-chain-of-super-specialty-hospitals-plans-further-expansion-842280996.html"
    }
]