[
    {
        "title": "Ayushman Bharat Hospital List 2025: Download PDF at hospitals.pmjay.gov.in",
        "snippet": "Step 4: give hospital ID, state, and district and all the suspended hospitals will show on screen. Download Ayushman Bharat Hospital List PDF Online. Step 1: Go to the PMJAY official website where you can find all the information on the dashboard. Step 2: To locate this option, navigate to the hospital list section of the scheme's main dashboard. Step 3: Choose the hospital list from the ...",
        "sentiment": "4 (Positive)",
        "link": "https://pmgovtschemehub.com/ayushman-bharat-hospital-list/"
    },
    {
        "title": "Ayushman Bharat Vaya Vandana: Full, state-wise list of hospitals ...",
        "snippet": "The Ayushman Vaya Vandana Card is part of the extended programme that provides complimentary healthcare coverage of up to Rs 5 lakh per year for all seniors aged 70 years and older, regardless of ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.businesstoday.in/personal-finance/insurance/story/ayushman-bharat-vaya-vandana-full-state-wise-list-of-hospitals-entitled-to-serve-senior-citizens-for-ab-pm-jay-health-cover-452884-2024-11-07"
    },
    {
        "title": "List Of Empaneled Hospitals Under Ayushman Bharat Yojana For Free ...",
        "snippet": "Benefits of the scheme are portable across the country i.e. a beneficiary can visit any empanelled public or private hospital in India to avail cashless treatment. Public hospitals are reimbursed for the healthcare services at par with the private hospitals. List Of Empaneled Hospitals Under Ayushman Bharat Yojna: Direct Link",
        "sentiment": "4 (Positive)",
        "link": "https://zeenews.india.com/personal-finance/list-of-empaneled-hospitals-under-ayushman-bharat-yojana-for-free-treatment-check-direct-link-here-2813786.html"
    },
    {
        "title": "Ayushman Bharat Hospital List | Ayushman Card Hospital List in India",
        "snippet": "Here you'll find a complete Ayushman Bharat hospital list, featuring facilities that accept the Ayushman card and are part of the PMJAY hospital list. What is Ayushman Bharat - PM-JAY? Ayushman Bharat - Pradhan Mantri Jan Arogya Yojana (AB PM-JAY) is the world's largest health assurance scheme, launched on 23rd September 2018.",
        "sentiment": "5 (Positive)",
        "link": "https://vikasyojna.in/ayushman-bharat-hospital-list/"
    },
    {
        "title": "Ayushman Bharat (PMJAY) Hospitals List India - Download PDF - HexaHealth",
        "snippet": "Many people find the list of network hospitals accepting the Ayushman card online, and have to suffer unexpected issues due to the lack of right information. Thus for your convenience, we have come up with the PMJAY hospitals list where all the information is correct and up-to-date. ... (PMJAY), is a scheme that aims to give medical care to the ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat"
    },
    {
        "title": "Ayushman Card List of Hospitals in New Delhi - Bookmyinfo",
        "snippet": "The Ayushman Card list of hospitals in Delhi NCR scheme was launched in September 2018 and is operational in 21 states and union territories. ... Park Hospital A unit of Park Medi World Pvt Ltd: 9871322933: Private(For-Profit) NEW DELHI: PMJAY: 23: Vision Eye Hospital: 9868404003: Private(For-Profit) NEW DELHI: PMJAY: 24:",
        "sentiment": "4 (Positive)",
        "link": "https://bookmyinfo.com/ayushman-card-list-of-hospitals-in-new-delhi/"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Gurugram - Download PDF - HexaHealth",
        "snippet": "The Signature Hospital A Unit Of Park Medicity North Pvt Ltd. Hospital Type Private. Insurance Type PMJAY. Area Haryana, Gurugram. 1; 2; Explore Top Hospitals in Gurugram. ... Ayushman card hospitals include some of the critical diseases such as prostate cancer, COVID-19, coronary artery bypass graft, anterior spine fixation, etc. in Gurugram. ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-gurugram"
    },
    {
        "title": "Ayushman Vaya Vandana Card List 2025 Search Beneficiary",
        "snippet": "Benefits of Ayushman Vaya Vandana Card. The Ayushman Vaya Vandana Card would provide free hospital treatment to all seniors over 70 in the country. Under the new initiative, everyone who receives an Ayushman Vaya Vandana card in 2024 will be eligible for free medical treatment up to Rs 5 lakh at any hospital affiliated with AB PMJAY.",
        "sentiment": "4 (Positive)",
        "link": "https://pmgovtschemehub.com/ayushman-vaya-vandana-card-list/"
    },
    {
        "title": "PMJAY Hospitals List: Ayushman Bharat Card Hospitals List 2024",
        "snippet": "Explore the Ayushman Card hospital list to find quality healthcare facilities nationwide. Access approved hospitals and providers for comprehensive medical coverage. Apply as an Advisor About Us Call Us: 07938471028 Term Insurance ...",
        "sentiment": "3 (Neutral)",
        "link": "https://www.beshak.org/insurance/health-insurance/articles/ayushman-bharat-pmjay-card-hospital-list/"
    },
    {
        "title": "PMJAY Hospital List Ahmedabad - A to Z Sarkari Mahiti",
        "snippet": "The scheme covers a total of 197 hospitals in Ahmedabad district including 122 private hospitals and 75 government hospitals. We have provided the name of the hospital, full address of the hospital and contact number of the hospital in the list of hospitals in Ahmedabad district that provide free treatment under the Ayushman card scheme.. If you want to get more detailed information about the ...",
        "sentiment": "4 (Positive)",
        "link": "https://atozsarkarimahiti.com/pmjay-hospital-list-ahmedabad/"
    },
    {
        "title": "Ayushman Card List Of Hospitals In Gurugram - Bookmyinfo",
        "snippet": "Are you aware of the Ayushman Card scheme that provides free healthcare services to low-income families in India? If you reside in Gurgaon and are looking for information on which Ayushman Card List Of Hospitals in Gurugram is included in this scheme, then you're at the right place.The Ayushman Cardholders can benefit from an extensive network of impaneled hospitals and healthcare providers ...",
        "sentiment": "4 (Positive)",
        "link": "https://bookmyinfo.com/ayushman-card-list-of-hospitals-in-gurugram/"
    },
    {
        "title": "Ayushman Card Hospital List in Ranchi, Jharkhand: Download PDF - A to Z ...",
        "snippet": "Here we have listed Ayushman card hospital in Ranchi covered under Pradhan Mantri Jan Arogya Yojana where you can get free treatment up to Rs. 5 lakh. ... Suppose you want to get information about a particular hospital or a specific hospital. In that case, ... Composite Hospital, Group Center, Crpf Sembo, Balalong, Near Dhurwa Dam, Ranchi ...",
        "sentiment": "5 (Positive)",
        "link": "https://atozsarkarimahiti.com/ayushman-card-hospital-list-in-ranchi/"
    },
    {
        "title": "Ayushman Card List Of Hospitals In Noida - Bookmyinfo",
        "snippet": "Introduction to the Ayushman Card. The hospital in Nodia under ayushman bharat is a new initiative by the Government of India that provides financial support to eligible families for healthcare expenses. The card can be used at any public or private hospital empanelled with Ayushman Bharat. Eligible families will receive an annual health insurance cover of Rs 5 lakhs.",
        "sentiment": "5 (Positive)",
        "link": "https://bookmyinfo.com/ayushman-card-list-of-hospitals-in-noida/"
    },
    {
        "title": "आयुष्मान कार्ड हॉस्पिटल लिस्ट गुरुग्राम, नये बदलाव के साथ - Ayushman ...",
        "snippet": "THE SIGNATURE HOSPITAL A UNIT OF PARK MEDICITY NORTH PVT.LTD. GURUGRAM: 9654010870: Private(For Profit) Only CGHS: 46: Sudarshan Poly Dental Centre: GURUGRAM: 9811007420: Only CGHS: 47: MUSKAAN DENTALS: GURUGRAM: 9811007420: ... Ayushman Card Hospital List In Gurugram Pdf Download.",
        "sentiment": "4 (Positive)",
        "link": "https://apniyojana.com/ayushman-card-hospital-list-in-gurugram/"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Panipat - Download PDF - HexaHealth",
        "snippet": "Park Hospital, Sewah. Max Plus Hospital and Truma Centre, Manmohan Nagar. Ravindra Hospital, Model Town. Neem Tree Healthcare, Model Town. ... Ayushman card hospitals include some of the critical diseases such as prostate cancer, COVID-19, coronary artery bypass graft, anterior spine fixation, etc. in Panipat. ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-panipat"
    },
    {
        "title": "Ayushman Card Hospital List in Amritsar, Punjab: Download PDF - A to Z ...",
        "snippet": "Here we have listed Ayushman card hospital in Amritsar covered under Pradhan Mantri Jan Arogya Yojana where you can get free treatment up to Rs. 5 lakh. Free treatment is available in a Total of 144 Hospital in Amritsar including 130 Private hospitals and 14 Government hospitals in Amritsar under the Pradhan Mantri Jan Arogya Yojana.",
        "sentiment": "5 (Positive)",
        "link": "https://atozsarkarimahiti.com/ayushman-card-hospital-list-in-amritsar/"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Gorakhpur - Download PDF - HexaHealth",
        "snippet": "Ayushman card hospitals include some of the critical diseases such as prostate cancer, COVID-19, coronary artery bypass graft, anterior spine fixation, etc. in Gorakhpur. For more details you can check Ayushman Bharat covered diseases list in network hospitals of Gorakhpur. Ayushman Card Hospitals List in Other Cities.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-gorakhpur"
    },
    {
        "title": "Ayushman Card Hospital List in Sonipat, Haryana: Download PDF",
        "snippet": "Here we have listed Ayushman card hospital in Sonipat covered under Pradhan Mantri Jan Arogya Yojana where you can get free treatment up to Rs. 5 lakh. Free treatment is available in a Total of 40 hospital in Sonipat including 29 Private hospitals and 11 Government hospitals in Sonipat under the Pradhan Mantri Jan Arogya Yojana.",
        "sentiment": "5 (Positive)",
        "link": "https://atozsarkarimahiti.com/ayushman-card-hospital-list-in-sonipat/"
    },
    {
        "title": "How to Make Ayushman Card - National Health Authority | GOI",
        "snippet": "How to Make Ayushman Card National Health Authority",
        "sentiment": "3 (Neutral)",
        "link": "https://nha.gov.in/Ayushman-Card"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Ludhiana - Download PDF - HexaHealth",
        "snippet": "Ayushman card hospitals include some of the critical diseases such as prostate cancer, COVID-19, coronary artery bypass graft, anterior spine fixation, etc. in Ludhiana. For more details you can check Ayushman Bharat covered diseases list in network hospitals of Ludhiana.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-ludhiana"
    },
    {
        "title": "Ayushman Card Hospital List in Vadodara - ApniYojana.com",
        "snippet": "By viewing Ayushman Card Hospital List In Vadodara PDF, you will be able to see the names of hospitals associated with Ayushman Bharat Scheme from your mobile. Ayushman Card Hospital List In Vadodara. Sno: Hospital Name: District: Hospital Contact: Hospital Type: Empanelment Type: 1: MANGALAM ORTHOPAEDIC HOSPITAL: VADODARA:",
        "sentiment": "4 (Positive)",
        "link": "https://apniyojana.com/ayushman-card-hospital-list-in-vadodara/"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Gwalior - Download PDF - HexaHealth",
        "snippet": "Jaya Arogya Hospital Group ,Lashkar. RJN Apollo Spectra Hospital. ITM Hospital And Research Centre, Sithouli. Link Hospital , Gwalior. ... Ayushman card hospitals include some of the critical diseases such as prostate cancer, COVID-19, coronary artery bypass graft, anterior spine fixation, etc. in Gwalior. ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-gwalior"
    },
    {
        "title": "Ayushman Card List Of Hospitals In Patna - Bookmyinfo",
        "snippet": "Introduction to Ayushman Card. The Ayushman Card is a health insurance scheme launched by the government of India. It provides financial protection to poor and economically backward families in case of medical emergencies. The cardholders are entitled to free medical treatment at all government hospitals and select private hospitals across the country.",
        "sentiment": "1 (Negative)",
        "link": "https://bookmyinfo.com/ayushman-card-list-of-hospitals-in-patna/"
    },
    {
        "title": "Ayushman Card Hospital List in Chennai",
        "snippet": "Ayushman-Card-Hospital-List-In-Chennai - Free download as PDF File (.pdf), Text File (.txt) or read online for free. The document appears to be a list of 20 hospitals in Tamil Nadu, India that have been approved for empanelment under the PMJAY public health insurance program. It includes information on each hospital's ID number, name, location, contact details, specialties, and application status.",
        "sentiment": "1 (Negative)",
        "link": "https://www.scribd.com/document/706070401/Ayushman-Card-Hospital-List-In-Chennai"
    },
    {
        "title": "Ayushman Card Hospital List in Ahmedabad - ApniYojana.com",
        "snippet": "By viewing Ayushman Card Hospital List In Ahmedabad PDF, you will be able to see the names of hospitals associated with Ayushman Bharat Scheme from your mobile. Ayushman Card Hospital List In Ahmedabad. Sno: Hospital Name: District: Hospital Contact: Hospital Type: Empanelment Type: 1: The Gujarat Cancer and Research Institute: AHMEDABAD:",
        "sentiment": "4 (Positive)",
        "link": "https://apniyojana.com/ayushman-card-hospital-list-in-ahmedabad/"
    },
    {
        "title": "आयुष्मान कार्ड हॉस्पिटल लिस्ट लखनऊ, नये बदलाव के साथ - Ayushman Card ...",
        "snippet": "Ayushman Card Hospital List In Lucknow PDF . भारत के प्रधानमंत्री नरेंद्र मोदी जी ने आयुष् ...",
        "sentiment": "4 (Positive)",
        "link": "https://apniyojana.com/ayushman-card-hospital-list-in-lucknow/"
    },
    {
        "title": "Ayushman Bharat Hospital List in Chennai - ApniYojana.com",
        "snippet": "By viewing Ayushman Card Hospital List In Chennai PDF, you will be able to see the names of hospitals associated with Ayushman Bharat Scheme from your mobile. Ayushman Card Hospital List In Chennai. Sno: Hospital Name: District: Hospital Contact: Hospital Type: Empanelment Type: 1: Chennai Port Trust Hospital: CHENNAI: 9444860807:",
        "sentiment": "4 (Positive)",
        "link": "https://apniyojana.com/ayushman-bharat-hospital-list-in-chennai/"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Faridabad - Download PDF - HexaHealth",
        "snippet": "Park Hospital A Unit Of Aggarwal Hospital And Research Services Pvt Ltd. Hospital Type Private. Insurance Type PMJAY. Area Haryana, Faridabad. Pawan Hospital. ... Ayushman card hospitals include some of the critical diseases such as prostate cancer, COVID-19, coronary artery bypass graft, anterior spine fixation, etc. in Faridabad. ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-faridabad"
    },
    {
        "title": "Ayushman Card List Of Hospitals In Chandigarh - Bookmyinfo",
        "snippet": "Benefits of the Ayushman Bharat Programme for Patients. The ayushman bharat hospital list in Chandigarh provides annual health insurance coverage of up to Rs. 5 lahks per family for secondary and tertiary care hospitalization. This means that patients can avail of quality healthcare at affordable prices by availing of the services of hospital under ayushman bharat in Chandigarh under the program.",
        "sentiment": "4 (Positive)",
        "link": "https://bookmyinfo.com/ayushman-card-list-of-hospitals-in-chandigarh/"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Assam - Download PDF - HexaHealth",
        "snippet": "Ayushman card hospitals include some of the critical diseases such as prostate cancer, COVID-19, coronary artery bypass graft, anterior spine fixation, etc. in Assam. For more details you can check Ayushman Bharat covered diseases list in network hospitals of Assam. Top Doctors. Top Hospitals.",
        "sentiment": "4 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-assam"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Agra - Download PDF - HexaHealth",
        "snippet": "Ayushman card hospitals include some of the critical diseases such as prostate cancer, COVID-19, coronary artery bypass graft, anterior spine fixation, etc. in Agra. For more details you can check Ayushman Bharat covered diseases list in network hospitals of Agra. Ayushman Card Hospitals List in Other Cities.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-agra"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Sonipat - Download PDF - HexaHealth",
        "snippet": "To view the AB-PMJAY panelled hospitals in Sonipat, you need to visit the official website https://hospitals.pmjay.gov.in. Click on 'Find Hospitals' and enter Sonipat, along with the District, Hospital Type, Speciality, Hospital Name, and Empanelment Type. Click on the Search button and get the list of all hospitals in one place.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-sonipat"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Jharkhand - Download PDF - HexaHealth",
        "snippet": "Ayushman card hospitals include some of the critical diseases such as prostate cancer, COVID-19, coronary artery bypass graft, anterior spine fixation, etc. in Jharkhand. For more details you can check Ayushman Bharat covered diseases list in network hospitals of Jharkhand. Top Doctors. Top Hospitals.",
        "sentiment": "1 (Negative)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-jharkhand"
    },
    {
        "title": "Ayushman Card Hospitals List in Sabarkantha, Gujarat: Download PDF",
        "snippet": "The Ayushman Card Hospitals List in Sabarkantha, Gujarat, brings hope to those seeking quality healthcare without the burden of expenses.It falls under the Pradhan Mantri Jan Arogya Yojana (PMJAY), a government scheme that covers more than 23,000 private and government hospitals, providing access to top-notch medical facilities. In this article, we'll explore how the Ayushman card grants you ...",
        "sentiment": "4 (Positive)",
        "link": "https://atozsarkarimahiti.com/ayushman-card-hospitals-list-in-sabarkantha/"
    },
    {
        "title": "आयुष्मान भारत हॉस्पिटल लिस्ट हरियाणा | Ayushman Card Hospital List ...",
        "snippet": "Ayushman Bharat Hospital List Haryana | Ayushman Card Hospital List Haryana | Haryana PMJAY Hospital List PDF | Aayusman Bharat Hospital New List Haryana | Aayusman Hospital List PDF Download ... The Signature Hospital A unit of Park Medicity North Pvt Ltd: GURUGRAM: 8799700927: Private(For Profit) ... GROUP CENTRE CRPF PINJORE: PANCHKULA ...",
        "sentiment": "4 (Positive)",
        "link": "https://easyhindi.in/ayushman-bharat/ayushman-bharat-hospital-list-haryana/"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Amritsar - Download PDF - HexaHealth",
        "snippet": "Ayushman card hospitals include some of the critical diseases such as prostate cancer, COVID-19, coronary artery bypass graft, anterior spine fixation, etc. in Amritsar. For more details you can check Ayushman Bharat covered diseases list in network hospitals of Amritsar.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-amritsar"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Surat - Download PDF - HexaHealth",
        "snippet": "Ayushman card hospitals include some of the critical diseases such as prostate cancer, COVID-19, coronary artery bypass graft, anterior spine fixation, etc. in Surat. For more details you can check Ayushman Bharat covered diseases list in network hospitals of Surat. Ayushman Card Hospitals List in Other Cities. Ahmadabad.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-surat"
    },
    {
        "title": "Maha E Seva Kendra - Ayushman Bharat Card - Google Sites",
        "snippet": "The Ayushman Bharat card has had a transformative impact on the healthcare sector in India. 1. Increased Access The scheme has significantly increased access to healthcare services, especially in rural and remote areas where medical facilities are scarce.. 2. Reduced Out-of-Pocket Expenses By providing financial protection, the Ayushman Bharat card has reduced the burden of out-of-pocket ...",
        "sentiment": "4 (Positive)",
        "link": "https://sites.google.com/view/mahaesevac/ayushman-bharat-card"
    },
    {
        "title": "આયુષ્માન કાર્ડ હોસ્પિટલ લિસ્ટ અમદાવાદ | Ayushman Card Hospital List ...",
        "snippet": "Ayushman Card Hospital List Ahmedabad અમદાવાદની ખાનગી અને ખાનગી હોસ્પિટલો જે આયુષ્માન ભારત યોજના સાથે સંકળાયેલી છે. (આયુષ્માન કાર્ડ હોસ્પિટલ યાદી અમદાવાદ).",
        "sentiment": "1 (Negative)",
        "link": "https://www.infogujarati.com/ayushman-card-hospital-list-ahmedabad/"
    },
    {
        "title": "Ayushman Card Hospital List in Ludhiana, Punjab: Download PDF - A to Z ...",
        "snippet": "Here we have listed Ayushman card hospital in Ludhiana covered under Pradhan Mantri Jan Arogya Yojana where you can get free treatment up to Rs. 5 lakh. ... Suppose you want to get information about a particular hospital or a specific hospital. In that case, ... Civil Hospital, Field Ganj, Namdhari Samarak Park, Ludhiana, Ludhiana, Punjab ...",
        "sentiment": "5 (Positive)",
        "link": "https://atozsarkarimahiti.com/ayushman-card-hospital-list-in-ludhiana/"
    },
    {
        "title": "Ayushman Card List Of Hospitals In Bengaluru - Bookmyinfo",
        "snippet": "Everything You Need to Know About Ayushman Bharat List of Hospitals in Bengaluru: An Overview. Are you seeking quality healthcare facilities in Bengaluru under the Ayushman Bharat scheme? Look no further! This post'll give you a comprehensive rundown of all the hospitals enlisted under the Ayushman card hospital list in Bengaluru. Whether it ...",
        "sentiment": "4 (Positive)",
        "link": "https://bookmyinfo.com/ayushman-card-list-of-hospitals-in-bengaluru/"
    },
    {
        "title": "Ayushman Card Hospital List in Raipur, Chhattisgarh: Download PDF",
        "snippet": "Here we have listed Ayushman card hospital in Raipur covered under Pradhan Mantri Jan Arogya Yojana where you can get free treatment up to Rs. 5 lakh. Free treatment is available in a Total of 254 Hospital in Raipur including 201 Private hospitals and 53 Government hospitals in Raipur under the Pradhan Mantri Jan Arogya Yojana.",
        "sentiment": "5 (Positive)",
        "link": "https://atozsarkarimahiti.com/ayushman-card-hospital-list-in-raipur/"
    },
    {
        "title": "Ahmedabad Ayushman Card Hospital List - 1PDF",
        "snippet": "Ayushman Bharat hospitals list in Ahmadabad includes the top empanelled hospitals along with their address and contact details. To download the Ayushman Bharat Hospital list PDF in Ahmadabad, visit the official website. Select Ahmadabad, Hospital Type, Speciality, Empanelment Type and Click on 'Search' Updated List of Ayushman Hospitals ...",
        "sentiment": "5 (Positive)",
        "link": "https://1pdf.in/ayushman-card-hospital-list-ahmedabad/"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Bhopal - Download PDF - HexaHealth",
        "snippet": "Ayushman card hospitals include some of the critical diseases such as prostate cancer, COVID-19, coronary artery bypass graft, anterior spine fixation, etc. in Bhopal. For more details you can check Ayushman Bharat covered diseases list in network hospitals of Bhopal.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-bhopal"
    },
    {
        "title": "आयुष्मान कार्ड हॉस्पिटल लिस्ट ग्‍वालियर, नये बदलाव के साथ - Ayushman ...",
        "snippet": "Ayushman Card Hospital List In Gwalior PDF . भारत के प्रधानमंत्री नरेंद्र मोदी जी ने आयुष् ...",
        "sentiment": "4 (Positive)",
        "link": "https://apniyojana.com/ayushman-card-hospital-list-in-gwalior/"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Vadodara - Download PDF - HexaHealth",
        "snippet": "Ayushman card hospitals include some of the critical diseases such as prostate cancer, COVID-19, coronary artery bypass graft, anterior spine fixation, etc. in Vadodara. For more details you can check Ayushman Bharat covered diseases list in network hospitals of Vadodara. Ayushman Card Hospitals List in Other Cities.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-vadodara"
    },
    {
        "title": "Ayushman Bharat Yojana 2024 - Eligibility & Benefits - Vakil Search",
        "snippet": "Overview: The Prime Minister of our country, Narendra Modi, launched the Ayushman Bharat Pradhan Mantri Jan Arogya Yojana in September 2018. The primary goal of launching Ayushman Bharat Yojana was to ensure that all citizens of the country have access to health care. Through this scheme, health insurance up to ₹ 500000 is provided by the government to the beneficiaries.",
        "sentiment": "1 (Negative)",
        "link": "https://vakilsearch.com/blog/ayushman-bharat-yojana/"
    },
    {
        "title": "आयुष्मान कार्ड हॉस्पिटल लिस्ट गाजियाबाद, नये बदलाव के साथ - Ayushman ...",
        "snippet": "Dental Park: GHAZIABAD: 9013591762: Private(For Profit) PMJAY: 89: SHREE SHYAM HOSPITAL & TRAUMA CENTER: GHAZIABAD: 9899139242: Private(Not For Profit) PMJAY: 90: KHATRI NURSING HOME: ... Ayushman Card Hospital List In Ghaziabad Uttar Pradesh . Ayushman Bharat Hospital List In Ghaziabad Uttar Pradesh .",
        "sentiment": "4 (Positive)",
        "link": "https://apniyojana.com/ayushman-card-hospital-list-in-ghaziabad/"
    },
    {
        "title": "Is Ayushman card accepted by private hospitals, is it c - HexaHealth",
        "snippet": "Hi Chandan, Yes, the Ayushman Bharat Pradhan Mantri Jan Arogya Yojana (PM-JAY) is accepted by many private hospitals across India. Under this scheme, eligible beneficiaries can receive cashless treatment for a variety of medical conditions at both government and empanelled private hospitals.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/questions/others/is-ayushman-card-accepted-by-private-hospitals-is-it-cash-free-treatment"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Rajasthan - Download PDF - HexaHealth",
        "snippet": "Park Hospital, Behror. Amar Medical and Research Centre (Park Hospital), Mansarovar. Centre for Sight, Malviya Nagar. ... Ayushman card hospitals include some of the critical diseases such as prostate cancer, COVID-19, coronary artery bypass graft, anterior spine fixation, etc. in Rajasthan. ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-rajasthan"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Jaipur - Download PDF - HexaHealth",
        "snippet": "To view the AB-PMJAY panelled hospitals in Jaipur, you need to visit the official website https://hospitals.pmjay.gov.in. Click on 'Find Hospitals' and enter Jaipur, along with the District, Hospital Type, Speciality, Hospital Name, and Empanelment Type. Click on the Search button and get the list of all hospitals in one place.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-jaipur"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Kanpur Nagar - Download PDF - HexaHealth",
        "snippet": "Ayushman card hospitals include some of the critical diseases such as prostate cancer, COVID-19, coronary artery bypass graft, anterior spine fixation, etc. in Kanpur Nagar. For more details you can check Ayushman Bharat covered diseases list in network hospitals of Kanpur Nagar.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-kanpur-nagar"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Ranchi - Download PDF - HexaHealth",
        "snippet": "Ayushman card hospitals include some of the critical diseases such as prostate cancer, COVID-19, coronary artery bypass graft, anterior spine fixation, etc. in Ranchi. For more details you can check Ayushman Bharat covered diseases list in network hospitals of Ranchi. Ayushman Card Hospitals List in Other Cities. Bokaro.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-ranchi"
    },
    {
        "title": "Ayushman Card Hospitals List in Agra, Uttar Pradesh: Download PDF",
        "snippet": "The Ayushman Card Hospitals List in Agra, Uttar Pradesh, brings hope to those seeking quality healthcare without the burden of expenses.It falls under the Pradhan Mantri Jan Arogya Yojana (PMJAY), a government scheme that covers more than 23,000 private and government hospitals, providing access to top-notch medical facilities. In this article, we'll explore how the Ayushman card grants you ...",
        "sentiment": "4 (Positive)",
        "link": "https://atozsarkarimahiti.com/ayushman-card-hospitals-list-in-agra/"
    },
    {
        "title": "Ayushman Card Hospital Suchi 2024: आयुष्मान हॉस्पिटल लिस्ट, इन ...",
        "snippet": "Ayushman Card Hospital Suchi 2024 : केंद्र सरकार के द्वारा आयुष्मान कार्ड योजना का शुभारंभ किया गया है इसके अंतर्गत गरीब वर्ग के लोगों को सरकार के द्वारा 5 लाख रूपये तक की ...",
        "sentiment": "1 (Negative)",
        "link": "https://bshb.in/ayushman-card-hospital-suchi/"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Nagpur - Download PDF - HexaHealth",
        "snippet": "Ayushman card hospitals include some of the critical diseases such as prostate cancer, COVID-19, coronary artery bypass graft, anterior spine fixation, etc. in Nagpur. For more details you can check Ayushman Bharat covered diseases list in network hospitals of Nagpur. Ayushman Card Hospitals List in Other Cities.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-nagpur"
    },
    {
        "title": "Ayushman Card Hospital List in Vijayawada - ApniYojana.com",
        "snippet": "By viewing Ayushman Card Hospital List In Vijayawada PDF, you will be able to see the names of hospitals associated with Ayushman Bharat Scheme from your mobile. Ayushman Card Hospital List In Vijayawada. Sno: Hospital Name: District: Hospital Contact: Hospital Type: Empanelment Type: 1: PHC-Kalidindi: KRISHNA: NA: Public: PMJAY: 2: PHC ...",
        "sentiment": "4 (Positive)",
        "link": "https://apniyojana.com/ayushman-card-hospital-list-in-vijayawada/"
    },
    {
        "title": "Ayushman Vaya Vandana Card 2025: How to Apply Online",
        "snippet": "The Ayushman Vaya Vandana Card would provide free hospital treatment to all seniors in the country who are over 70. With the new scheme, everyone who receives an Ayushman Vaya Vandana card in 2025 will get free medical care at any hospital associated with AB PMJAY up to Rs 5 lakh. Objective of Ayushman Vaya Vandana Card",
        "sentiment": "4 (Positive)",
        "link": "https://pmgovtschemehub.com/ayushman-vaya-vandana-card/"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Ghaziabad - Download PDF - HexaHealth",
        "snippet": "Ayushman card hospitals include some of the critical diseases such as prostate cancer, COVID-19, coronary artery bypass graft, anterior spine fixation, etc. in Ghaziabad. For more details you can check Ayushman Bharat covered diseases list in network hospitals of Ghaziabad. Ayushman Card Hospitals List in Other Cities.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-ghaziabad"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Chandigarh - Download PDF - HexaHealth",
        "snippet": "Ayushman card hospitals include some of the critical diseases such as prostate cancer, COVID-19, coronary artery bypass graft, anterior spine fixation, etc. in Chandigarh. For more details you can check Ayushman Bharat covered diseases list in network hospitals of Chandigarh. Top Doctors. Top Hospitals.",
        "sentiment": "1 (Negative)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-chandigarh"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Meerut - Download PDF - HexaHealth",
        "snippet": "Ayushman card hospitals include some of the critical diseases such as prostate cancer, COVID-19, coronary artery bypass graft, anterior spine fixation, etc. in Meerut. For more details you can check Ayushman Bharat covered diseases list in network hospitals of Meerut. Ayushman Card Hospitals List in Other Cities.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-meerut"
    },
    {
        "title": "आयुष्मान कार्ड हॉस्पिटल लिस्ट कानपुर, नये बदलाव के साथ - Ayushman Card ...",
        "snippet": "Ayushman Card Hospital List In Kanpur PDF . भारत के प्रधानमंत्री नरेंद्र मोदी जी ने आयुष् ...",
        "sentiment": "4 (Positive)",
        "link": "https://apniyojana.com/ayushman-card-hospital-list-in-kanpur/"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Purnia - Download PDF - HexaHealth",
        "snippet": "Ayushman card hospitals include some of the critical diseases such as prostate cancer, COVID-19, coronary artery bypass graft, anterior spine fixation, etc. in Purnia. For more details you can check Ayushman Bharat covered diseases list in network hospitals of Purnia. Ayushman Card Hospitals List in Other Cities.",
        "sentiment": "5 (Positive)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-purnia"
    },
    {
        "title": "Ayushman Bharat Hospitals List in Dhanbad - Download PDF - HexaHealth",
        "snippet": "Ayushman card hospitals include some of the critical diseases such as prostate cancer, COVID-19, coronary artery bypass graft, anterior spine fixation, etc. in Dhanbad. For more details you can check Ayushman Bharat covered diseases list in network hospitals of Dhanbad. Ayushman Card Hospitals List in Other Cities. Bokaro.",
        "sentiment": "1 (Negative)",
        "link": "https://www.hexahealth.com/hospitals/insurance/ayushman-bharat-hospitals-list-in-dhanbad"
    },
    {
        "title": "Ayushman Bharat Hospital List in Hyderabad - ApniYojana.com",
        "snippet": "Through the Hyderabad Ayushman Card Hospital, you can get free health services up to 5 lakhs in any hospital associated with Ayushman Yojana. The process to view the list of hospitals of Hyderabad related to Ayushman Jan Arogya Yojana through mobile is explained below.",
        "sentiment": "4 (Positive)",
        "link": "https://apniyojana.com/ayushman-bharat-hospital-list-in-hyderabad/"
    }
]