[
    {
        "title": "Former Rush Oak Park chief operating officer indicted for fraud",
        "snippet": "Robert Spadoni, 58, was charged with three counts of mail fraud and three counts of money laundering. Each count of mail fraud and money laundering is punishable by up to 20 years and 10 years in ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.oakpark.com/2023/02/16/former-rush-oak-park-chief-operating-officer-indicted-for-fraud/"
    },
    {
        "title": "Ten Defendants Charged in $1.4 Billion Rural Hospital Pass-Through ...",
        "snippet": "The indictment also alleges that the conspirators engaged in sophisticated money laundering to promote the scheme and to distribute the fraudulent proceeds. The rural hospitals involved in this case are: Cambellton-Graceville Hospital (CGH), a 25-bed rural hospital located in Graceville, Florida; Regional General Hospital of Williston, a 40-bed ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.justice.gov/opa/pr/ten-defendants-charged-14-billion-rural-hospital-pass-through-billing-scheme"
    },
    {
        "title": "14 Defendants Sentenced to 74+ Years in Forest Park Healthcare Fraud",
        "snippet": "• Dr. Shawn Henry, a spinal surgeon who invested in FMPC, was found guilty on three of three counts, including conspiracy, commercial bribery, and money laundering. He was sentenced Wednesday to ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.fda.gov/inspections-compliance-enforcement-and-criminal-investigations/press-releases/14-defendants-sentenced-74-years-forest-park-healthcare-fraud"
    },
    {
        "title": "PDF",
        "snippet": "Besides, the group is driven by strong management team with well demarcated departments headed by experienced persons. The existing management of the hospital is ably supported by a team of renowned medics and ... Park Hospitals was incorporated in 1990 by the Ambuja-Neotia Group of Kolkata. The company is a non-profit making company",
        "sentiment": "1 (Negative)",
        "link": "https://www.careratings.com/upload/CompanyFiles/PR/07012022061901_Park_Hospitals.pdf"
    },
    {
        "title": "Dental Practice Owners Charged with Fraud and RICO Conspiracy",
        "snippet": "On Jan. 18, a federal grand jury returned an indictment charging 12 individuals with operating and participating in a series of dental practices and related companies (the Savani Group) that engaged in visa fraud, health care fraud, wire fraud involving federal tax evasion, and money laundering.",
        "sentiment": "1 (Negative)",
        "link": "https://www.justice.gov/opa/pr/dental-practice-owners-charged-fraud-and-rico-conspiracy"
    },
    {
        "title": "PDF",
        "snippet": "Park Hospitals was incorporated in 1990 by the Ambuja Neotia Group of Kolkata. The company is a non-profit-making company ... Besides the BNWCCC, the group has set up a multi-specialty hospital in Siliguri 2012, which is operating satisfactorily. Brief Financials (₹ crore) March 31, 2022 (A) March 31, 2023 (A) Total operating income 107.28 122.61",
        "sentiment": "1 (Negative)",
        "link": "https://www.careratings.com/upload/CompanyFiles/PR/202402130236_Park_Hospitals.pdf"
    },
    {
        "title": "Advance Super Multi Speciality Hospital in Gurugram Sector 37D",
        "snippet": "With 40 years of experience, the best is the threshold from where Signature Hospital ups the ante in expertise and technology, when it comes to healthcare services. Once any person steps into Signature Hospital, they can experience what satisfaction and complete care feel like.",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/hospital/super-multispeciality-hospital-in-gurgaon-37D"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Signature Hospital Quick Appointment Appointment. Contact Us Ambulance/Emergency. Park Emergency +91-9916699166. Delhi +91-7533033025. Gurugram +91-7503141435. Palam Vihar +91-9891424242. The Signature, Gurugram +91-6262828213 ... Park Group of Hospitals, situated in North India, is a landmark healthcare entity of global standards. ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Signature Hospital Quick Appointment Appointment. Contact Us Ambulance/Emergency. Park Emergency +91-9916699166. Delhi +91-7533033025. Gurugram +91-7503141435. Palam Vihar +91-9891424242. The Signature, Gurugram +91-6262828213 ... Dr. Ajit Gupta is the Founder of the Park Group of Hospitals. His avid passion for subject of healthcare in respect ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/visionaries"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Park hospital is the fastest growing chain of advanced super speciality hospitals, Provides patients with best & affordable healthcare treatment. ... At Park Group of Hospitals, we foster a healthy, safe, and productive work environment with a well-defined positive culture for our employees, while promoting a rewarding work & learning ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/career"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Park hospital is the fastest growing chain of advanced super speciality hospitals, Provides patients with best & affordable healthcare treatment. ... Group Director - Legal. Rakesh Bhardwaj. Vice President - Legal. Atin Mehta. Senior Law Officer. ... The Signature Hospital. Dr. Pardeep Singh. Deputy Medical Superintendent. Panipat. Brig. Yesh ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.parkhospital.in/meet-our-management"
    },
    {
        "title": "Signature Group of Hospital",
        "snippet": "1 They have got my project on time with the competition with a highly skilled, well-organized and experienced team of professional Engineers. So, that our company is looking forward to give more projects.",
        "sentiment": "5 (Positive)",
        "link": "https://signaturegroupofhospital.com/"
    },
    {
        "title": "Tenth Person Sentenced For Forgery And Money Laundering Offences In ...",
        "snippet": "On 10 June 2024, Su Jianfeng, a 36-year-old male Vanuatu national, was sentenced to 17 months' imprisonment for one count of fraudulently using a forged document, an offence under Section 471 read with Section 465 of the Penal Code (\"the Penal Code\"), and one count of money laundering under Section 54(1)(c) of the Corruption, Drug Trafficking and Other Serious Crimes (Confiscation of ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.police.gov.sg/Media-Room/News/20240610_tenth_person_sentenced_for_forgery_and_money_laundering_offences"
    },
    {
        "title": "Singapore - The Straits Times",
        "snippet": "SINGAPORE - In one of the biggest anti-money laundering operations here, the Singapore Police Force (SPF) rounded up a group of foreigners who had amassed about $1 billion worth of assets here ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.straitstimes.com/singapore/1b-in-cash-and-assets-seized-and-frozen-30-foreigners-probed-for-money-laundering-and-forgery"
    },
    {
        "title": "Former Chicago hospital CFO, 2 others charged in $15 million ...",
        "snippet": "Ahmed, 40, the hospital's former chief financial officer, is charged with eight counts of wire fraud, four counts of embezzlement, eleven counts of aiding and abetting embezzlement, and three ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.cbsnews.com/chicago/news/loretto-hospital-embezzlement-anosh-ahmed-indictment/"
    },
    {
        "title": "original-ufdc.uflib.ufl.edu",
        "snippet": "Clay hospital Clay Today staff ORANGE PARK St. Vincent's Medical ... with undercover money laundering, nar-cotics and gangs throughout his 10-year career with the Florida Department of Law Enforcement. ... signature. Please contact U.S. Senators Mel Martinez (202-224-3041) and Bill",
        "sentiment": "1 (Negative)",
        "link": "https://original-ufdc.uflib.ufl.edu/UF00028416/00177"
    },
    {
        "title": "Black Market Peso Exchange in Money Laundering - Financial Crime Academy",
        "snippet": "The Black Market Peso Exchange is the Western Hemisphere's most extensive money laundering methodology. BMPE is a method of money laundering in which money earned through trade is embezzled through international trade and blocked currency accounts. It is also the process of cashing out and laundering profits from the illegal drug trade.",
        "sentiment": "4 (Positive)",
        "link": "https://financialcrimeacademy.org/black-market-peso-exchange-definition/"
    },
    {
        "title": "Seized Assets in Money Laundering Investigations: What Happens To Them?",
        "snippet": "In the 2023 money laundering case that took Singapore by storm, the assets seized included bank accounts, cash (including foreign currencies) and properties, along with other physical assets such as vehicles, gold bars, luxury bags and watches, jewellery, electronic devices like computers and mobile phones, and even bottles of liquor and wine. ...",
        "sentiment": "1 (Negative)",
        "link": "https://singaporelegaladvice.com/law-articles/seized-assets-money-laundering-investigations/"
    },
    {
        "title": "Park Group of Hospitals | LinkedIn",
        "snippet": "Book an Appointment with Dr. Sachin Abrol, Consultant - Urology at Park Hospital, Panipat Consult Now: 7027 8989 89, 99166 99166 Park Group of Hospitals: NABL & NABH Accredited 30+ Specialties 10 Lakhs+ Patients Treated 1.5 Lakhs+ International Patients Treated 1 Lakh+ Surgeries Completed . . .",
        "sentiment": "5 (Positive)",
        "link": "https://in.linkedin.com/company/park-hospital"
    },
    {
        "title": "Park Group of Hospitals - LinkedIn",
        "snippet": "Park Group of Hospital is the fastest growing chain of hospitals in Delhi NCR, which presently has over 1500 beds, and has attained supremacy in the field of healthcare with its crème-de-la ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.linkedin.com/company/parkgroupofhospitals"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Park Group of Hospitals has witnessed incredible growth to become one of the most advanced & comprehensive healthcare institutions in the region. 1982-2010. 2011-2020. 2021-Present. Our Journey. 1982 ... The Signature Hospital in Gurugram with 300 beds. 2020",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/our-journey"
    },
    {
        "title": "SIGNATURE HOTEL GROUP LIMITED - Companies House",
        "snippet": "People for SIGNATURE HOTEL GROUP LIMITED (03929827) Charges for SIGNATURE HOTEL GROUP LIMITED (03929827) More for SIGNATURE HOTEL GROUP LIMITED (03929827) Registered office address Dunchurch Park Conference Centre, Rugby Road, Dunchurch, Warwickshire, CV22 6QW . Company status Active Company type Private limited Company Incorporated on 21 ...",
        "sentiment": "1 (Negative)",
        "link": "https://find-and-update.company-information.service.gov.uk/company/03929827"
    },
    {
        "title": "Park Group of Hospitals on LinkedIn: #redachieversaward # ...",
        "snippet": "NEDC \"Step into the future of healthcare with NEDC's Hospital Management program. Enroll now and lead the change! For More Information Contact Us +91 8383864331, +91 9015216589 #FutureOfHealthcare ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.linkedin.com/posts/park-hospital_redachieversaward-grecianhospital-parkgroupofhospitals-activity-7215180161585979392-vC4y"
    },
    {
        "title": "Know more about Park Hospital, who we are and our people",
        "snippet": "Park Group of Hospitals, equipped with world class facilities is one of the most advanced and comprehensive healthcare institutions. ... Signature Hospital Quick Appointment Appointment. Contact Us Ambulance/Emergency. Park Emergency +91-9916699166. Delhi +91-7533033025. Gurugram +91-7503141435. Palam Vihar +91-9891424242. The Signature ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.parkhospital.in/about-us"
    },
    {
        "title": "Mozambique's ex-finance minister faces sentencing in New York in 'tuna ...",
        "snippet": "Mozambique's former finance minister is set to be sentenced in a New York court on wire fraud and money laundering charges stemming from the infamous \"tuna bond\" scandal that triggered",
        "sentiment": "1 (Negative)",
        "link": "https://www.thederrick.com/ap/business/mozambique-s-ex-finance-minister-faces-sentencing-in-new-york-in-tuna-bonds-corruption-case/article_3a41ca9f-00b1-5ac1-84c1-964ba844925f.html"
    },
    {
        "title": "SPF | Ten Foreign Nationals To Be Charged For Offences Including ...",
        "snippet": "The Police have arrested ten persons, aged between 31 and 44, for their suspected involvement in offences of forgery and/or, money laundering, and resistance to lawful apprehension.",
        "sentiment": "1 (Negative)",
        "link": "https://www.police.gov.sg/Media-Room/News/20230816_10_Foreign_Nationals_Offences_Forgery_Money_Launder_Est_1_Bil_Assets"
    },
    {
        "title": "Money Laundering through Hospitals - Indiaforensic",
        "snippet": "Money Laundering through Hospitals- Risk Management. Risk professionals; let's give food for our brains: Promoter integrity: Doctors are mere instruments in the hands of non medical management. I am sure everyone is aware, the managements of such hospitals are \"HIGH\" risk category customers and many a times PEP's. EDD measures have to ...",
        "sentiment": "1 (Negative)",
        "link": "https://indiaforensic.com/certifications/money-laundering-through-hospitals/"
    },
    {
        "title": "Security Affairs - Page 2 of 1671 - Read, think, share … Security is ...",
        "snippet": "Operation Destabilise dismantled Russian money laundering networks | Russia-linked APT Secret Blizzard spotted using infrastructure of other threat actors | China-linked APT Salt Typhoon has breached telcos in dozens of countries | Black Basta ransomware gang hit BT Group | Authorities shut down Crimenetwork, the Germany's largest crime marketplace",
        "sentiment": "1 (Negative)",
        "link": "https://securityaffairs.com/page/2?page=4176"
    },
    {
        "title": "Intelligence Archives - Page 164 of 164 - Security Affairs",
        "snippet": "Operation Destabilise dismantled Russian money laundering networks | Russia-linked APT Secret Blizzard spotted using infrastructure of other threat actors | China-linked APT Salt Typhoon has breached telcos in dozens of countries | Black Basta ransomware gang hit BT Group | Authorities shut down Crimenetwork, the Germany's largest crime marketplace",
        "sentiment": "1 (Negative)",
        "link": "https://securityaffairs.com/category/intelligence/page/164"
    },
    {
        "title": "District of Utah | 24 Defendants, including a Utah Business Owner ...",
        "snippet": "Today, a federal magistrate judge ordered the last of 23 individual defendants in a large scale drug trafficking and money laundering case detained. The total of defendants now in custody is 22 out of 23 individuals who were charged in a superseding indictment with 33 federal crimes, including laundering millions of dollars via wire transfers from Utah to Mexico and Honduras. A",
        "sentiment": "1 (Negative)",
        "link": "https://www.justice.gov/usao-ut/pr/24-defendants-including-utah-business-owner-accused-running-drug-and-money-laundering"
    },
    {
        "title": "The Collapse of Signature Bank: Chronic Deficiencies in AML and ...",
        "snippet": "The Federal Deposit Insurance Corp. (FDIC) disclosed that it was preparing a consent order against Signature Bank for 'apparent violations' of US sanctions and anti-money laundering (AML) rules before the Manhattan-headquartered lender permanently closed down in March. Signature was previously the 29th-largest bank in the US but suffered a massive outflow of deposits after the",
        "sentiment": "1 (Negative)",
        "link": "https://fincrimeintelligence.com/the-collapse-of-signature-bank-chronic-deficiencies-in-aml-and-sanctions-compliance/"
    },
    {
        "title": "ED raids Hyderabad hospitals, medical colleges for money laundering in ...",
        "snippet": "The Enforcement Directorate (ED) on Wednesday, June 21, conducted raids at several corporate hospitals and private medical colleges in Hyderabad. The raids were",
        "sentiment": "1 (Negative)",
        "link": "https://www.thenewsminute.com/telangana/ed-raids-hyderabad-hospitals-medical-colleges-money-laundering-bmc-scam-178831"
    },
    {
        "title": "Signature Bank was probed by feds for money laundering before collapse ...",
        "snippet": "Signature Bank of New York's collapse is the third-largest bank failure in US history. AFP via Getty Images. As of the start of the year, Signature had $110.36 billion in assets under management ...",
        "sentiment": "1 (Negative)",
        "link": "https://nypost.com/2023/03/15/signature-bank-was-probed-by-feds-for-money-laundering-before-collapse-report/"
    },
    {
        "title": "Signature Bank in money laundering probe, auction buyer must ditch ...",
        "snippet": "UPDATE: The FDIC has denied that it will require any Signature buyer to give up the bank's crypto operations as a condition of sale. Signature Bank was under federal investigation for suspected money laundering by its crypto clients before the New York financial institution was taken over by state and federal regulators.. On Tuesday, Bloomberg quoted sources saying U.S. Department of Justice ...",
        "sentiment": "1 (Negative)",
        "link": "https://coingeek.com/signature-bank-in-money-laundering-probe-auction-buyer-must-ditch-crypto-ops/"
    },
    {
        "title": "James Whitner of The Whitaker Group Named In Multi-Million Dollar ...",
        "snippet": "James Whitner has long been a revered name in the sneaker industry. Whitner is the visionary behind and owner of The Whitaker Group, an umbrella company that owns lauded stores like A Ma Maniere, Social Status, APB, and Prosper.Among the sneaker community, Whitner has been known as more than just a business owner; he's been a trendsetter, storyteller, and champion of the consumer.",
        "sentiment": "4 (Positive)",
        "link": "https://www.soleretriever.com/news/articles/james-whitner-the-whitaker-group-allegedly-tied-to-multi-million-money-laundering-scheme"
    },
    {
        "title": "Healthcare Anti-Money Laundering AML Risks & Regulations | TTI",
        "snippet": "Reputation: Healthcare organizations are seen as being charitable and performing an essential human service.Therefore, the bar of suspicion is lower in this industry. Donations: Hospitals regularly receive large donations from outside sources, so this is seen as normal. Large Amounts of Money: In addition to large donations, it is also not unusual for healthcare companies to move large amounts ...",
        "sentiment": "4 (Positive)",
        "link": "https://truthtechnologies.com/healthcare/"
    },
    {
        "title": "Hanover Park man admits to money laundering, gets 6 years - Daily Herald",
        "snippet": "A Hanover Park man who pleaded guilty to money laundering has been sentenced to six years in prison, officials announced Friday. Michael A. Venegas, 24, was first investigated in April 2021 after ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.dailyherald.com/20240607/news/hanover-park-man-admits-to-money-laundering-gets-6-years/"
    },
    {
        "title": "Park Signature Group",
        "snippet": "Buckhead's first luxury condo developer, Park Signature Properties, developed over 550 luxury condos in three buildings in the Buckhead area and has resold 100's over the years. No one has our level of expertise and experience. We know the Buckhead Atlanta condo market better than anyone.",
        "sentiment": "5 (Positive)",
        "link": "http://parksignatureproperties.com/agent/park-signature-group/"
    },
    {
        "title": "Park Group of Hospitals - LinkedIn",
        "snippet": "Signature Hospital Hospitals and Health Care Fortis Healthcare Hospitals and Health Care ... Park Group of Hospitals | 10,033 followers on LinkedIn. Advanced Super Speciality Hospital.",
        "sentiment": "5 (Positive)",
        "link": "https://www.linkedin.com/company/park-hospital"
    },
    {
        "title": "Policy on anti-money laundering and countering the financing of terrorism",
        "snippet": "National Anti-Money Laundering Strategy. Singapore's National Anti-Money Laundering (AML) Strategy sets out the strategic approach to address money laundering (ML) risks and will guide our risk-targeted actions to combat ML amidst rapidly changing risks, trends and criminal typologies. National Anti-Money Laundering Strategy (PDF, 745KB)",
        "sentiment": "5 (Positive)",
        "link": "https://www.mha.gov.sg/what-we-do/managing-security-threats/countering-the-financing-of-terrorism/policy-on-anti-money-laundering-and-countering-the-financing-of-terrorism"
    },
    {
        "title": "Singapore's AML Regime",
        "snippet": "enforcing against money laundering and terrorism financing, with Government and private sector entities each playing their roles. We have whole-of-Government structures to ensure close policy and operational coordination and cooperation among agencies. 2. Singapore has a longstanding inter-agency Anti Money Laundering/Countering",
        "sentiment": "1 (Negative)",
        "link": "https://sprs.parl.gov.sg/search/search/download?value=20231003/annex-Annex+1.pdf"
    }
]