[
    {
        "title": "PDF",
        "snippet": "patients and their families (subject to conditions and availability). Call 800-227-2345 . Nick's House: Boston - No Fee. 508-306-1409 . HEADstrong Foundation . 275 Summit Ave, Brookline, MA 02135 . 4.5 miles from Mass General . For . cancer. patients undergoing cancer treatment .",
        "sentiment": "1 (Negative)",
        "link": "https://www.massgeneral.org/assets/mgh/pdf/social-service/accommodations-list.pdf"
    },
    {
        "title": "PDF",
        "snippet": "%PDF-1.5 %âãÏÓ 10 0 obj > endobj 33 0 obj >/Filter/FlateDecode/ID[8178BED8B9C47C96405E8F535EA39972>1FDE21440C5D5D4E887FD7C932593A5E>]/Index[10 39]/Info 9 0 R ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.massgeneralbrigham.org/content/dam/mgb-global/en/patient-care/patient-and-visitor-information/patient-gateway/documents/patient-family-relations.pdf"
    },
    {
        "title": "Family Accommodations - University of Rochester Medical Center",
        "snippet": "Cancer Patients and Their Families. The B. Thomas Golisano Hope Lodge Hospitality House provides free accommodations for cancer patients and their caregiver who come from outside Monroe County and need medical care but do not need to be admitted to the hospital. For information and eligibility requirements call (585) 224-4935 or 1-800-227-2345 ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.urmc.rochester.edu/strong-memorial/patients-families/hospital-stay/family-accommodations"
    },
    {
        "title": "Housing & Transportation - Massachusetts General Hospital",
        "snippet": "Patient must be receiving treatment at least 2-3 times per week; Family must complete a Request to Stay form; Christopher's Haven. One Emerson Place, Suite 2N Boston, MA 02114 (Adjacent to Mass General) Phone Number: 857-233-4178. Contact: Please contact Catie Botting, Family Services Manager, at catiebotting@christophershaven.org or by calling ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.massgeneral.org/children/proton-therapy/housing-and-transportation"
    },
    {
        "title": "Introduction - Strategies for Patient, Family, and Caregiver Engagement ...",
        "snippet": "Patient and family engagement refers to patients, families, and health care providers working in active partnership across various levels to help improve healthcare outcomes.1 While a patient may engage with their healthcare provider devising strategies to manage their own health, they may also engage at a system level with other healthcare providers and leaders in efforts to improve the care ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.ncbi.nlm.nih.gov/books/NBK561674/"
    },
    {
        "title": "Welcome from Our President & CEO | Signature Healthcare",
        "snippet": "As an organization, we strive to safeguard human dignity and compassion for our patients, their families, and each other. We believe positive relationships are at the core of a great healthcare organization. We are a multi-specialty, not-for-profit integrated healthcare delivery network comprised of Brockton Hospital, Brockton Hospital School ...",
        "sentiment": "5 (Positive)",
        "link": "https://signature-healthcare.org/?/about/welcome-from-our-president-ceo/"
    },
    {
        "title": "Where to Stay - Patients and Visitors - UF Health",
        "snippet": "These locations offer all-inclusive apartments at low cost to families who need to stay in the area. There is a limited amount of financial assistance available for this service. Call patient and family resources at (352) 265-0224 for more information, or ask your nurse to connect you with a social worker. Ronald McDonald House",
        "sentiment": "3 (Neutral)",
        "link": "https://ufhealth.org/patients-and-visitors/coming-to-uf-health/where-to-stay"
    },
    {
        "title": "Login - Patient Portal",
        "snippet": "With Patient Portal, you can connect with your doctor through a convenient, safe and secure environment.",
        "sentiment": "5 (Positive)",
        "link": "https://www.nextmd.com/ud2/Login/Login.aspx"
    },
    {
        "title": "Interventions to increase patient and family involvement in ... - PubMed",
        "snippet": "Background: There is now a rising commitment to acknowledge the role patients and families play in contributing to their safety. This review focuses on one type of involvement in safety - patient and family involvement in escalation of care for serious life-threatening conditions i.e. helping secure a step-up to urgent or emergency care - which has been receiving increasing policy and practice ...",
        "sentiment": "4 (Positive)",
        "link": "https://pubmed.ncbi.nlm.nih.gov/33285618/"
    },
    {
        "title": "Signature Care - Parkview Health",
        "snippet": "Signature Care offers the best discounts on services provided at Parkview hospitals and by Parkview physicians, which provides significant cost savings to both the employee and business. The network allows employees and their families convenient access to hospitals, physicians and other healthcare providers throughout Indiana and northwest Ohio.",
        "sentiment": "4 (Positive)",
        "link": "https://www.parkview.com/employer-solutions/signature-care/signature-care"
    },
    {
        "title": "The Signature Hospital, Multi Speciality Hospital in Gurgaon - Practo",
        "snippet": "Signature Hospital, with over 40 years of expertise, is a state-of-the-art healthcare provider committed to delivering premium and holistic patient care. Located in Gurgaon sector 37C, the hospital sets a benchmark in medical excellence by combining cutting-edge technology and exceptional healthcare services.",
        "sentiment": "5 (Positive)",
        "link": "https://www.practo.com/gurgaon/hospital/signature-hospital-gurgaon-sector-37"
    },
    {
        "title": "Lake Health Physician Group Mentor Family Practice",
        "snippet": "We are dedicated to educating and advancing the health and well-being of our patients and their families. Make an Appointment. Call to schedule an appointment, 440-255-7938. Fax: 440-255-9196. Schedule Now. 1-866-UH4-CARE. Can't find what you're looking for? Search now: Search Close the search box. Quick Links;",
        "sentiment": "5 (Positive)",
        "link": "https://www.uhhospitals.org/locations/primary-care/LHPG-mentor-family-practice"
    },
    {
        "title": "Park Group of Hospitals | LinkedIn",
        "snippet": "Park Group of Hospitals | 3,033 followers on LinkedIn. Park Group of Hospital is the fastest growing chain of hospitals in Delhi NCR, which presently has over 1500 beds, and has attained supremacy in the field of healthcare with its crème-de-la-crème tertiary medical care. Started by Dr Ajit Gupta in 1982, with Park Sunil Hospital in Malviya Nagar as the first one, and now it has 8 hospitals ...",
        "sentiment": "5 (Positive)",
        "link": "https://in.linkedin.com/company/parkgroupofhospitals"
    },
    {
        "title": "Brockton - 110 Liberty St. - Signature Healthcare",
        "snippet": "Brockton Hospital School of Nursing 53 Adams Street Brockton, MA 02302 508-941-7040 ABOUT BHSON",
        "sentiment": "1 (Negative)",
        "link": "https://signature-healthcare.org/?/locations/brockton-110-liberty-st/"
    },
    {
        "title": "Park Signature Group - Park Place Highrise",
        "snippet": "Buckhead's first luxury condo developer, Park Signature Properties, developed over 550 luxury condos in three buildings in the Buckhead area and has resold 100's over the years.",
        "sentiment": "5 (Positive)",
        "link": "http://parkplacehighrise.com/agent/park-signature-group/"
    },
    {
        "title": "Concierge Medicine & Healthcare - Signature Healthcare - Charlotte NC",
        "snippet": "Urgent medical care and coordination with specialists further enhance the personalized care our patients receive. The concierge medicine model allows our doctors to see fewer than 10% of the volume of patients seen in a traditional practice. ... The doctors have cared for my family members with the utmost compassion, expertise and kindness ...",
        "sentiment": "5 (Positive)",
        "link": "https://signaturehealthcare.org/"
    },
    {
        "title": "About Our Behavioral Healthcare Services and Treatment Facilities",
        "snippet": "Providing trauma-informed, evidence-based behavioral healthcare to the patients, families and communities we serve. Connect with Us Call Us: 877-663-7976",
        "sentiment": "1 (Negative)",
        "link": "https://www.desertparkway.com/about/about-signature"
    },
    {
        "title": "Signature Healthcare Brockton Hospital",
        "snippet": "57 reviews and 2 photos of SIGNATURE HEALTHCARE BROCKTON HOSPITAL \"my husband and i went into the hospital he got hurt we had to wate almost 9hrs just see a doctor when my husband ask how long it gona be one of the nurses got rude with him the nurse at the frount desk the nurse in the ER was nice and so was the doctors every time i go 2 the ER u have 2 wait a long time why do we have insurance ...",
        "sentiment": "2 (Negative)",
        "link": "https://www.yelp.com/biz/signature-healthcare-brockton-hospital-brockton"
    },
    {
        "title": "Signature Healthcare Doctors - #1 Quality Healthcare - Charlotte, NC",
        "snippet": "The model gives Signature Healthcare's primary care physicians time to build relationships with patients to learn about their unique lifestyles. Our doctors see fewer than 10% of the patients in a traditional practice. This allows them to devote more time to each patient in order to support their health and overall wellness.",
        "sentiment": "5 (Positive)",
        "link": "https://signaturehealthcare.org/our-doctors/"
    },
    {
        "title": "Signature Care Members - Parkview Health",
        "snippet": "Tips to keep healthcare affordable for you and your family members: Familiarize yourself with the benefit plan offered by your company. Use only Signature Care participating (in-network) providers. Locate participating providers using our online provider directory. Confirm whether your procedure requires a precertification.",
        "sentiment": "4 (Positive)",
        "link": "https://www.parkview.com/employer-solutions/signature-care/for-members/members"
    },
    {
        "title": "Patient Portal - Signature Medical Group",
        "snippet": "Please select your practice below to view your patient information. Select Your Practice select from All Kansas City Area practices select from All St. Louis Area practices. The portal should not be used for urgent or emergency situations. In case of an emergency, call 911 or go to the nearest emergency room. ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.signaturemedicalgroup.com/patient-resources/patient-portal/"
    },
    {
        "title": "Find a Doctor - Signature Medical Group",
        "snippet": "Find a Doctor. Finding the right doctor, with the right expertise and at a convenient location, should be an easy task. Our Find a Doctor filter allows you to enter as much or as little information to find a provider who meets your unique needs.",
        "sentiment": "4 (Positive)",
        "link": "https://www.signaturemedicalgroup.com/doctors/"
    },
    {
        "title": "Doctors say HCA hospitals push patients into hospice care to improve ...",
        "snippet": "Patient families and doctors say HCA hospitals push patients into hospice care. Deaths in hospice care aren't counted in hospital mortality stats.",
        "sentiment": "4 (Positive)",
        "link": "https://www.nbcnews.com/health/health-care/doctors-say-hca-hospitals-push-patients-hospice-care-rcna81599"
    },
    {
        "title": "Managing threatening and violent patient behaviour - CPSA",
        "snippet": "The letter urges Albertans to be respectful to healthcare providers and support staff, and advises that abusive, threatening or harassing behaviour is unacceptable—advising a physician's right to formally discharge a patient from their care if that patient or their family is making a healthcare professional, or any staff member, feel unsafe.",
        "sentiment": "2 (Negative)",
        "link": "https://cpsa.ca/news/managing-threatening-and-violent-patient-behaviour/"
    },
    {
        "title": "Membership - #1 Executive Medical Care Membership - Signature Healthcare",
        "snippet": "Patients at Signature Healthcare are diverse in every way—they are business executives and professionals, sports enthusiasts, educators, homemakers, and seniors—but they share a common desire for a better choice in healthcare. Our patients want doctors who see them as equals, respecting their time and treating them like family.",
        "sentiment": "5 (Positive)",
        "link": "https://signaturehealthcare.org/membership/"
    },
    {
        "title": "Extending Care - Park Hospital",
        "snippet": "Park hospital is the fastest growing chain of advanced super speciality hospitals, Provides patients with best & affordable healthcare treatment. Signature Hospital Quick Appointment Appointment. Contact Us Ambulance/Emergency. Park Emergency +91-9916699166. Delhi +91-7533033025 ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/our-hospital"
    },
    {
        "title": "Welcome New Patients - Signature Healthcare",
        "snippet": "New patients can find essential information about our services, how to schedule appointments, and what to expect during your visit. Signature Healthcare. ... We are excited you are part of the Signature family and look forward to seeing you soon. Signature Healthcare. Brockton Hospital 680 Centre Street Brockton, MA 02302 508-941-7000 ABOUT BH.",
        "sentiment": "5 (Positive)",
        "link": "https://signature-healthcare.org/?/about/signature-medical-group/welcome-new-patients/"
    },
    {
        "title": "Signature Orthopedics St. Louis - Signature Medical Group",
        "snippet": "Signature Orthopedics is one of the largest orthopedic practices in the St. Louis area. Our orthopedic associates are experts in bone and joint pain and injury, foot and ankle, hand, hip and knee, shoulder and elbow, spine, sports medicine and overuse injuries, interventional pain management, physical medicine and rehabilitation, joint replacement, and pediatric and adolescent orthopedics.",
        "sentiment": "5 (Positive)",
        "link": "https://www.signaturemedicalgroup.com/st-louis-orthopedics/"
    },
    {
        "title": "How effective are strategies to help patients and their families secure ...",
        "snippet": "There is now a rising commitment to acknowledge the role patients and families play in contributing to their safety. This review focuses on one type of involvement in safety - patient and family involvement in escalation of care for serious life-threatening conditions i.e. helping secure a step-up to urgent or emergency care - which has been receiving increasing policy and practice attention.",
        "sentiment": "4 (Positive)",
        "link": "https://www.cochrane.org/CD012829/COMMUN_how-effective-are-strategies-help-patients-and-their-families-secure-emergency-medical-care-when"
    },
    {
        "title": "Signature Care Network Provider Directory - Parkview Health",
        "snippet": "Signature Care Network Provider Directory. With Signature Care, you have access to over 21,000 physicians, specialists and advanced practice providers (Nurse Practitioners and Physician Assistants).",
        "sentiment": "4 (Positive)",
        "link": "https://www.parkview.com/employer-solutions/signature-care/for-members/provider-directory"
    },
    {
        "title": "Pay My Bill - Signature Medical Group",
        "snippet": "Patient Resources. Request Appointment; Patient Portal; COVID-19 (Coronavirus) Informational Resources; Additional Symptoms, Prevention and Treatment; Telehealth Appointments; Pay My Bill. Financing Options; Imaging Self-Pay; Insurance; Patient Forms; Events; News; Total Joint Replacement Exercises",
        "sentiment": "5 (Positive)",
        "link": "https://www.signaturemedicalgroup.com/patient-resources/pay-my-bill/"
    },
    {
        "title": "For Patients & Families - Hospice Foundation of America",
        "snippet": "Hospices consistently hear that patients/families wish they had received hospice care sooner, so it is a good idea to let the physician know that you are open to discussing this option at the appropriate time. If you prefer, contact a local hospice directly to learn more about their services. Patients and families may reach out directly; a ...",
        "sentiment": "2 (Negative)",
        "link": "https://hospicefoundation.org/for-patients-families/"
    },
    {
        "title": "Signature Medical Group Primary Care - Signature Medical Group",
        "snippet": "Signature Medical Group was established in 2010 to provide personalized family medicine to patients of all ages. We deliver care and treatment to a range of acute & chronic conditions, as well as preventive medical care, while providing patients with a patient-centered medical home. Our team is committed to your well-being and satisfaction.",
        "sentiment": "5 (Positive)",
        "link": "https://www.signaturemedicalgrp.com/"
    },
    {
        "title": "Patient families - Children's Health",
        "snippet": "Patient and family resources. When you are a guest at Children's Health℠, we want to provide you with all the information and assistance you need to feel empowered and supported during your entire stay. Children's Health wants our patients and their families to experience a level of comfort and service that is seamless, consistent and ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.childrens.com/patient-families"
    },
    {
        "title": "Communication with families facing life-threatening illness: a research ...",
        "snippet": "Family conferences offer patient-focused, family-oriented care that brings together patients, family members, and health care providers. Objective: The aim of this study was to develop a research-based model for family conferences to help physicians and other health care providers conduct such conferences effectively and improve communication ...",
        "sentiment": "3 (Neutral)",
        "link": "https://pubmed.ncbi.nlm.nih.gov/21385083/"
    },
    {
        "title": "Signature Health Inc in Cleveland, OH - WebMD",
        "snippet": "Signature Health Inc is a Group Practice with 2 Locations. Currently Signature Health Inc's 10 physicians cover 9 specialty areas of medicine.",
        "sentiment": "1 (Negative)",
        "link": "https://doctor.webmd.com/practice/signature-health-inc-D8EAD687-7CEF-E411-A697-001F29E3BB64"
    },
    {
        "title": "Hospital suites across the Texas Medical Center offer patients a hotel ...",
        "snippet": "Benefits include a one-nurse-to-three-patient ratio, a tea station that serves continental breakfast, and afternoon hors d'oeuvres. One of the suites features a larger bed for athletes. Many of the hospitals treat high-profile patients—celebrities, politicians and athletes—as well as patients from countries with strained governments.",
        "sentiment": "4 (Positive)",
        "link": "https://www.tmc.edu/news/2016/09/hospital-suites-across-texas-medical-center-offer-patients-hotel-like-experience/"
    },
    {
        "title": "Patient and Family Relations - Brigham and Women's Hospital",
        "snippet": "The Patient Family Relations team is here to advocate for the best possible outcome through collaboration with our patients and staff. We do this by; leading with curiosity and not judgement, listening with compassion and creating a safe space for patients and families to share their experiences.",
        "sentiment": "5 (Positive)",
        "link": "https://www.brighamandwomens.org/patients-and-families/patient-resources/patient-and-family-relations"
    },
    {
        "title": "Raynham - 1215 Broadway - Signature Healthcare",
        "snippet": "Brockton Hospital School of Nursing 53 Adams Street Brockton, MA 02302 508-941-7040 ABOUT BHSON",
        "sentiment": "1 (Negative)",
        "link": "https://signature-healthcare.org/?/locations/raynham-1215-broadway/"
    },
    {
        "title": "Patients & Families | Corewell Health - Beaumont Health",
        "snippet": "Patient Legal Support provides free legal assistance to help address the underlying cause of poor health among patients and families. Learn more. BEREAVEMENT. The death of a family member or close friend is an emotionally trying time. We have put together some information for next steps that you may find useful to guide you through the time ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.beaumont.org/patients-families"
    },
    {
        "title": "Find A Provider - Parkview Health",
        "snippet": "Parkview Physicians Group - Family Medicine is dedicated to providing comprehensive, quality care for your entire family, from infants to grandparents, or care to a single person throughout their lifetime. ... Specifically designed for patients over the age of 18, Parkview Physicians Group - Internal Medicine is ideal when dealing with ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkview.com/find-a-provider"
    },
    {
        "title": "Chargemaster - Signature Healthcare",
        "snippet": "Brockton Hospital School of Nursing 53 Adams Street Brockton, MA 02302 508-941-7040 ABOUT BHSON",
        "sentiment": "4 (Positive)",
        "link": "https://signature-healthcare.org/?/patients-visitors/pay-a-bill/chargemaster/"
    },
    {
        "title": "Signature Healthcare Corporation in partnership with Boston Medical ...",
        "snippet": "Furthermore, this same ER team will connect the patient in front of them to the patient's PCP. For many of these patients, they may have never seen their PCP. This opportunity will be used by our team to educate patients on navigating the healthcare system, in particular the key role that connecting with the PCP plays.",
        "sentiment": "5 (Positive)",
        "link": "https://www.mass.gov/info-details/signature-healthcare-corporation-in-partnership-with-boston-medical-center-healthnet-plan"
    },
    {
        "title": "Patient and Family Roles in Safety - PSNet",
        "snippet": "Moving From Engagement to Partnership. Involving patients and families in healthcare decisions about patient care and in hospital and health system policy and programs results in better health outcomes, higher quality of care, lower health system costs, and improved patient safety. 1 This partnering of patients and families with healthcare professionals is often called \"patient and family ...",
        "sentiment": "4 (Positive)",
        "link": "https://psnet.ahrq.gov/perspective/patient-and-family-roles-safety"
    },
    {
        "title": "Signature Medical Group - Signature Healthcare",
        "snippet": "Signature Medical Group (SMG) provides comprehensive healthcare services to patients of all ages, including primary care, more than 17 specialties, women's health, urgent care, and diagnostic care.SMG offers patients full-scale lab and radiology services, including CAT Scan, Bone Density, and Mammography.For over forty years, Signature Medical Group has been committed to providing quality ...",
        "sentiment": "5 (Positive)",
        "link": "https://signature-healthcare.org/?/about/signature-medical-group"
    },
    {
        "title": "East Bridgewater Medical Building | Signature Healthcare",
        "snippet": "We welcome back former Compass patients and all other community members. Signature Healthcare physicians and staff have been here for the past 125 years, and we will be here for another 125 years, supporting you & your family's health and well-being. ... supporting you & your family's health and well-being. Request a Primary Care Appointment ...",
        "sentiment": "5 (Positive)",
        "link": "https://signature-healthcare.org/?/east-bridgewater-medical-building/"
    },
    {
        "title": "The Park & Signature Group announces expansion plans - Express Healthcare",
        "snippet": "The group plans to add at least five new hospitals this year",
        "sentiment": "4 (Positive)",
        "link": "https://www.expresshealthcare.in/news/the-park-signature-group-announces-expansion-plans/433731/"
    },
    {
        "title": "Housing for Patients & Families | University of Utah Health",
        "snippet": "Housing for Patients & Families 500 South Main Street Salt Lake City, UT 84101. PHONE: 801-646-4271. Get Directions",
        "sentiment": "5 (Positive)",
        "link": "https://healthcare.utah.edu/locations/patient-family-housing"
    }
]