[
    {
        "title": " Medical Staff Code of Conduct - Emory Healthcare",
        "snippet": "1. Issues of employee conduct will be dealt with in accordance with the Hospital's Human Resources Policies. Issues of conduct by Practitioner will be addressed in accordance with this Policy. If the matter involves an employed Practitioner, hospital management, in consultation with appropriate medical staff leaders and",
        "sentiment": "1 (Negative)",
        "link": "https://www.emoryhealthcare.org/-/media/Project/EH/Emory/ui/pdfs/esjh-npo-documents/code-of-conduct.pdf"
    },
    {
        "title": "Signature Care Network Provider Directory - Parkview Health",
        "snippet": "Signature Care Network Provider Directory. With Signature Care, you have access to over 21,000 physicians, specialists and advanced practice providers (Nurse Practitioners and Physician Assistants). ... Facilities include hospitals such as general, acute care, urgent care facilities, laboratories, hospice, home infusion, home health agencies ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.parkview.com/employer-solutions/signature-care/for-members/provider-directory"
    },
    {
        "title": "Welcome Trusted Providers - Parkview Health",
        "snippet": "Signature Care partners with more than 21,000 providers in Indiana and northwest Ohio. We are a stronger network because of the knowledge, customer focus and advanced technology we can provide our members. If you are interested in becoming a Signature Care provider, please complete our provider nomination form. Partner with Signature Care - a ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkview.com/employer-solutions/signature-care/for-providers/providers"
    },
    {
        "title": "Primary Source Verification and Staff Signatures for Verification",
        "snippet": "History of professional liability claims; Sanctions, restrictions, or limitations; ... Complete a checklist including the source used, the date of verification, the signature of the verifier, and the report date. Verification dates are also documented in your credentialing database. ... Conduct, as a best practice, ongoing internal audits to ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.managedhealthcareresources.com/blog/verification"
    },
    {
        "title": " Code of Behaviour - NHS Professionals",
        "snippet": "the minimum standards of conduct and behaviour that are appropriate. Any breaches of this Code, or other instances where a Bank Member conducts themselves in a way which is regarded as inappropriate, may be treated as gross misconduct under NHS Professionals Disciplinary Guidelines and Procedure.",
        "sentiment": "1 (Negative)",
        "link": "https://www.nhsprofessionals.nhs.uk/-/media/corporate/help-and-advice/help-guides-and-useful-forms/nhsp-code-of-behaviour.pdf"
    },
    {
        "title": "Hospital owner testifies in trial over ex-worker's sexual misconduct",
        "snippet": "Kim, 77, is owner and founder of Signature Healthcare Services, the corporation that owns and manages for-profit Vista del Mar in Ventura and 15 other hospitals in six states.",
        "sentiment": "1 (Negative)",
        "link": "https://www.vcstar.com/story/news/local/2019/07/16/aurora-vista-del-mar-trial/1720652001/"
    },
    {
        "title": "The Park & Signature Group announces expansion plans",
        "snippet": "The group plans to add at least five new hospitals this year. The Park & Signature Group of Hospitals has plans to add five new hospitals by the end of this year to take its hospital count to 19 across the country. It recently added Amar Medical & Research Centre (AMRC), Jaipur, Rajasthan, to its portfolio.",
        "sentiment": "4 (Positive)",
        "link": "https://www.expresshealthcare.in/amp/news/the-park-signature-group-announces-expansion-plans/433731/"
    },
    {
        "title": "North India's Fastest-growing Chain Of Super-specialty Hospitals Plans ...",
        "snippet": "Park Group of Hospitals added 5 new hospitals to its chain of hospitals from FY 2019 to FY 2021 alone, which is truly unheard of in the business of individually owned hospitals. Park Group of ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.prnewswire.com/in/news-releases/north-india-s-fastest-growing-chain-of-super-specialty-hospitals-plans-further-expansion-842280996.html"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Signature Hospital Quick Appointment Appointment. Contact Us Ambulance/Emergency. Park Emergency +91-9916699166. Delhi +91-7533033025. Gurugram +91-7503141435. Palam Vihar +91-9891424242. The Signature, Gurugram +91-6262828213 ... Dr. Ajit Gupta is the Founder of the Park Group of Hospitals. His avid passion for subject of healthcare in respect ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/visionaries"
    },
    {
        "title": "New York Reporting Statute - Horty Springer",
        "snippet": "(ii) [Expires July 1, 2023, pursuant to L.1983, c. 426, § 5.] Participation and membership during a three year demonstration period in a physician committee of the Medical Society of the State of New York or the New York State Osteopathic Society whose purpose is to confront and refer to treatment physicians who are thought to be suffering from alcoholism, drug abuse, or mental illness.",
        "sentiment": "1 (Negative)",
        "link": "https://www.hortyspringer.com/reporting-statutes-by-state/new-york-reporting-statute/"
    },
    {
        "title": "Park Group of Hospitals | LinkedIn",
        "snippet": "Healthcare merger & acquisition professional Dr Banuprakash Jayaram Healthcare specialist ... Panipat Consult Now: 7027 8989 89, 99166 99166 Park Group of Hospitals: NABL & NABH Accredited 30+ Specialties 10 Lakhs+ Patients Treated 1.5 Lakhs+ International Patients Treated 1 Lakh+ Surgeries Completed . . . ... Signature Hospital Hospitals and ...",
        "sentiment": "5 (Positive)",
        "link": "https://in.linkedin.com/company/park-hospital"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Park hospital is the fastest growing chain of advanced super speciality hospitals, Provides patients with best & affordable healthcare treatment. ... At Park Group of Hospitals, we foster a healthy, safe, and productive work environment with a well-defined positive culture for our employees, while promoting a rewarding work & learning ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/career"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Address. Meera Enclave(Chowkhandi), Outer Ring Road, New Delhi. Email info@parkhospital.in; Telephones 1800-102-6767; Working Hours. 24/7 (Emergency Department)",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/contact-us"
    },
    {
        "title": "Advance Super Multi Speciality Hospital in Gurugram Sector 37D",
        "snippet": "Signature Hospital, part of Park Hospital is a fully-equipped private hospital with state-of-the-art medical facilities, 300 plus beds multispecialty hospital in Gurugram",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/hospital/super-multispeciality-hospital-in-gurgaon-37D"
    },
    {
        "title": "Ethics | AHIMA",
        "snippet": "Establishes a framework for professional behavior and responsibilities when professional obligations conflict or ethical uncertainties arise. Provides ethical principles by which the general public can hold the HIM professional accountable. Mentors practitioners new to the field to HIM's mission, values, and ethical principles.",
        "sentiment": "4 (Positive)",
        "link": "https://www.ahima.org/who-we-are/governance/ethics/"
    },
    {
        "title": "Know more about Park Hospital, who we are and our people",
        "snippet": "Park Group of Hospitals, equipped with world class facilities is one of the most advanced and comprehensive healthcare institutions. ... Signature Hospital Quick Appointment Appointment. Contact Us Ambulance/Emergency. Park Emergency +91-9916699166. Delhi +91-7533033025. Gurugram +91-7503141435. Palam Vihar +91-9891424242. The Signature ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.parkhospital.in/about-us"
    },
    {
        "title": "Extending Care - Park Hospital",
        "snippet": "Signature Hospital Quick Appointment Appointment. Contact Us Ambulance/Emergency. Park Emergency +91-9916699166. Delhi +91-7533033025 ... Nidaan Hospital (a Unit of Park Group of Hospitals), Sonipat. Murthal Road, Sonipat-131001, Haryana. 200+ Beds | 60+ Expert Doctors. Get Directions | Read More.",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/our-hospital"
    },
    {
        "title": "Advance Super Multi Speciality Hospital in New Delhi | Park Hospital",
        "snippet": "Park Hospital is a fully-equipped private hospital with state-of-the-art medical facilities, 250 plus beds multispecialty hospital in Delhi ... Signature Hospital Quick Appointment Appointment. Contact Us Ambulance/Emergency. Park Emergency +91-9916699166. Delhi +91-7533033025 ... Delhi is an ambitious initiative from Park Group. This is a ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/hospital/super-multispeciality-hospital-in-Delhi"
    },
    {
        "title": "The Signature Hospital | LinkedIn",
        "snippet": "The Signature Hospital | 1,129 followers on LinkedIn. A 300 bedded advanced super speciality hospital | As a 300-bedded premium hospital, we offer the best in class services and personalized medical care, all dedicated to adding value to your life and health. Our inherent focus is on serving our community, by setting a standard of excellence in providing comprehensive facilities, luxury ...",
        "sentiment": "5 (Positive)",
        "link": "https://in.linkedin.com/company/signaturehospital"
    },
    {
        "title": "The Signature Hospital - LinkedIn",
        "snippet": "Park Group of Hospitals Hospitals and Health Care Gurgaon, Haryana CK Birla Hospital Hospitals and Health Care ... The Signature Hospital | 1,113 followers on LinkedIn. A 300 bedded advanced super ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.linkedin.com/company/signaturehospital/"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Park hospital is the fastest growing chain of advanced super speciality hospitals, Provides patients with best & affordable healthcare treatment. ... Group Director - Legal. Rakesh Bhardwaj. Vice President - Legal. Atin Mehta. Senior Law Officer. ... The Signature Hospital. Dr. Pardeep Singh. Deputy Medical Superintendent. Panipat. Brig. Yesh ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.parkhospital.in/meet-our-management"
    },
    {
        "title": "Park Group of Hospitals | LinkedIn",
        "snippet": "Park Group of Hospitals | 3,033 followers on LinkedIn. Park Group of Hospital is the fastest growing chain of hospitals in Delhi NCR, which presently has over 1500 beds, and has attained supremacy in the field of healthcare with its crème-de-la-crème tertiary medical care. Started by Dr Ajit Gupta in 1982, with Park Sunil Hospital in Malviya Nagar as the first one, and now it has 8 hospitals ...",
        "sentiment": "5 (Positive)",
        "link": "https://in.linkedin.com/company/parkgroupofhospitals"
    },
    {
        "title": "Standards of conduct, performance and ethics | The HCPC",
        "snippet": "- you have had any restriction placed on your practice, or been suspended or dismissed by an employer, because of concerns about your conduct or competence. 9.6 You must co-operate with any investigation into your conduct or competence, the conduct or competence of others, or the care, treatment or other services provided to service users.",
        "sentiment": "4 (Positive)",
        "link": "https://www.hcpc-uk.org/standards/standards-of-conduct-performance-and-ethics/"
    },
    {
        "title": "Guides: Legal Ethics & Professional Misconduct: General Information",
        "snippet": "Information about professional ethics and misconduct for attorneys and judges. The Texas State Law Library publishes legal research guides to help both self-represented litigants/pro se litigants and attorneys/legal practitioners locate the legal information they need.",
        "sentiment": "4 (Positive)",
        "link": "https://guides.sll.texas.gov/legal-ethics-and-professional-misconduct"
    },
    {
        "title": "Signature Orthopedics St. Louis - Signature Medical Group",
        "snippet": "Signature Orthopedics is one of the largest orthopedic practices in the St. Louis area. Our orthopedic associates are experts in bone and joint pain and injury, foot and ankle, hand, hip and knee, shoulder and elbow, spine, sports medicine and overuse injuries, interventional pain management, physical medicine and rehabilitation, joint replacement, and pediatric and adolescent orthopedics.",
        "sentiment": "5 (Positive)",
        "link": "https://www.signaturemedicalgroup.com/st-louis-orthopedics/"
    },
    {
        "title": "Park Group of Hospitals - LinkedIn",
        "snippet": "Park Group of Hospital is the fastest growing chain of hospitals in Delhi NCR, which presently has over 1500 beds, and has attained supremacy in the field of healthcare with its crème-de-la ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.linkedin.com/company/parkgroupofhospitals"
    },
    {
        "title": "Outcomes of professional misconduct by nurses: a qualitative study",
        "snippet": "Background Professional misconduct by nurses is a critical challenge in providing safe quality care, which can lead to devastating and extensive outcomes. Explaining the experiences of clinical nurses and nursing managers in this regard using an in-depth qualitative method can be beneficial. This study was conducted with the aim of explaining the experiences of nurses regarding the outcomes of ...",
        "sentiment": "1 (Negative)",
        "link": "https://bmcnurs.biomedcentral.com/articles/10.1186/s12912-024-01859-3"
    },
    {
        "title": "Park Group of Hospitals - LinkedIn",
        "snippet": "Book an Appointment with Dr. Barkha Pandey, HOD of Pediatrics and Neonatology at Park Hospital, Palam Vihar Consult Now: 8695 000 000 Park Group of Hospitals: NABL & NABH Accredited 30 ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.linkedin.com/company/park-hospital"
    },
    {
        "title": "O. Reg. 856/93: PROFESSIONAL MISCONDUCT\" - Ontario.ca",
        "snippet": "PROFESSIONAL MISCONDUCT. Consolidation Period: From June 4, 2024 to the e-Laws currency date. Last amendment: 222/24. Legislative History: 857/93, 115/94, 53/95, 450/10, 222/24. This Regulation is made in English only. 1. (1) The following are acts of professional misconduct for the purposes of clause 51 (1) (c) of the Health Professions ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.ontario.ca/laws/regulation/930856"
    },
    {
        "title": "Reporting Incompetent or Unethical Behaviors by Colleagues",
        "snippet": "Code of Ethics Opinions pages. The obligation to report incompetent or unethical conduct that may put patients at risk is recognized in both the ethical standards of the profession and in law, and physicians should be able to report such conduct without fear or loss of favor. Reporting a colleague who is incompetent or who engages in unethical behavior is intended not only to protect patients ...",
        "sentiment": "4 (Positive)",
        "link": "https://code-medical-ethics.ama-assn.org/ethics-opinions/reporting-incompetent-or-unethical-behaviors-colleagues"
    },
    {
        "title": "Professional Misconduct Under The Advocates Act, 1961",
        "snippet": "There are many other landmark judgments regarding the cases involving professional misconduct of the advocates. In the case of V.C. Rangadurai v.D.Gopalan, the court looked into the matter of professional misconduct in such a way that the decision was made in a humanitarian manner, considering the future of the accused in this case.The court held that \"even so justice has a correctional edge ...",
        "sentiment": "1 (Negative)",
        "link": "https://blog.ipleaders.in/professional-misconduct-advocates-act-1961/"
    },
    {
        "title": "garden of the gods park colorado - Search - Bing",
        "snippet": "Perhaps it was inevitable that this park on the western edge of Colorado Springs was named Gard Perhaps it was inevitable that this park on the western edge of Colorado Springs was named Garden of the Gods. One of the surveyors who established the city was so struck by the beauty of the rock formations here that he thought it a suitable setting for the gods to assemble, and so lent the spot ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.bing.com/spotlight?spotlightid=GardenOfGodsColorado&q=garden+of+the+gods+park+colorado"
    },
    {
        "title": "Reporting incidents of possible professional misconduct",
        "snippet": "* § 2803-e. Reporting incidents of possible professional misconduct. 1. (a) Hospitals and other facilities approved pursuant to this article shall make a report or cause a report to be made within thirty days of the occurrence of any of the following: the suspension, restriction, termination or curtailment of the training, employment, association or professional privileges or the denial of ...",
        "sentiment": "5 (Positive)",
        "link": "https://newyork.public.law/laws/n.y._public_health_law_section_2803-e*2"
    },
    {
        "title": "Code of Medical Ethics Regulations, 2002 - NMC",
        "snippet": "Any act of termination of pregnancy of normal female foetus amounting to female foeticide shall be regarded as professional misconduct on the part of the physician leading to penal erasure besides rendering him liable to criminal proceedings as per the provisions of this Act. 7.7 Signing Professional Certificates, Reports and other Documents:",
        "sentiment": "1 (Negative)",
        "link": "https://www.nmc.org.in/rules-regulations/code-of-medical-ethics-regulations-2002/"
    },
    {
        "title": " HCA Healthcare Code of Conduct",
        "snippet": "professional relationships; full, fair, accurate, timely and understandable SEC filings and submissions and other public communications by the Company; compliance with applicable governmental laws, rules and regulations; prompt internal reporting of violations of the Code;",
        "sentiment": "1 (Negative)",
        "link": "https://hcahealthcare.com/util/forms/ethics/2020-Code-of-Conduct-a.pdf"
    },
    {
        "title": "NYS Medicine:Laws, Rules & Regulations:Article 131-A - Office of the ...",
        "snippet": "The board of professional medical conduct and the department of health shall enforce, administer and interpret this article. Before issuing a declaratory ruling pursuant to section two hundred four of the state administrative procedure act with respect to this article, the department of health shall fully consult with the department of education.",
        "sentiment": "1 (Negative)",
        "link": "https://www.op.nysed.gov/professions/physicians/laws-rules-regulations/article-131a"
    },
    {
        "title": " Professional misconduct in healthcare : setting out a research agenda ...",
        "snippet": "This is a repository copy of Professional misconduct in healthcare : setting out a research agenda for work sociology. White Rose Research Online URL for this paper: ... (Kennedy, 2001); poor care for older people at Mid-Staffordshire Hospital (Francis, 2013), and inappropriate storing of children's organs at Liverpool Alder Hey Hospital ...",
        "sentiment": "1 (Negative)",
        "link": "https://eprints.whiterose.ac.uk/158600/8/Professional+Misconduct+in+Healthcare+-+Setting+Out+a+Research+Agenda+for+Work+Sociology.pdf"
    },
    {
        "title": "#patientstoo - Professional sexual misconduct by healthcare ...",
        "snippet": "Studies using non-probability samples indicate a high prevalence of professional sexual misconduct (PSM) towards patients. However, valid prevalence rates are lacking. Methods: We did a cross-sectional, observational study in Germany from February to April 2020. By different sampling steps, a probability sample of the German population above ...",
        "sentiment": "2 (Negative)",
        "link": "https://pubmed.ncbi.nlm.nih.gov/34402421/"
    }
]