[
    {
        "title": "Signature HealthCare to Pay $30 Million For Allegations of Defrauding ...",
        "snippet": "The U.S. government became involved and also accused Signature HealthCare of engaging in multiple fraudulent practices that were lead to false claims for \"unreasonable, unnecessary, and unskilled services to Medicare patients.\" ... earning him a spot on the Super Lawyers list from 2021 to 2024, a distinction awarded to only a select group ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.thehigginsfirm.com/signature-healthcare-to-pay-30-million-for-allegations-of-defrauding-nursing-home-residents/"
    },
    {
        "title": "Signature HealthCARE to Pay More Than $30 Million to Resolve False ...",
        "snippet": "Signature HealthCARE, LLC (Signature), a Louisville, Kentucky based company that owns and operates approximately 115 skilled nursing facilities, including 7 in middle Tennessee, has agreed to resolve allegations that it violated the False Claims Act by knowingly submitting false claims to Medicare for rehabilitation therapy services that were not reasonable, necessary and skilled, the ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.justice.gov/opa/pr/signature-healthcare-pay-more-30-million-resolve-false-claims-act-allegations-related"
    },
    {
        "title": "Signature Healthcare to pay more than $30 million to resolve False ...",
        "snippet": "The case is captioned United States ex rel. Emerson and Tuesca v. Signature HealthCARE, LLC, et al., Case No. 1:15-cv-00027 (M.D. Tenn.). The lawsuit was filed under the qui tam, or whistleblower, provisions of the False Claims Act, which permit private individuals to sue on behalf of the government for false claims and to share in any recovery.",
        "sentiment": "1 (Negative)",
        "link": "https://www.justice.gov/usao-ndga/pr/signature-healthcare-pay-more-30-million-resolve-false-claims-act-allegations-related"
    },
    {
        "title": "UK fraud agency opens investigation into alleged £140mn property scam",
        "snippet": "The UK Serious Fraud Office has opened an investigation into an alleged £140mn property fraud and arrested four people in a series of raids. The prosecutor is probing Liverpool-based Signature ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.ft.com/content/8aa0979e-097f-4263-b4f6-83b1c85b83ff"
    },
    {
        "title": "Madhya Pradesh: 7 more hospitals lose licence for Ayushman Bharat scam",
        "snippet": "The licences of seven more private hospitals have been terminated and two hospital owners face criminal action after investigation into a multi-city scam unearthed fraudulent mediclaims under ...",
        "sentiment": "1 (Negative)",
        "link": "https://timesofindia.indiatimes.com/city/bhopal/7-more-hosps-lose-licence-for-ayushman-bharat-scam/articleshow/92864687.cms"
    },
    {
        "title": "Operator of 116 SNFs will pay $30M to settle billing fraud allegations",
        "snippet": "Louisville, Ky.-based Signature Healthcare, which operates 116 skilled nursing facilities across the nation, has agreed to pay more than $30 million to settle False Claims Act allegations ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.beckershospitalreview.com/legal-regulatory-issues/operator-of-116-snfs-to-pay-30m-to-settle-billing-fraud-allegations.html"
    },
    {
        "title": "Advance Super Multi Speciality Hospital in Gurugram Sector 37D",
        "snippet": "Signature Hospital, part of Park Hospital is a fully-equipped private hospital with state-of-the-art medical facilities, 300 plus beds multispecialty hospital in Gurugram",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/hospital/super-multispeciality-hospital-in-gurgaon-37D"
    },
    {
        "title": "Park Group of Hospitals | LinkedIn",
        "snippet": "Book an Appointment with Dr. Sachin Abrol, Consultant - Urology at Park Hospital, Panipat Consult Now: 7027 8989 89, 99166 99166 Park Group of Hospitals: NABL & NABH Accredited 30+ Specialties 10 Lakhs+ Patients Treated 1.5 Lakhs+ International Patients Treated 1 Lakh+ Surgeries Completed . . .",
        "sentiment": "5 (Positive)",
        "link": "https://in.linkedin.com/company/park-hospital"
    },
    {
        "title": "19 Hospitals Lose CGHS Empanelment Over Fraudulent Activities | Delhi ...",
        "snippet": "The Indian government has suspended the CGHS empanelment of 19 hospitals involved in fraudulent activities. This action affects hospitals primarily in Delhi and surrounding areas, ensuring ongoing ...",
        "sentiment": "1 (Negative)",
        "link": "https://timesofindia.indiatimes.com/city/delhi/19-hospitals-lose-cghs-empanelment-over-fraudulent-activities/articleshow/115309912.cms"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Park hospital is the fastest growing chain of advanced super speciality hospitals, Provides patients with best & affordable healthcare treatment. ... Group Director - Legal. Rakesh Bhardwaj. Vice President - Legal. Atin Mehta. Senior Law Officer. ... The Signature Hospital. Dr. Pardeep Singh. Deputy Medical Superintendent. Panipat. Brig. Yesh ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.parkhospital.in/meet-our-management"
    },
    {
        "title": "Know more about Park Hospital, who we are and our people",
        "snippet": "Park Group of Hospitals, equipped with world class facilities is one of the most advanced and comprehensive healthcare institutions. ... Signature Hospital Quick Appointment Appointment. Contact Us Ambulance/Emergency. Park Emergency +91-9916699166. Delhi +91-7533033025. Gurugram +91-7503141435. Palam Vihar +91-9891424242. The Signature ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.parkhospital.in/about-us"
    },
    {
        "title": "Signature Forgery: Types, Prevention, and Legal Solutions - Blueink",
        "snippet": "But there is one more important step you can take right now to protect yourself from signature fraud: choosing a reliable and highly secure e-signature platform like Blueink. Topics. ... Identity theft encompasses various fraudulent activities when someone's identity is used for many illegal activities, while signature forgery focuses on ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.blueink.com/blog/understanding-signature-forgery-types-prevention-and-legal-solutions"
    },
    {
        "title": "Park Group of Hospitals | LinkedIn",
        "snippet": "Park Group of Hospitals | 3,033 followers on LinkedIn. Park Group of Hospital is the fastest growing chain of hospitals in Delhi NCR, which presently has over 1500 beds, and has attained supremacy in the field of healthcare with its crème-de-la-crème tertiary medical care. Started by Dr Ajit Gupta in 1982, with Park Sunil Hospital in Malviya Nagar as the first one, and now it has 8 hospitals ...",
        "sentiment": "5 (Positive)",
        "link": "https://in.linkedin.com/company/parkgroupofhospitals"
    },
    {
        "title": "Statement on fraudulent fund raising activities | Tung Wah Group of ...",
        "snippet": "Statement on fraudulent fund raising activities. Tung Wah Group of Hospitals (TWGHs) wishes to alert the public that an association named itself \"Hong Kong Tung Wah Three Hospitals Employees Association\", which claims that its members are employees of TWHGs, is of no relationship to TWGHs. TWGHs would like to declare that all the operations ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.tungwah.org.hk/en/press-release/statement-on-fraudulent-fund-raising-activities/"
    },
    {
        "title": "Draft of Medical Negligence Complaint Against The Signature Hospital ...",
        "snippet": "The complaint alleges gross medical negligence by doctors at The Signature Hospital in Gurugram that led to the wrongful death of the complainant's father. Key details include: 1) The complainant's father, aged 66, was in good health prior to the surgery and only needed a minor gallbladder removal procedure. 2) The surgery was conducted in a negligent manner without proper tests, discussion of ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.scribd.com/document/711679464/Draft-of-Medical-Negligence-Complaint-Against-The-Signature-Hospital-Park-Hospital-Gurgaon"
    },
    {
        "title": "CGHS empanelment of 19 Delhi-NCR hospitals suspended ... - ET HealthWorld",
        "snippet": "New Delhi: The empanelment of 19 hospitals in Delhi-NCR under the Central Government Health Scheme (CGHS) has been suspended until further notice for indulging in fraudulent practices, according ...",
        "sentiment": "1 (Negative)",
        "link": "https://health.economictimes.indiatimes.com/news/hospitals/cghs-empanelment-of-19-delhi-ncr-hospitals-suspended-for-indulging-in-fraudulent-practices/115324304"
    },
    {
        "title": "TWGHs statement on fraudulent fund-raising activities | Tung Wah Group ...",
        "snippet": "TWGHs statement on fraudulent fund-raising activities. Tung Wah Group of Hospitals (TWGHs) notes that an association named itself \"Hong Kong Tung Wah Three Hospitals Employees Association\", which claims that its members are employees of TWHGs, is of no relationship to TWGHs. TWGHs would like to declare that all the operations or activities ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.tungwah.org.hk/en/press-release/statement-on-fraudulent-fund-raising/"
    },
    {
        "title": "TWGHs statement on fraudulent fund-raising activities | Tung Wah Group ...",
        "snippet": "TWGHs statement on fraudulent fund-raising activities. Tung Wah Group of Hospitals (TWGHs) notes that an association named itself \"Hong Kong Tung Wah Three Hospitals Employees Association\", which claims that its members are employees of TWHGs, is of no relationship to TWGHs. TWGHs would like to declare that all the operations or activities ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.tungwah.org.hk/en/press-release/employees-association-statement/"
    },
    {
        "title": "Signature Group - GOV.UK",
        "snippet": "The SFO launched an investigation into suspected fraud at Signature Group in 2024. From: Serious Fraud Office Published 29 November 2024. Case state: Open Date announced: 21 February 2024",
        "sentiment": "1 (Negative)",
        "link": "https://www.gov.uk/sfo-cases/signature-group"
    },
    {
        "title": "The Signature Hospital | LinkedIn",
        "snippet": "The Signature Hospital | 1,129 followers on LinkedIn. A 300 bedded advanced super speciality hospital | As a 300-bedded premium hospital, we offer the best in class services and personalized medical care, all dedicated to adding value to your life and health. Our inherent focus is on serving our community, by setting a standard of excellence in providing comprehensive facilities, luxury ...",
        "sentiment": "5 (Positive)",
        "link": "https://in.linkedin.com/company/signaturehospital"
    },
    {
        "title": "Four arrested in Signature Group '£140m property fraud' probe - BBC",
        "snippet": "Four arrested in Signature Group '£140m property fraud' probe. 21 February 2024. ... (SFO) said focused on the company Signature Group. The Liverpool-based firm, which had a portfolio of hotels ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.bbc.com/news/uk-england-merseyside-68359320"
    },
    {
        "title": "Two Missouri Behavioral Hospitals to Close, 154 Layoffs",
        "snippet": "Posted September 17, 2024 Signature Psychiatric Hospital will close two locations in Kansas City and Liberty, ending 154 positions in the health system. Signature Psychiatric Hospital is permanently closing locations at North Kansas City Hospital and Liberty Hospital, according to a Worker Adjustment and Retraining Notification (WARN) Act notice filed on Sept. 13.",
        "sentiment": "1 (Negative)",
        "link": "https://ingrams.com/article/missouri-behavioral-hospitals-154-layoffs/"
    },
    {
        "title": "Extending Care - Park Hospital",
        "snippet": "Signature Hospital Quick Appointment Appointment. Contact Us Ambulance/Emergency. Park Emergency +91-9916699166. Delhi +91-7533033025 ... AMRC Hospital (a Unit of Park Group of Hospitals) Sector-3, Kiran Path, Mansarovar, Jaipur. 300+ Beds | 90+ Expert Doctors. Get Directions | Read More. Healing Touch Hospital.",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/our-hospital"
    },
    {
        "title": "FCA secures conditional resolution of proceedings against Park First ...",
        "snippet": "1 August 2023 update: The FCA has secured a further settlement which will see £1 million added to the CVA process for investors of Park First.. As part of the FCA's actions against Park First, further funds have been secured on behalf of investors. The funds, which will be paid into the CVA process, resulted from conditions within the original settlement process which saw Park First ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.fca.org.uk/news/press-releases/conditional-resolution-proceedings-park-first-and-senior-management"
    },
    {
        "title": " Park Hospitals - Credit Rating",
        "snippet": "Neotia group, association of experienced doctors and tie-ups with reputed corporates, satisfactory occupancy levels with comfortable Average Revenue per Operating Bed (ARPOB) and steady average length of stay (ALOS) albeit moderation ... Park Hospitals was incorporated in 1990 by the Ambuja-Neotia Group of Kolkata. The company is a non-profit ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.careratings.com/upload/CompanyFiles/PR/07012022061901_Park_Hospitals.pdf"
    },
    {
        "title": "Property Firm Investigation: Fraud Office Arrests Four After Signature ...",
        "snippet": "The UK's Serious Fraud Office (SFO) has initiated an extensive investigation into the collapse of the Signature Group, a Liverpool-based property company, resulting in significant financial losses for over a thousand investors globally.",
        "sentiment": "1 (Negative)",
        "link": "https://landlordknowledge.co.uk/property-firm-investigation-fraud-office-arrests-four-after-signature-group-collapse/"
    },
    {
        "title": "Signature Orthopedics St. Louis - Signature Medical Group",
        "snippet": "Signature Orthopedics is one of the largest orthopedic practices in the St. Louis area. Our orthopedic associates are experts in bone and joint pain and injury, foot and ankle, hand, hip and knee, shoulder and elbow, spine, sports medicine and overuse injuries, interventional pain management, physical medicine and rehabilitation, joint replacement, and pediatric and adolescent orthopedics.",
        "sentiment": "5 (Positive)",
        "link": "https://www.signaturemedicalgroup.com/st-louis-orthopedics/"
    },
    {
        "title": "Ex-servicemen health scheme scam: Punjab and Haryana HC orders setting ...",
        "snippet": "The petitioner contended that the hospital has been committing the aforementioned fraudulent activities since 2016 i.e. for around five years and under such fraudulent acts the hospital has unduly ...",
        "sentiment": "1 (Negative)",
        "link": "https://timesofindia.indiatimes.com/city/chandigarh/ex-servicemen-health-scheme-scam-punjab-and-haryana-hc-orders-setting-up-of-sit/articleshow/88292207.cms"
    },
    {
        "title": "Signature Forgery Explained: Types, Prevent, Penalty, Legal - Signeasy",
        "snippet": "Broad concept encompassing various fraudulent activities using stolen personal information. Typical Outcomes: Financial fraud, document alteration, or unauthorized access to assets using a forged signature. Unauthorized financial transactions, fraudulent accounts, and other activities using stolen personal data. Identity Compromise",
        "sentiment": "1 (Negative)",
        "link": "https://signeasy.com/blog/business/signature-forgery"
    },
    {
        "title": "SIGNATURE HOTEL GROUP LIMITED - Companies House",
        "snippet": "People for SIGNATURE HOTEL GROUP LIMITED (03929827) Charges for SIGNATURE HOTEL GROUP LIMITED (03929827) More for SIGNATURE HOTEL GROUP LIMITED (03929827) Registered office address Dunchurch Park Conference Centre, Rugby Road, Dunchurch, Warwickshire, CV22 6QW . Company status Active Company type Private limited Company Incorporated on 21 ...",
        "sentiment": "1 (Negative)",
        "link": "https://find-and-update.company-information.service.gov.uk/company/03929827"
    },
    {
        "title": "MPs begin probe over fraudulent claims of NHIF by hospitals - The Star",
        "snippet": "Ministry of Health confirmed on January 5 that the national insurer lost Sh171 million due to sham activities. ... exceeding Sh20 billion in losses from about 40 per cent fraudulent hospitals ...",
        "sentiment": "2 (Negative)",
        "link": "https://www.the-star.co.ke/news/2024-02-01-mps-begin-probe-over-fraudulent-claims-of-nhif-by-hospitals"
    },
    {
        "title": "Dis-empanelment of Seven ECHS Empanelled Hospitals",
        "snippet": "Dis-Empanelment of Seven ECHS Empanelled Hospitals at Amritsar & Tarn Taran, Punjab Involved in Fraudulent Activities No.18(34)/2020-D(WE/Res-I) Government of India Ministry of Defence Department of Ex-Servicemen Welfare D(WE/Res-I) New Delhi, the 18th June 2021 To, The Managing Director, CO, EC ... Punjab involved in fraudulent activities ...",
        "sentiment": "1 (Negative)",
        "link": "https://geod.in/ex-servicemen/dis-empanelment-of-seven-echs-empanelled-hospitals/"
    },
    {
        "title": "Park Group of Hospitals Information - RocketReach",
        "snippet": "Park Group of Hospital is the fastest growing chain of hospitals in Delhi NCR, which presently has over 1500 beds, and has attained supremacy in the field of healthcare with its crème-de-la-crème tertiary medical care. Started by Dr Ajit Gupta in 1982, with Park Sunil Hospital in Malviya Nagar as the first one, and now it has 8 hospitals in ...",
        "sentiment": "5 (Positive)",
        "link": "https://rocketreach.co/park-group-of-hospitals-profile_b45d3b00fc639471"
    },
    {
        "title": "Preventing Digital Signature Fraud: Tips and Strategies - Imagine IT",
        "snippet": "Anomaly detection: AI-powered systems can analyze digital signature usage patterns to identify unusual or potentially fraudulent activity, such as multiple signatures originating from the same IP address in a short period. Forgery detection: Machine learning algorithms can be trained to recognize subtle differences between genuine and forged digital signatures, making it easier to spot ...",
        "sentiment": "1 (Negative)",
        "link": "https://imit.com/preventing-digital-signature-fraud/"
    },
    {
        "title": "The Signature Hospital, Multi Speciality Hospital in Gurgaon - Practo",
        "snippet": "Signature Hospital, with over 40 years of expertise, is a state-of-the-art healthcare provider committed to delivering premium and holistic patient care. Located in Gurgaon sector 37C, the hospital sets a benchmark in medical excellence by combining cutting-edge technology and exceptional healthcare services.",
        "sentiment": "5 (Positive)",
        "link": "https://www.practo.com/gurgaon/hospital/signature-hospital-gurgaon-sector-37"
    },
    {
        "title": "Preventing Financial Fraud: The Role of Medallion Signature Guarantee ...",
        "snippet": "4. Medallion signature guarantee prevents financial fraud: The medallion signature guarantee process is designed to prevent financial fraud by ensuring that the person signing the document is the rightful owner of the securities being transferred. This process reduces the risk of fraudulent transactions and protects the interests of all parties ...",
        "sentiment": "4 (Positive)",
        "link": "https://fastercapital.com/content/Preventing-Financial-Fraud--The-Role-of-Medallion-Signature-Guarantee.html"
    },
    {
        "title": " Medical Malpractice: The Fraudulent Electronic Medical Record",
        "snippet": "and juries in assessing the culpability of a physician or hospital charged with malpractice. Malpractice insurance companies and hospital risk managers drill physicians about the importance of careful documentation in the medical record. A physician note that is exculpatory, carefully explaining his medical decision making, promotes a successful",
        "sentiment": "1 (Negative)",
        "link": "https://foxandfoxlawcorp.com/wp-content/uploads/2020/07/Article_re_Altered_Records.pdf"
    },
    {
        "title": "Report Fraudulent Activities - DocuSign Support Center",
        "snippet": "I know the sender and want them to stop contacting me: Select this option and select SEND ABUSE REPORT.; I don't know the sender and think this is spam: Select this option and select SEND ABUSE REPORT.; I believe this is fraudulent or contains illegal content: Select this option and select CONTINUE to access another page where you can add detailed information.",
        "sentiment": "1 (Negative)",
        "link": "https://support.docusign.com/s/document-item?language=en_US&bundleId=yca1573855023892&topicId=uec1690221505200.html&_LANG=enus"
    },
    {
        "title": "S v Musendo & Anor (CA 1358 of 2013; CRB R 43 of 2012; HH 289 of 2017 ...",
        "snippet": "ZimLII aims to provide for the knowledge needs of a growing group of people learning, aware and interested in the justice and legal framework of our country. ZimLII is a member of the global Free Access to Law Movement and works closely with the African and international free access to law community to promote justice and rule of law by ...",
        "sentiment": "1 (Negative)",
        "link": "https://zimlii.org/akn/zw/judgment/zwhhc/2017/289/eng@2017-05-10"
    },
    {
        "title": "Signature Forgery Explained - Types, Risks, and Protection Tips",
        "snippet": "Signature Forgery Explained - Types, Risks, and Protection Tips. Signature forgery is the unauthorized imitation or duplication of a person's signature to commit illegal activities like fraud or identity theft. The forger may fake the signature on paper or digitally, often resulting in financial loss for the victims.",
        "sentiment": "1 (Negative)",
        "link": "https://fynk.com/en/blog/signature-forgery/"
    },
    {
        "title": " Clarifying liability for twenty-first-century payment fraud",
        "snippet": "their fraud prevention and mitigation strategies to the new channels. For example, in 2011, Aite Group re-searchers conducted interviews with financial institu-tion officials and found that technology investments for fraud prevention and mitigation were being shifted toward business units for online and mobile payment channels (see figure 1).",
        "sentiment": "1 (Negative)",
        "link": "https://www.chicagofed.org/-/media/publications/economic-perspectives/2013/3q2013-part2-dhameja-jacob-porter-pdf.pdf"
    }
]