[
    {
        "title": "Patient mistreatment of health care professionals | BMC Medical ...",
        "snippet": "Background Mistreatment of health care professionals by patients is an ongoing problem. We aimed to construct and evaluate a curriculum that would prepare health care professionals for mistreatment by patients. Methods Lessons learned from 15 interviews and 2 focus groups with health care professionals were distilled into a multi-modal curriculum including didactics, simulation videos and role ...",
        "sentiment": "1 (Negative)",
        "link": "https://bmcmededuc.biomedcentral.com/articles/10.1186/s12909-022-03198-w"
    },
    {
        "title": "Coming Together to Address the Mistreatment of Health Care Staff by ...",
        "snippet": "At Connecticut Mental Health Center﻿ (CMHC), the subject of patient abuse of staff took center stage this fall as over 100 staff members (and counting) participated in \"ERASE-ing Mistreatment by Patients,\" a 90-minute interactive training designed to help healthcare professionals develop strategies to respond to harmful patient behavior ...",
        "sentiment": "1 (Negative)",
        "link": "https://medicine.yale.edu/news-article/coming-together-to-address-mistreatment-of-healthcare-staff-by-patients/"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Park hospital is the fastest growing chain of advanced super speciality hospitals, Provides patients with best & affordable healthcare treatment. ... Signature Hospital Quick Appointment Appointment. Contact Us Ambulance/Emergency. Park Emergency +91-9916699166. Delhi +91-7533033025 ... Park Group of Hospitals, situated in North India, is a ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/"
    },
    {
        "title": "Patient mistreatment of health care professionals - PubMed",
        "snippet": "They were also more likely to agree post-workshop that there was something they could do to address patient mistreatment (p < .001). Conclusions: Participant familiarity and confidence in responding to patient mistreatment increased. Our curriculum may serve as a foundation for institutions seeking to equip their educators, health care ...",
        "sentiment": "1 (Negative)",
        "link": "https://pubmed.ncbi.nlm.nih.gov/35227253/"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Park hospital is the fastest growing chain of advanced super speciality hospitals, Provides patients with best & affordable healthcare treatment. ... Advisor to Chairman & Managing Director. Group Head: International Marketing & HR. Rajesh Sharma. Group Director Finance. Brig. Salil Sharma (Retd.) ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.parkhospital.in/meet-our-management"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Park hospital is the fastest growing chain of advanced super speciality hospitals, Provides patients with best & affordable healthcare treatment. ... Having been the Founder of Park & Signature Group of Hospitals since 2004, Dr. Ankit Gupta has accrued over 18 years of experience in the healthcare sector. His leadership has led the Group to ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/visionaries"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Address. Meera Enclave(Chowkhandi), Outer Ring Road, New Delhi. Email info@parkhospital.in; Telephones 1800-102-6767; Working Hours. 24/7 (Emergency Department)",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/contact-us"
    },
    {
        "title": "Sign in to your online account - HealthPartners",
        "snippet": "Your HealthPartners or Park Nicollet MyChart is part of your HealthPartners online account. After you sign in, you'll be able to message your care team, see test results and view health records. Sign in using the links above and select \"My care\" from the menu.",
        "sentiment": "5 (Positive)",
        "link": "https://www.healthpartners.com/account/sign-in/"
    },
    {
        "title": "Park Signature Hotels",
        "snippet": "Welcome to Park Signature Hotels",
        "sentiment": "5 (Positive)",
        "link": "https://parksignaturehotels.com/"
    },
    {
        "title": "Advance Super Multi Speciality Hospital in Gurugram Sector 47|Park Hospital",
        "snippet": "Park Hospital is a fully-equipped private hospital with state-of-the-art medical facilities, 250 plus beds multispecialty hospital in Gurugram ... Signature Hospital Quick Appointment Appointment. Contact Us Ambulance/Emergency. Park Emergency +91-9916699166. Delhi +91-7533033025 ... Gurugram is an ambitious initiative from Park Group. This is ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/hospital/super-multispeciality-hospital-in-gurugram"
    },
    {
        "title": "Park Signature Group",
        "snippet": "Buckhead's first luxury condo developer, Park Signature Properties, developed over 550 luxury condos in three buildings in the Buckhead area and has resold 100's over the years. No one has our level of expertise and experience. We know the Buckhead Atlanta condo market better than anyone.",
        "sentiment": "5 (Positive)",
        "link": "http://parksignatureproperties.com/agent/park-signature-group/"
    },
    {
        "title": "Frank Auman - Signature Property Group, Inc.",
        "snippet": "Director Frank founded Signature Property Group, Inc. (SPG) in 1990, and has since developed more than 6,000 units in the Greensboro, Raleigh, and Charlotte markets and surrounding communities, with an additional 2,000 units presently underway.",
        "sentiment": "2 (Negative)",
        "link": "https://www.signaturepropertygroup.com/frank-auman/"
    },
    {
        "title": "signature-park-grande",
        "snippet": "OFFICIAL WEBSITE of SIGNATURE PARK GRANDE Welcome to New Dreams Signature Park Grande +6221 80890077",
        "sentiment": "5 (Positive)",
        "link": "https://www.signaturepark-grande.com/"
    },
    {
        "title": "Park Group of Hospitals | LinkedIn",
        "snippet": "Book an Appointment with Dr. Sachin Abrol, Consultant - Urology at Park Hospital, Panipat Consult Now: 7027 8989 89, 99166 99166 Park Group of Hospitals: NABL & NABH Accredited 30+ Specialties 10 Lakhs+ Patients Treated 1.5 Lakhs+ International Patients Treated 1 Lakh+ Surgeries Completed . . .",
        "sentiment": "5 (Positive)",
        "link": "https://in.linkedin.com/company/park-hospital"
    },
    {
        "title": "Know more about Park Hospital, who we are and our people",
        "snippet": "In 1982, Dr. Ajit Gupta, Founder , Park Group of Hospitals, envisaged the group to be a collection of medical services and facilities with commitment and compassion to deliver high quality patient-centric healthcare. This journey of social responsibility started with the establishment of the first hospital in Malviya Nagar, South Delhi.",
        "sentiment": "4 (Positive)",
        "link": "https://www.parkhospital.in/about-us"
    },
    {
        "title": "Park Signature Hotels",
        "snippet": "Welcome to Park Signature Hotels",
        "sentiment": "5 (Positive)",
        "link": "http://parksignaturehotels.com/"
    },
    {
        "title": "Signature Care Network Provider Directory - Parkview Health",
        "snippet": "Signature Care Network Provider Directory. With Signature Care, you have access to over 21,000 physicians, specialists and advanced practice providers (Nurse Practitioners and Physician Assistants). Click here to search the provider directory or view the PDF directory. For a list of our top in-network facilities, click here.",
        "sentiment": "4 (Positive)",
        "link": "https://www.parkview.com/employer-solutions/signature-care/for-members/provider-directory"
    },
    {
        "title": "Park Group of Hospitals - LinkedIn",
        "snippet": "Park Group of Hospital is the fastest growing chain of hospitals in Delhi NCR, which presently has over 1500 beds, and has attained supremacy in the field of healthcare with its crème-de-la ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.linkedin.com/company/parkgroupofhospitals"
    },
    {
        "title": "Signature Healthcare Leadership",
        "snippet": "Chenese Nicholas joined Signature Healthcare Brockton Hospital as Chief Nursing Officer on September 30, 2024. Previously, she served as Senior Director of Clinical Operations at Stamford Hospital in Stamford Connecticut, where she provided strategic leadership and fiscal oversight for several key departments, including Cardiology, Oncology, Medicine, and Surgery, driving improvements in ...",
        "sentiment": "4 (Positive)",
        "link": "https://signature-healthcare.org/?/about/signature-healthcare-leadership/"
    },
    {
        "title": "SIGNATURE GROUP LIMITED - Companies House",
        "snippet": "SIGNATURE GROUP LIMITED - Free company information from Companies House including registered office address, filing history, accounts, annual return, officers, charges, business activity ... Registered office address changed from Newport House Newport Road Stafford Staffordshire ST16 1DA England to Park House Wilmington Street Leeds LS7 2BP on ...",
        "sentiment": "1 (Negative)",
        "link": "https://find-and-update.company-information.service.gov.uk/company/09417580/filing-history"
    },
    {
        "title": "The impacts of patient mistreatment on healthcare workers' role ...",
        "snippet": "Background: Fangcang shelter hospitals have played an important role in the battle against the COVID-19 epidemic in China. Patients' verbal and physical attacks on medical workforce are prone to occur in such hospitals. This study explored the impacts of patient mistreatment on healthcare workers' role behaviors (service performance and patient-oriented organizational citizenship behavior).",
        "sentiment": "3 (Neutral)",
        "link": "https://pubmed.ncbi.nlm.nih.gov/38001446/"
    },
    {
        "title": "Park Signature",
        "snippet": "All residential properties in Park Signature that have been announced in the documents containing the sales arrangement have been sold and the sales of Park Signature were terminated. The photographs, images, drawings or sketches shown in this advertisement/ promotional material represent an artist's impression of the development concerned only.",
        "sentiment": "4 (Positive)",
        "link": "https://www.parksignature.com.hk/en/index.html"
    },
    {
        "title": "Hospital Locations, Nearby Hospitals | Prospect Medical Holdings",
        "snippet": "The physicians and staffs at our 16 acute care and behavioral health hospitals work to provide patient-centered care close to home. Hospital Locations / Map. Check out our interactive map to view our 16 hospitals in five states. ... Hospitals. Medical Group. Behavioral Health. Outpatient Centers. Careers. All Jobs. Nursing. Executives. Contact ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.pmh.com/locations/"
    },
    {
        "title": "Mistreatment and Care Concerns for a Patient at the VA Montana ...",
        "snippet": "The OIG identified issues related to a pattern of patient mistreatment in the CLC, care coordination and discharge planning, and facility leaders' noncompliance with state licensing board requirements.The OIG substantiated the allegation that a physical therapist and nursing staff forced the patient to participate in physical therapy in the ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.oversight.gov/reports/mistreatment-and-care-concerns-patient-va-montana-healthcare-system-miles-city-and-fort"
    },
    {
        "title": "Exploring patient preferences for involvement in medication management ...",
        "snippet": "Aim: The aim of this study was to identify patient preferences for involvement in medication management during hospitalization. Design: A qualitative descriptive study. Methods: This is a study of 20 inpatients in two medical and two surgical wards at an academic health science centre in Melbourne, Australia. Semi-structured interviews were recorded and analysed using content analysis.",
        "sentiment": "3 (Neutral)",
        "link": "https://pubmed.ncbi.nlm.nih.gov/31162718/"
    },
    {
        "title": "Board Of Directors - Sentara Healthcare",
        "snippet": "2025 Sentara Health Board of Directors . Allan Parrott -- Chair; Whitney Saunders, Esq. -- Vice Chair; Dennis Matheis -- President and CEO; Thomas Alberico, M.D.",
        "sentiment": "3 (Neutral)",
        "link": "https://www.sentara.com/aboutus/about-sentara/board-of-directors"
    },
    {
        "title": "Patient Experience and Public Involvement (PEPI) - NHSGGC",
        "snippet": "Patient Experience and Public Involvement (PEPI) support NHSGGC to listen and understand what matters to people. This allows us to improve our services using your experiences of care. The team help staff and members of the public to listen and learn from each other. PEPI support staff and services to engage with people on care… Continue reading >Patient Experience and Public Involvement (PEPI)",
        "sentiment": "5 (Positive)",
        "link": "https://www.nhsggc.scot/hospitals-services/services-a-to-z/patient-experience-and-public-involvement-pepi/"
    },
    {
        "title": "Provider Portals - Parkview Health",
        "snippet": "Patient Interpreter Rights Health Plans; Employee Medicine. Employee Health Occupational Health Employee Assistance Program Workplace Wellness Employer Clinics. Agility Employer Portal; Provider Directory ... Visit the Signature Care For Providers page for more information. Parkview Select Care.",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkview.com/employer-solutions/health-plans/provider-portals"
    },
    {
        "title": "Healthcare Hospitality solutions - Signature Parking",
        "snippet": "Our staff becomes integral to the Patient-Centered Care commitment at your hospital by creating a safe and welcoming environment during the arrival and departure process. Wheelchair assistance, helping elderly patients, providing directions, opening doors and greeting everyone that enters the property are all part of what we do when you hire us.",
        "sentiment": "5 (Positive)",
        "link": "https://www.signatureparking.com/markets/hospitals/"
    },
    {
        "title": "Adopting a Novel Approach to Prevent and Address Patient Mistreatment ...",
        "snippet": "Verbal mistreatment of staff by patients is common in health care settings. Experiencing or witnessing mistreatment can have harmful psychological impacts, affecting well-being and clinical practice. As part of an effort to become an antiracist organization, an academic community mental health cente …",
        "sentiment": "1 (Negative)",
        "link": "https://pubmed.ncbi.nlm.nih.gov/38291887/"
    },
    {
        "title": "Park Group of Hospitals - LinkedIn",
        "snippet": "Book an Appointment with Dr. Deepak Tyagi, Director of the Department of Neurosciences at Park Grecian Hospital, Mohali Consult Now: 7562 000 000 Park Group of Hospitals: NABL & NABH Accredited 30 ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.linkedin.com/company/park-hospital"
    },
    {
        "title": "Improving Quality of Care in Hospitals for Victims of Elder ...",
        "snippet": "Problem definition: Hospitals have an opportunity to improve the quality of care provided to a particularly vulnerable population: victims of elder mistreatment. Despite this, no programs to prevent or stop elder abuse in the acute care hospital have been reported. An innovative, multidisciplinary emergency department (ED)-based intervention for elder abuse victims, the Vulnerable Elder ...",
        "sentiment": "4 (Positive)",
        "link": "https://pubmed.ncbi.nlm.nih.gov/29499813/"
    },
    {
        "title": "Board of Directors - Sheffield Teaching Hospital - s th",
        "snippet": "Mark is Director of Human Resources and Staff Development. He took up his original post as Director of Human Resources and Organisational Development in May 2009 bringing with him a wealth of experience. He was previously an Associate Director of Human Resources at Central Manchester University Hospitals NHS Foundation Trust.",
        "sentiment": "4 (Positive)",
        "link": "https://www.sth.nhs.uk/about-us/board-of-directors/"
    },
    {
        "title": "Signature Medical Group | Board & Executive Team",
        "snippet": "Learn more about the leadership team of Signature Medical Group. . Menu. Close. Find a Doctor; Specialties ... Board of Directors. Coles L'Hommedieu, MD. J. Clinton Walker, MD. Brian Fissel, MD. Chad Sackman CEO. ... we offer accessible, affordable, and quality health care to every patient. Business Solutions.",
        "sentiment": "5 (Positive)",
        "link": "https://www.signaturemedicalgroup.com/about-us/board-and-executive-team/"
    },
    {
        "title": "Patient Portal - Signature Medical Group",
        "snippet": "The portal should not be used for urgent or emergency situations. In case of an emergency, call 911 or go to the nearest emergency room. Please go to Pay My Bill to make a payment on your account.",
        "sentiment": "1 (Negative)",
        "link": "https://www.signaturemedicalgroup.com/patient-resources/patient-portal/"
    },
    {
        "title": "Signature Care - Parkview Health",
        "snippet": "Signature Care offers the best discounts on services provided at Parkview hospitals and by Parkview physicians, which provides significant cost savings to both the employee and business. The network allows employees and their families convenient access to hospitals, physicians and other healthcare providers throughout Indiana and northwest Ohio.",
        "sentiment": "4 (Positive)",
        "link": "https://www.parkview.com/employer-solutions/signature-care/signature-care"
    },
    {
        "title": "Park Signature Hotels - Royal Benza (Vijayawada, India), Vijayawada ...",
        "snippet": "View deals for Park Signature Hotels - Royal Benza, including fully refundable rates with free cancellation. Krishna River is minutes away. Breakfast, WiFi and parking are free at this hotel. All rooms have LCD TVs and plush bedding.",
        "sentiment": "5 (Positive)",
        "link": "https://in.hotels.com/ho1360167968/hotel-royal-benza-vijayawada-india/"
    }
]