[
    {
        "title": "Mangaluru doctor found drunk on duty, sparks outrage",
        "snippet": "Mangaluru: A doctor at a prominent hospital in Mangaluru was found in a state of intoxication during a night shift on Saturday, raising serious concerns about patient safety.A video of the incident has gone viral on social media, leading to widespread outrage and public concern. A video showing the doctor unable to walk or communicate properly circulated online, igniting a flurry of angry ...",
        "sentiment": "1 (Negative)",
        "link": "https://medicaldialogues.in/news/health/doctors/mangaluru-doctor-found-drunk-on-duty-sparks-outrage-135473"
    },
    {
        "title": "Signature Care Network Provider Directory - Parkview Health",
        "snippet": "Signature Care Network Provider Directory. With Signature Care, you have access to over 21,000 physicians, specialists and advanced practice providers (Nurse Practitioners and Physician Assistants). Click here to search the provider directory or view the PDF directory. For a list of our top in-network facilities, click here.",
        "sentiment": "4 (Positive)",
        "link": "https://www.parkview.com/employer-solutions/signature-care/for-members/provider-directory"
    },
    {
        "title": "In conversation with Dr. Ankit Gupta on the journey of trust, quality ...",
        "snippet": "Dr. Ajit Gupta founded the Park Group of Hospitals in 1982 with the goal of providing affordable, quality healthcare to the common people of India. ... 1000+ full-time experienced veteran doctors ...",
        "sentiment": "5 (Positive)",
        "link": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/in-conversation-with-dr-ankit-gupta-on-the-journey-of-trust-quality-and-future-expansion-at-park-group-of-hospitals/articleshow/103962887.cms"
    },
    {
        "title": "Signature Care - Parkview Health",
        "snippet": "Signature Care offers the best discounts on services provided at Parkview hospitals and by Parkview physicians, which provides significant cost savings to both the employee and business. The network allows employees and their families convenient access to hospitals, physicians and other healthcare providers throughout Indiana and northwest Ohio.",
        "sentiment": "4 (Positive)",
        "link": "https://www.parkview.com/employer-solutions/signature-care/signature-care"
    },
    {
        "title": "Signature Care Members - Parkview Health",
        "snippet": "With Signature Care, you have access to over 21,000 physicians, specialists and advanced practice providers (nurse practitioners and physician assistants). When searching for providers, please note: Providers include individual doctors (MDs, DOs, PHDs) and other healthcare professionals such as nurse practitioners, physician assistants ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.parkview.com/employer-solutions/signature-care/for-members/members"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Park hospital is the fastest growing chain of advanced super speciality hospitals, Provides patients with best & affordable healthcare treatment. ... Group Director - Legal. Rakesh Bhardwaj. Vice President - Legal. Atin Mehta. Senior Law Officer. ... The Signature Hospital. Dr. Pardeep Singh. Deputy Medical Superintendent. Panipat. Brig. Yesh ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.parkhospital.in/meet-our-management"
    },
    {
        "title": "Park Group of Hospitals - LinkedIn",
        "snippet": "Park Group of Hospital is the fastest growing chain of hospitals in Delhi NCR, which presently has over 1500 beds, and has attained supremacy in the field of healthcare with its crème-de-la ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.linkedin.com/company/parkgroupofhospitals"
    },
    {
        "title": "Advance Super Multi Speciality Hospital in Gurugram Sector 37D",
        "snippet": "With 40 years of experience, the best is the threshold from where Signature Hospital ups the ante in expertise and technology, when it comes to healthcare services. Once any person steps into Signature Hospital, they can experience what satisfaction and complete care feel like.",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/hospital/super-multispeciality-hospital-in-gurgaon-37D"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Park Group of Hospitals, situated in North India, is a landmark healthcare entity of global standards. The Group is undergoing rapid expansion making in North India's fastest-growing chain of super-speciality hospitals including cancer and tertiary level care where patients continue to flock seeking medical intervention and care in the state-of-the-art facilities for various ailments.",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Park hospital is the fastest growing chain of advanced super speciality hospitals, Provides patients with best & affordable healthcare treatment. Signature Hospital Quick Appointment Appointment. Contact Us ... Doctors; Why Us; Careers & Courses . Careers; Courses; Media Room . Media; Blog; Newsletter; Dedicated",
        "sentiment": "3 (Neutral)",
        "link": "https://www.parkhospital.in/doctors"
    },
    {
        "title": "Doctors on Duty - Billing & Insurance",
        "snippet": "Doctors On Duty accepts most major health plans, cash, personal checks, Visa and MasterCard. If you do not have insurance or Medicare, payment of all charges is due at the time of service. ... ($10) from manufacturers of drugs, medical devices, and biologics to physicians and teaching hospitals be made available to the public.\" ...",
        "sentiment": "4 (Positive)",
        "link": "https://doctorsonduty.com/billing-insurance/"
    },
    {
        "title": "Doctors On Duty in Marina, CA - WebMD",
        "snippet": "Doctors On Duty, a Medical Group Practice located in Marina, CA. Find Providers by Specialty Find Providers by Procedure ... Doctors On Duty is a Practice with 1 Location. Currently Doctors On Duty's 9 physicians cover 7 specialty areas of medicine. ... Anthem Pathway X Tiered Hospital and Dental Prime MRF; BC CA California Care Small Group HMO ...",
        "sentiment": "4 (Positive)",
        "link": "https://doctor.webmd.com/practice/doctors-on-duty-13dfa3c8-4703-e211-a42b-001f29e3eb44"
    },
    {
        "title": "Patient Forms - Doctors on Duty",
        "snippet": "Doctors on Duty Offers Urgent Care, Primary Care & Occupational Medicine Services in Salinas, Monterey, Santa Cruz, and Surrounding Communities ... ($10) from manufacturers of drugs, medical devices, and biologics to physicians and teaching hospitals be made available to the public.\" ...",
        "sentiment": "5 (Positive)",
        "link": "https://doctorsonduty.com/patientforms/"
    },
    {
        "title": "Doctors On Duty in Salinas, CA - WebMD",
        "snippet": "You can also search by physician, practice, or hospital name . Doctor Finder; Doctors On Duty; ... Doctors On Duty. 1756 N Main St Salinas, CA 93906 (831) 443-8200. Overview. Doctors On Duty is a Group Practice with 1 Location. Currently Doctors On Duty's 6 physicians cover 7 specialty areas of medicine. ... Aetna Signature Administrators PPO ...",
        "sentiment": "4 (Positive)",
        "link": "https://doctor.webmd.com/practice/doctors-on-duty-d0d6a3c8-4703-e211-a42b-001f29e3eb44"
    },
    {
        "title": "Doctors on Duty - Locations",
        "snippet": "(831) 422-8601. Mon-Fri: 9am - 5pm Closed Sat & Sun Clinic Manager: Maritza Tena",
        "sentiment": "5 (Positive)",
        "link": "https://doctorsonduty.com/locations/"
    },
    {
        "title": "Draft of Medical Negligence Complaint Against The Signature Hospital ...",
        "snippet": "The complaint alleges gross medical negligence by doctors at The Signature Hospital in Gurugram that led to the wrongful death of the complainant's father. Key details include: 1) The complainant's father, aged 66, was in good health prior to the surgery and only needed a minor gallbladder removal procedure. 2) The surgery was conducted in a negligent manner without proper tests, discussion of ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.scribd.com/document/711679464/Draft-of-Medical-Negligence-Complaint-Against-The-Signature-Hospital-Park-Hospital-Gurgaon"
    },
    {
        "title": "PHYSICIANS AT Doctors On Duty Medical Clinics Santa Cruz - WebMD",
        "snippet": "Doctors On Duty Medical Clinics Santa Cruz is a Practice with 1 Location. Currently Doctors On Duty Medical Clinics Santa Cruz's 15 physicians cover 10 specialty areas of medicine. Mon 8:00 am - 8:00 pm",
        "sentiment": "4 (Positive)",
        "link": "https://doctor.webmd.com/practice/doctors-on-duty-medical-clinics-santa-cruz-7b803fc9-4703-e211-a42b-001f29e3eb44"
    },
    {
        "title": "Doctors On Duty in Salinas, CA - WebMD",
        "snippet": "You can also search by physician, practice, or hospital name . Doctor Finder; Doctors On Duty; ... 558 Abbott St Ste A Salinas, CA 93901 (831) 755-7880. Overview. Doctors On Duty is a Group Practice with 1 Location. Currently Doctors On Duty's 2 physicians cover 4 specialty areas of medicine. ... Aetna Signature Administrators PPO; Aexcel PPO ...",
        "sentiment": "4 (Positive)",
        "link": "https://doctor.webmd.com/practice/doctors-on-duty-886f3fc9-4703-e211-a42b-001f29e3eb44"
    },
    {
        "title": "Doctors On Duty in Seaside, CA - WebMD",
        "snippet": "Doctors On Duty, a Medical Group Practice located in Seaside, CA. Find Providers by Specialty ... You can also search by physician, practice, or hospital name . Doctor Finder; ... Doctors On Duty. 1513 Fremont Blvd Ste E1 Seaside, CA 93955 (831) 899-1910. Overview. Doctors On Duty is a Practice with 1 Location. Currently Doctors On Duty's 6 ...",
        "sentiment": "4 (Positive)",
        "link": "https://doctor.webmd.com/practice/doctors-on-duty-51a47bc8-4703-e211-a42b-001f29e3eb44"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Address. Meera Enclave(Chowkhandi), Outer Ring Road, New Delhi. Email info@parkhospital.in; Telephones 1800-102-6767; Working Hours. 24/7 (Emergency Department)",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/contact-us"
    },
    {
        "title": "Doctors on Duty - About Us",
        "snippet": "Thank you for your interest in Doctors On Duty, Salinas Urgent Care, and Harden Urgent Care. We want to ensure that our patients are satisfied with our services. If you have any questions, concerns, comments or compliments, please feel free to contact the clinic where you were treated or the corporate office. ... ($10) from manufacturers of ...",
        "sentiment": "5 (Positive)",
        "link": "https://doctorsonduty.com/about-us/"
    },
    {
        "title": "Maharashtra doctor, posted on emergency duty, found drunk",
        "snippet": "\"The incident took place on December 24, and I received a call about the incident at around 6 pm, saying that the doctor posted on emergency duty is in a drunk state. I raised the issue with higher officials,\" Lahane said. He added that the doctor has been relieved from duties at Karanja Hospital, and further action will be taken against him.",
        "sentiment": "4 (Positive)",
        "link": "https://www.indiatoday.in/india/story/maharashtra-drunk-doctor-washim-karanja-hospital-emergency-duty-video-2481298-2023-12-28"
    },
    {
        "title": "Doctors on Duty - Contact",
        "snippet": "Doctors on Duty Medial Clinics 100 Wilson Road, Suite 100 Monterey, CA 93940 (831) 649-1000 info@doctorsonduty.com Billing & Collection Days: Monday-Friday; Closed Saturday & Sunday Hours: 9 am to 5:00 pm billingmanager@doctorsonduty.com",
        "sentiment": "5 (Positive)",
        "link": "https://doctorsonduty.com/contact/"
    },
    {
        "title": "Park Hospital | Group of advance super speciality hospitals in India",
        "snippet": "Park hospital is the fastest growing chain of advanced super speciality hospitals, Provides patients with best & affordable healthcare treatment. ... At Park Group of Hospitals, we foster a healthy, safe, and productive work environment with a well-defined positive culture for our employees, while promoting a rewarding work & learning ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.parkhospital.in/career"
    },
    {
        "title": "Doctors on Duty - Seaside | Urgent Care in Seaside, CA",
        "snippet": "Handicap Access Doctors On Duty - Seaside 1513 Fremont Boulevard Suite E1 Seaside, CA 93955 Get Directions Phone: 831-899-1910. Hours. Monday-Friday: 8am-5pm. Saturday-Sunday: Closed. Hours subject to change. Please call 831-899-1910 for confirmation. Doctors On Duty - Seaside.",
        "sentiment": "4 (Positive)",
        "link": "https://www.salinasvalleyhealth.com/locations/doctors-on-duty-seaside/"
    },
    {
        "title": "Drinking on duty can get doctors suspended for 3 years: NMC draft RMP ...",
        "snippet": "\"Use of Alcohol or other intoxicants during duty or off duty which can affect professional practice will constitute misconduct. (L3, L4),\" read Section 23 of the Draft Regulations. Apart from this, the Draft Regulations have also barred the doctors from practicing during the period of incapacity.",
        "sentiment": "1 (Negative)",
        "link": "https://medicaldialogues.in/health-news/nmc/drinking-on-duty-can-get-doctors-suspended-for-3-years-nmc-draft-rmp-ethics-guidelines-93968"
    },
    {
        "title": "Doctors on Duty Medical Clinic, Marina, CA - Healthgrades",
        "snippet": "Doctors on Duty Medical Clinic is a medical group practice located in Marina, CA that specializes in Family Medicine and Internal Medicine. ... Find a Hospital; Find a Group Practice; Find a Pharmacy; Find an Urgent Care; Hospital Awards & Ratings. ... The receptionist at Doctors On Duty in Marina is very nice, but the service provided by the ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.healthgrades.com/group-directory/ca-california/marina/doctors-on-duty-medical-clinic-x2mtpy"
    },
    {
        "title": "Find a Doctor - Signature Medical Group",
        "snippet": "Find a Doctor. Finding the right doctor, with the right expertise and at a convenient location, should be an easy task. Our Find a Doctor filter allows you to enter as much or as little information to find a provider who meets your unique needs. ... Signature Medical Group is an independent, physician-owned multi-specialty group in the St ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.signaturemedicalgroup.com/doctors/"
    },
    {
        "title": "Mumbai Woman Doctor Assaulted By Drunk Patient, His Relatives ... - News18",
        "snippet": "A woman resident doctor was allegedly assaulted by a patient and a group of his 'intoxicated' attendants at Mumbai's Sion Hospital on Sunday morning. ... the incident took place at around 3.30 am on Sunday when the doctor was on duty in the ward. The patient visited the Sion's Lokmanya Tilak Municipal General Hospital with injuries on ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.news18.com/india/woman-resident-doctor-assaulted-by-intoxicated-attendants-at-mumbai-hospital-amid-kolkata-horror-9019113.html"
    },
    {
        "title": "Doctors on Duty, Salinas, CA - Healthgrades",
        "snippet": "Doctors on Duty is a medical group practice located in Salinas, CA that specializes in Physician Assistant (PA) and Family Medicine. Insurance Providers Overview Location Reviews Insurance Check",
        "sentiment": "4 (Positive)",
        "link": "https://www.healthgrades.com/group-directory/ca-california/salinas/doctors-on-duty-x4chkt"
    },
    {
        "title": "Doctors On Duty South Main Clinic in Salinas, CA - WebMD",
        "snippet": "Doctors On Duty South Main Clinic, a Medical Group Practice located in Salinas, CA. ... Doctors On Duty South Main Clinic is a Group Practice with 1 Location. Currently Doctors On Duty South Main Clinic's 27 physicians cover 16 specialty areas of medicine. ... Aetna Signature Administrators PPO; Aexcel PPO; Anthem Advantage HMO; Anthem BC ...",
        "sentiment": "3 (Neutral)",
        "link": "https://doctor.webmd.com/practice/doctors-on-duty-south-main-clinic-6c5dd9b2-9c5a-4a86-8fb3-defa12a108ee"
    },
    {
        "title": "Doctor, male nurse booked for being drunk while on duty - Deccan Herald",
        "snippet": "Doctor, male nurse booked for being drunk while on duty. The police registered a non-cognisable report (NCR) and forwarded it to the district health officer. DHNS.",
        "sentiment": "1 (Negative)",
        "link": "https://www.deccanherald.com/india/karnataka/bengaluru/doctor-male-nurse-booked-for-being-drunk-while-on-duty-3267320"
    },
    {
        "title": "DOCTORS ON DUTY - Updated January 2025 - Yelp",
        "snippet": "DOCTORS ON DUTY, 615 Ocean St, Santa Cruz, CA 95060, 19 Photos, Mon - 8:00 am - 6:00 pm, Tue - 8:00 am - 6:00 pm, Wed - 8:00 am - 6:00 pm, Thu - 8:00 am - 6:00 pm, Fri - 8:00 am - 6:00 pm, Sat - 8:00 am - 2:00 pm, Sun - 8:00 am - 2:00 pm ... Hospitals near Doctors On Duty. Emergency Rooms near Doctors On Duty. Walk in Clinic No Insurance near ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.yelp.com/biz/doctors-on-duty-santa-cruz"
    },
    {
        "title": "Physicians working under the influence of alcohol: An analysis of past ...",
        "snippet": "For physicians, working under the influence of alcohol is an uncommon phenomenon, but when it occurs - patients are at risk for receiving poor treatment. Presented analysis indicates that patients - just as much as supporting staff - frequently agree to receive supervision and care from a drunk doct …",
        "sentiment": "3 (Neutral)",
        "link": "https://pubmed.ncbi.nlm.nih.gov/29428450/"
    },
    {
        "title": "The Signature Hospital, Multi Speciality Hospital in Gurgaon - Practo",
        "snippet": "Signature Hospital, with over 40 years of expertise, is a state-of-the-art healthcare provider committed to delivering premium and holistic patient care. Located in Gurgaon sector 37C, the hospital sets a benchmark in medical excellence by combining cutting-edge technology and exceptional healthcare services.",
        "sentiment": "5 (Positive)",
        "link": "https://www.practo.com/gurgaon/hospital/signature-hospital-gurgaon-sector-37"
    },
    {
        "title": "Doctors on Duty - Marina | Urgent Care in Marina, CA",
        "snippet": "Handicap Access Doctors On Duty - Marina 3130 Del Monte Boulevard Marina, CA 93933 Get Directions Phone: 831-883-3330. Hours. Monday-Friday: 8am-5pm. Saturday-Sunday: Closed. Hours subject to change. Please call 831-883-3330 for confirmation. Doctors On Duty - Marina. Category: Urgent Care",
        "sentiment": "4 (Positive)",
        "link": "https://www.salinasvalleyhealth.com/locations/doctors-on-duty-marina/"
    },
    {
        "title": "Park Signature Group",
        "snippet": "Buckhead's first luxury condo developer, Park Signature Properties, developed over 550 luxury condos in three buildings in the Buckhead area and has resold 100's over the years. No one has our level of expertise and experience. We know the Buckhead Atlanta condo market better than anyone.",
        "sentiment": "5 (Positive)",
        "link": "http://parksignatureproperties.com/agent/park-signature-group/"
    },
    {
        "title": "Doctors On Duty Medical Group - LinkedIn",
        "snippet": "Doctors on Duty offers Urgent Care, Primary Care, and Occupational Medicine Services to residents on the Central Coast. We have clinics in Santa Cruz and Monterey counties, and our mobile clinic ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.linkedin.com/company/doctors-on-duty-medical-clinic"
    },
    {
        "title": "The Signature Hospital | LinkedIn",
        "snippet": "The Signature Hospital | 1,129 followers on LinkedIn. A 300 bedded advanced super speciality hospital | As a 300-bedded premium hospital, we offer the best in class services and personalized medical care, all dedicated to adding value to your life and health. Our inherent focus is on serving our community, by setting a standard of excellence in providing comprehensive facilities, luxury ...",
        "sentiment": "5 (Positive)",
        "link": "https://in.linkedin.com/company/signaturehospital"
    },
    {
        "title": "Signature Group of Hospital",
        "snippet": "SIGNATURE GROUP OF HOSPITAL. A Team Of Medical Professionals. Laboratory Services. Latest Equipments for various Lab tests, Done by experienced personnel. ... Most experienced Doctors always available and ready to be at your service 24x7. 26 Our Rooms. Spacious & Well maintained so that patients get well as soon as possible. 41",
        "sentiment": "5 (Positive)",
        "link": "https://signaturegroupofhospital.com/"
    },
    {
        "title": "Signature Hospital, Sector 37D, Gurgaon - View Doctors List, Timing ...",
        "snippet": "Signature Hospital, Sector 37D, Gurgaon Sector 37D, Near Dwarka Expressway, Gurgaon, Haryana, 122006",
        "sentiment": "4 (Positive)",
        "link": "https://www.credihealth.com/hospital/signature-hospital-sector-37d/doctors"
    },
    {
        "title": "Park Group of Hospitals | LinkedIn",
        "snippet": "Park Group of Hospitals | 3,033 followers on LinkedIn. Park Group of Hospital is the fastest growing chain of hospitals in Delhi NCR, which presently has over 1500 beds, and has attained supremacy in the field of healthcare with its crème-de-la-crème tertiary medical care. Started by Dr Ajit Gupta in 1982, with Park Sunil Hospital in Malviya Nagar as the first one, and now it has 8 hospitals ...",
        "sentiment": "5 (Positive)",
        "link": "https://in.linkedin.com/company/parkgroupofhospitals"
    },
    {
        "title": "The Signature Hospital - Sector 37D, Gurgaon - Bajaj Finserv Health",
        "snippet": "The hospital has experienced, qualified and highly trained doctors who diagnose, treat and surgically manage the patients who visit The Signature Hospital. The hospital caters to several medical specialties, including Dentistry, Cardiology, Neurology, Orthopedics, Urology, Plastic Surgery, General Medicine.",
        "sentiment": "4 (Positive)",
        "link": "https://www.bajajfinservhealth.in/hospitals/gurgaon/the-signature-hospital-sector-37d"
    },
    {
        "title": "Doctors On Duty Medical Clinics Aptos in Aptos, CA - WebMD",
        "snippet": "Doctors On Duty Medical Clinics Aptos, a Medical Group Practice located in Aptos, CA. Find Providers by Specialty ... or hospital name . Doctor Finder; Doctors On Duty Medical Clinics Aptos; ... 6800 Soquel Dr Aptos, CA 95003 (831) 662-3611. Overview. Doctors On Duty Medical Clinics Aptos is a Group Practice with 1 Location. Currently Doctors ...",
        "sentiment": "4 (Positive)",
        "link": "https://doctor.webmd.com/practice/doctors-on-duty-medical-clinics-aptos-73087703-a6e0-483c-af54-df7537f36694"
    },
    {
        "title": "Park Group of Hospitals | LinkedIn",
        "snippet": "Book an Appointment with Dr. Sachin Abrol, Consultant - Urology at Park Hospital, Panipat Consult Now: 7027 8989 89, 99166 99166 Park Group of Hospitals: NABL & NABH Accredited 30+ Specialties 10 Lakhs+ Patients Treated 1.5 Lakhs+ International Patients Treated 1 Lakh+ Surgeries Completed . . .",
        "sentiment": "5 (Positive)",
        "link": "https://in.linkedin.com/company/park-hospital"
    },
    {
        "title": "Doctors on Duty - Urgent Care",
        "snippet": "Doctors on Duty Offers Urgent Care, Primary Care & Occupational Medicine Services in Salinas, Monterey, Santa Cruz, and Surrounding Communities ... You should use a hospital's emergency department for very serious or life-threatening problems. If you are experiencing any of the following symptoms, do not wait! Call 911 or get to the nearest ...",
        "sentiment": "3 (Neutral)",
        "link": "https://doctorsonduty.com/urgent-care/"
    },
    {
        "title": " Together Blue Medicare HMO Plan 2025 Provider Directory",
        "snippet": "medical condition. When you need emergency care, go directly to a hospital emergency room or call 911 or your local emergency number. Show the hospital your Member ID card. In an emergency, you never need to contact any plan provider, even your own PCP, for authorization.",
        "sentiment": "1 (Negative)",
        "link": "https://producer.highmark.com/content/dam/highmark/en/highmarkbcbs/shopx/plan-documents/2025/together-blue-hmo/WPA_TBHMO_PD.pdf"
    },
    {
        "title": "North India's Fastest-growing Chain Of Super-specialty Hospitals Plans ...",
        "snippet": "Park Group of Hospitals added 5 new hospitals to its chain of hospitals from FY 2019 to FY 2021 alone, which is truly unheard of in the business of individually owned hospitals. Park Group of ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.prnewswire.com/in/news-releases/north-india-s-fastest-growing-chain-of-super-specialty-hospitals-plans-further-expansion-842280996.html"
    },
    {
        "title": "working with a physician who's under the influence - MDLinx",
        "snippet": "The surgeon was drunk — working with a physician who's under the influence. By Kristen Fuller, MD | Published April 21, ... \"When I was a young emergency room physician new to a small community hospital in California, I called in a well-known, big-shot surgeon to perform an emergency splenectomy after my patient was in a traumatic car ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.mdlinx.com/article/real-talk-working-with-a-physician-who-s-under-the-influence/6WifcEr3Kue9VsePg6gxzo"
    },
    {
        "title": "Metro Hospital (Park Group of Hospitals) - Palam Vihar, Gurgaon",
        "snippet": "On the Metro Hospital (Park Group of Hospitals) page on our website, you will see an OPD section where the OPD consultation timings of the hospital are mentioned. This section also contains the contact details of the hospital so that you consult Metro Hospital (Park Group of Hospitals) doctors for your medical issues.",
        "sentiment": "4 (Positive)",
        "link": "https://www.bajajfinservhealth.in/hospitals/gurgaon/metro-hospital-park-group-of-hospitals-palam-vihar"
    },
    {
        "title": "The Signature HOSPITAL, Hospital in Gurgaon | Practo",
        "snippet": "The Signature HOSPITAL is a Hospital in Gurgaon Sector 98, Gurgaon. The timings of The Signature HOSPITAL are: Mon-Sun: 06:00-23:00.",
        "sentiment": "4 (Positive)",
        "link": "https://www.practo.com/gurgaon/hospital/the-signature-hospital-gurgaon-sector-98"
    },
    {
        "title": "Private vs Public Law and a Doctor's Duty of Care - LawTeacher.net",
        "snippet": "Generally doctors owe a duty of care to their patients. A Hospital Trust would normally owe a duty of care to a patient of a doctor employed by the Trust. Outside a hospital or a doctor's surgery, for example at the scene of an accident, a doctor would not normally owe a duty of care if he did not attempt to help.",
        "sentiment": "4 (Positive)",
        "link": "https://www.lawteacher.net/free-law-essays/medical-law/introduction-to-medical-law-and-duty-of-care-essays.php"
    },
    {
        "title": "DOCTORS ON DUTY - Updated January 2025 - Yelp",
        "snippet": "Athena Medical Group. 44. Medical Centers. Browse Nearby. Hospitals near Doctors On Duty. Coffee near Doctors On Duty. Things to Do near Doctors On Duty. Restaurants near Doctors On Duty. ... DOCTORS ON DUTY, 501 Lighthouse Ave, Monterey, CA 93940, 20 Photos, Mon - 8:00 am - 6:00 pm, Tue - 8:00 am - 6:00 pm, Wed - 8:00 am - 6:00 pm, Thu - 8:00 ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.yelp.com/biz/doctors-on-duty-monterey-2"
    },
    {
        "title": "The Signature Hospital - LinkedIn",
        "snippet": "The Signature Hospital | 1,113 followers on LinkedIn. A 300 bedded advanced super speciality hospital | As a 300-bedded premium hospital, we offer the best in class services and personalized ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.linkedin.com/company/signaturehospital/"
    },
    {
        "title": "Practicing Under the Influence | Emergency Physicians Monthly",
        "snippet": "In my mind, after following my state's and hospital's policies, I think it's reasonable to have the physician undergo a fitness for duty exam by a worker's comp professional or undergo an assessment by an addictions specialist to make further recommendations for treatment or no treatment. Outcomes Now for the good news.",
        "sentiment": "3 (Neutral)",
        "link": "https://epmonthly.com/article/practicing-under-the-influence/"
    }
]