[
    {
        "title": "Prahlad Lodhi - Wikipedia",
        "snippet": "Prahlad Lodhi is an Indian politician from Madhya Pradesh. He is a two time elected Member of the Madhya Pradesh Legislative Assembly from 2018 and 2023, representing Pawai Assembly constituency as a Member of the Bharatiya Janata Party. Political career",
        "sentiment": "4 (Positive)",
        "link": "https://en.wikipedia.org/wiki/Prahlad_Lodhi"
    },
    {
        "title": "MP High Court stays conviction of disqualified BJP MLA Prahlad Lodhi in ...",
        "snippet": "Granting relief to Lodhi, who had appealed against Special Court-Bhopal's October 31 order, the single judge bench of MP High Court in Jabalpur, headed by Justice Vishnu Pratap Singh Chauhan ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.newindianexpress.com/nation/2019/nov/07/mp-high-court-stays-conviction-of-disqualified-bjp-mla-prahlad-lodhi-in-assault-case-2058501.html"
    },
    {
        "title": "Madhya Pradesh Disqualified BJP MLA Prahlad Lodhi's Conviction Put On ...",
        "snippet": "The Madhya Pradesh High Court has put a stay on the jail term of now-disqualified BJP MLA Prahlad Lodhi who was convicted in a criminal case and sentenced to two years in jail by a court in Bhopal ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.ndtv.com/india-news/madhya-pradesh-disqualified-bjp-mla-prahlad-lodhis-conviction-put-on-hold-by-high-court-2128779"
    },
    {
        "title": "Madhya Pradesh BJP MLA Prahlad Lodhi disqualified following conviction",
        "snippet": "Pawai seat had now fallen vacant as BJP MLA from Pawai, Prahlad Lodhi for attacking Revenue official R K Verma.(HT Photos) ... The MLA has the right to go the court, and we will do that,\" Singh ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.hindustantimes.com/india-news/mp-bjp-mla-prahlad-lodhi-disqualified-after-conviction/story-A1WOPjIiYOHw3JE6cFhYGK.html"
    },
    {
        "title": "Disqualified BJP MLA Prahlad Lodhi gets back his Vidhan Sabha membership",
        "snippet": "Prahlad Lodhi got his House membership back in the wake of favourable Madhya Pradesh High Court and Supreme Court orders staying his conviction in a 2014 case.",
        "sentiment": "4 (Positive)",
        "link": "https://www.newindianexpress.com/nation/2019/dec/10/disqualified-bjp-mla-prahlad-lodhi-gets-back-his-vidhan-sabha-membership-2074107.html"
    },
    {
        "title": "Prahlad Lodhi - PRS Legislative Research",
        "snippet": "Prahlad Lodhi; Data corresponds to the period from 03-12-2023 to 14-02-2024. Prahlad Lodhi. State : Madhya Pradesh. Constituency : Pawai. Party : Bharatiya Janata Party. ... Selected MLA. 11. State Average. 7.1. Follow Us. PRS Legislative Research is licensed under a Creative Commons Attribution 4.0 International License.",
        "sentiment": "1 (Negative)",
        "link": "https://prsindia.org/mlatrack/prahlad-lodhi-1"
    },
    {
        "title": "Prahlad Singh Patel Wiki, Age, Caste, Wife, Children, Family, Biography ...",
        "snippet": "Prahlad Singh Patel is an Indian politician affiliated with the Bharatiya Janata Party. ... Prahlad Singh Patel belongs to the Lodhi community. [2] The Times of ... Jamal Singh Patel, is also a member of the Bharatiya Janata Party (BJP) who is serving as an MLA from the Narsinghpur constituency since 2013. Jamal Singh Patel, brother of the BJP ...",
        "sentiment": "4 (Positive)",
        "link": "https://wikibio.in/prahlad-singh-patel/"
    },
    {
        "title": "Pawai Election Result 2023 LIVE Updates and Highlights: Prahlad Lodhi ...",
        "snippet": "In the 2018 Madhya Pradesh Assembly elections, Prahlad Lodhi of BJP won in this seat defeating Pandit Mukesh Nayak of INC by a margin of 23,680 which was 11.84% of the total votes cast for the seat. BJP had a vote share of 39.83% in 2018 in this seat.",
        "sentiment": "3 (Neutral)",
        "link": "https://www.news18.com/elections/pawai-election-result-2023-live-updates-and-highlights-winner-loser-leading-trailing-mla-margin-8687106.html"
    },
    {
        "title": "Prahlad Singh Patel, Age, Wife, Children, Family, Biography & More",
        "snippet": "Lodhi [2] The Times of India: Food Habit: Vegetarian [3] Official website of the Ministry of Tourism: Address: F-23, Sainik Society, Shakhti Nagar, Jabalpur-482002, Madhya Pradesh: Controversies • In June 2019, Prahlad Singh Patel's son, Prabal Singh Patel, was booked by the Damoh Police on charges of kidnapping and attempt to murder. Prabal ...",
        "sentiment": "4 (Positive)",
        "link": "https://starsunfolded.com/prahlad-singh-patel/"
    },
    {
        "title": "Mp : कैबिनेट मंत्री के काफिले में शामिल पवई विधायक की गाड़ी ...",
        "snippet": "Panna News / पन्ना न्यूज़ : काफी समय से बीमार चल रहे पवई विधायक प्रहलाद सिंह लोधी (Powai MLA Prahlad Singh Lodhi) को देखने गये कैबिनेट मंत्री बृजेन्द्र प्रताप सिंह (Cabinet Minister Brijendra Pratap Singh ...",
        "sentiment": "2 (Negative)",
        "link": "https://www.rewariyasat.com/panna/mp-powai-mlas-car-involved-in-cabinet-ministers-convoy-crashed-son-and-son-in-law-got-hurt/36664"
    },
    {
        "title": "MP: BJP meets governor over MLA Prahlad Lodhi's disqualification",
        "snippet": "Prahalad Lodhi was disqualified as an MLA after he was found guilty of attacking a revenue officer in 2014 by a lower court. Lodhi has been sentenced to two years of imprisonment. Madhya Pradesh Assembly Secretariat on Saturday announced a disqualification of BJP MLA from Pawai Prahlad Lodhi.",
        "sentiment": "1 (Negative)",
        "link": "https://www.indiatoday.in/india/story/mp-bjp-meets-governor-over-mla-prahlad-lodhi-s-disqualification-1616042-2019-11-05"
    },
    {
        "title": "Madhya Pradesh MLA List 2024 | Madhya Pradesh Vidhan Sabha Seats",
        "snippet": "The Madhya Pradesh Legislative Assembly / Madhya Pradesh Vidhan Sabha is the unicameral legislature of the state of Madhya Pradesh in India. There are 230 seats in the house filled by directly elected from the single-seat constituencies.",
        "sentiment": "4 (Positive)",
        "link": "https://www.findeasy.in/constituencies-in-madhya-pradesh-legislative-assembly/"
    },
    {
        "title": "Prahlad Singh Lodhi - NDTV.com",
        "snippet": "Also check Prahlad Singh Lodhi Election Results LIVE updates. Assembly Election 2024: Find Prahlad Singh Lodhi latest election news, videos and more only at NDTV.com. ... Sitting MLA. No. Total ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.ndtv.com/elections/madhya-pradesh/assembly-election-candidates-list-2023/prahlad-singh-lodhi-12095-7"
    },
    {
        "title": "Prahlad Lodhi - Pawai, Madhya Pradesh Legislative Assembly - Akhand App",
        "snippet": "Prahlad Lodhi is the member of legislative assembly of Madhya Pradesh from Pawai constituency. He won the elections for MLA in 2018 as a candidate of Bharatiya Janata Party. Personal details Prahlad Lodhi is 46 years old. His education level is Class VIII. Wealth, profession and criminal cases Total assets of Prahlad Lodhi are ₹21.15 lakh.",
        "sentiment": "4 (Positive)",
        "link": "https://akhandapp.in/mla/pawai-58/"
    },
    {
        "title": "Rahul Singh Lodhi, BJP's Candidate From Damoh Lok Sabha Constituency",
        "snippet": "Immediately after the declaration, Lodhi started his election tour. He has been visiting senior leaders of the party. Rahul Singh Lodhi was elected as Congress MLA in 2018 from the assembly constituency Damoh. He then resigned the MLA post and joined BJP. In the by-election that followed, Lodhi faced defeat from Ajay Tandon of Congress.",
        "sentiment": "4 (Positive)",
        "link": "https://timelinedaily.com/elections/rahul-singh-lodhi-bjps-candidate-from-damoh-lok-sabha-constituency"
    }
]