[
    {
        "title": "Raj Heights-The Global School",
        "snippet": "Raj Heights-The Global School. RAJ HEIGHTS-The Global School. rajheights2008@gmail.com +91-7354143484, +91-7471127844 Notification; Login ERP; HOME; ABOUT US ... Management. Raj Height-The Global School provides quality education with most modern facilities. Achievements.",
        "sentiment": "5 (Positive)",
        "link": "https://rajheights.org.in/"
    },
    {
        "title": "Raj Heights The Global School , Simrai",
        "snippet": "Raj Heights The Global School also known as RHTGS. The school was established in 2008. Raj Heights The Global School is a Co-Ed school affiliated to Central Board of Secondary Education (CBSE) . It is managed by Raj Educational And Social Welfare Society.",
        "sentiment": "4 (Positive)",
        "link": "https://school.careers360.com/schools/raj-heights-global-school-simrai-raisen"
    },
    {
        "title": "Raj Heights-The Global School",
        "snippet": "Raj Heights-The Global School. Raj Heights-The Global School. RAJ HEIGHTS-The Global School. rajheights2008@gmail.com +91-7354143484, +91-7471127844 Notification; Login ERP; HOME; ABOUT US ... Management Profile; Vision & Mission; Principal's Message; Infrastructure & Facilities ...",
        "sentiment": "5 (Positive)",
        "link": "https://rajheights.org.in/principal-message"
    },
    {
        "title": "RAJ HEIGHT- THE GLOBAL SCHOOL - Simrai, District Raisen (Madhya Pradesh)",
        "snippet": "About RAJ HEIGHT- THE GLOBAL SCHOOL . RAJ HEIGHT- THE GLOBAL SCHOOL was established in 2008 and it is managed by the Pvt. Unaided. It is located in Rural area. It is located in OBEDULLAGANJ block of RAISEN district of Madhya Pradesh. The school consists of Grades from 1 to 12. The school is Co-educational and it have an attached pre-primary ...",
        "sentiment": "1 (Negative)",
        "link": "https://schools.org.in/raisen/23340422407/raj-height-the-global-school.html"
    },
    {
        "title": "Raj Heights-the Global School , Mandideep, Raisen",
        "snippet": "The annual fees for Raj Heights-the Global School, Mandideep, Raisen is Rs 12000, 125000 for Day School, Boarding School, ... We offer various marketing and management services tailored to school. Request a call back. Call Whatsapp. for parents. Let help you find the best school for your kids. Reach out to us.",
        "sentiment": "4 (Positive)",
        "link": "https://schools18.com/school/16136-raj-heights-the-global-school-mandideep-raisen"
    },
    {
        "title": "Raj Heights - The Global School - Raisen, Madhya Pradesh",
        "snippet": "Founded in 2008, Raj Heights - The Global School is a Senior Secondary, affiliated to CBSE. Affiliation ID is 1030424. Address of the school is: Nh 12, Mandideep & Obedullaganj, Vill. Simrai, P.o. Obedullaganj, Goharganj, M.p.. PIN Code: 464993. Email address of the school is rajheights2008@gmail.com. The school is being managed by Raj ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.cbseschool.org/raj-heights-the-global-school-raisen-madhya-pradesh/"
    },
    {
        "title": "Contact-us - Raj Heights-The Global School",
        "snippet": "Raj Heights-The Global School. Raj Heights-The Global School. RAJ HEIGHTS-The Global School. rajheights2008@gmail.com +91-7354143484, +91-7471127844 Notification; Login ERP; HOME; ABOUT US. MISSION & VISION; PRINCIPAL'S MESSAGE; CHAIRPERSON'S MESSAGE; FACILITIES & INFRASTRUCTURE ...",
        "sentiment": "4 (Positive)",
        "link": "https://rajheights.org.in/contact-us"
    },
    {
        "title": "Admission Inquiry - Raj Height The Global School",
        "snippet": "Raj Heights-The Global School. Raj Heights-The Global School. RAJ HEIGHTS-The Global School. rajheights2008@gmail.com +91-7354143484, +91-7471127844 Notification; Login ERP; HOME; ABOUT US. MISSION & VISION; PRINCIPAL'S MESSAGE; CHAIRPERSON'S MESSAGE; FACILITIES & INFRASTRUCTURE ...",
        "sentiment": "3 (Neutral)",
        "link": "https://www.rajheights.org.in/admission"
    },
    {
        "title": "Raj Heights-The Global School",
        "snippet": "Raj Heights. Celebrating its 16 th year of existence is a relatively new educational institution in the vicinity of Bhopal is the brain child of the visionary Raj Educational and Social Welfare Society. It is established in the year 2008. The aim is to channelise the system of education through various curricular and co-curricular activities and crystallize the potential of todays young ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.rajheights.org.in/Notification"
    },
    {
        "title": "Raj Heights - The Global School, CBSE Syllabus, Raisen ... - Prokerala",
        "snippet": "Raj Heights - The Global School School is a Co-ed CBSE affiliated school in Raisen,Madhya Pradesh Get contact details, admission details and facilities at Raj Heights - The Global School school. ... Management: Raj Educational & Social Welfare Society : Education Category: Co-ed Report Incorrect Data. Location of Raj Heights - The Global School ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.prokerala.com/education/raj-heights-the-global-school-s2537.html"
    },
    {
        "title": "Raj Heights-The Global School, Mandideep, Raisen - Edustoke",
        "snippet": "Find details of Raj Heights-The Global School, Mandideep, Raisen, online application & registration, admission process, Contact Number, Fee Structure, Reviews, Rating and get Admission form details of Raj Heights-The Global School, Mandideep, Raisen.",
        "sentiment": "3 (Neutral)",
        "link": "https://www.edustoke.com/raisen/raj-heights-the-global-school-mandideep-residential"
    },
    {
        "title": "Global School Management",
        "snippet": "Global School Management was inspired by a sense of humanity and a desire to help children access better opportunities in life. Our mission is to bring quality education to wherever in the world it is needed the most. We believe that offering choice always improves outcomes for everyone, and that every pathway should be available to every child",
        "sentiment": "5 (Positive)",
        "link": "https://globalschool-mgmt.com/",
        "base_query": "Raj_Heights-The_Global_School",
        "keyword": "Workload Management"
    },
    {
        "title": "Vision And Mission - St. Alphonsa School, Jhirnia - Raj Heights",
        "snippet": "Raj Heights-The Global School. Raj Heights-The Global School. RAJ HEIGHTS-The Global School. rajheights2008@gmail.com +91-7354143484, +91-7471127844 Notification; Login ERP; HOME; ABOUT US. MISSION & VISION; PRINCIPAL'S MESSAGE; CHAIRPERSON'S MESSAGE; FACILITIES & INFRASTRUCTURE ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.rajheights.org.in/Curriculum"
    },
    {
        "title": "Vision And Mission - St. Alphonsa School, Jhirnia",
        "snippet": "Raj Heights-The Global School. Raj Heights-The Global School. RAJ HEIGHTS-The Global School. rajheights2008@gmail.com +91-7354143484, +91-7471127844 Notification; Login ERP; HOME; ABOUT US. MISSION & VISION; PRINCIPAL'S MESSAGE; CHAIRPERSON'S MESSAGE; FACILITIES & INFRASTRUCTURE ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.rajheights.org.in/Facilities.php"
    },
    {
        "title": "Raj Heights-The Global School - Mandideep , Bhopal - Yellow Slate",
        "snippet": "Raj Heights-The Global School, Mandideep, Bhopal, CBSE, NH-12, Mandideep - Obedullaganj Road, Village, Raisen, Madhya Pradesh, Gallery, Fees. Contact us for Admissions. Search Schools, Locations in Bhopal . Schools Near Me +91 9513238818 Bhopal . Add school for free in 5 mins ...",
        "sentiment": "3 (Neutral)",
        "link": "https://yellowslate.com/school/bhopal/raj-heights-the-global-school-mandideep"
    },
    {
        "title": "Raj Heights-The Global School Reviews - Mandideep - Yellow Slate",
        "snippet": "Here are the latest genuine reviews about Raj Heights-The Global School, Mandideep, Bhopal. Also explore the parent video reviews, school information, fees, admission, etc 2024-25. Search Schools, Locations in Bhopal +91 9513238818 Bhopal . Add school for free in 5 mins Book A Demo. Search Schools, Locations in Bhopal ...",
        "sentiment": "5 (Positive)",
        "link": "https://yellowslate.com/bhopal/raj-heights-the-global-school-mandideep-reviews"
    },
    {
        "title": "Raj Heights-The Global School, Mandideep, Raisen - Edustoke",
        "snippet": "Raj Heights-The Global School is one of the most prestigious school of India which is located at Mandideep, Raisen, Get online application & registration, fees structure, reviews, rating, contact numbers and admission form details.",
        "sentiment": "3 (Neutral)",
        "link": "https://www.edustoke.com/residential/raisen/raj-heights-the-global-school-mandideep"
    },
    {
        "title": "Better workload management can help schools - Nous Group",
        "snippet": "School workload management strategies can improve performance and wellbeing. Approaching the challenge as a culture change is benefiting many schools. ... Australian students have slipped in global rankings. This is not inevitable. While there is no silver bullet, a lot can be done to better manage workloads in schools and, by extension ...",
        "sentiment": "4 (Positive)",
        "link": "https://nousgroup.com/insights/better-workload-management-schools/",
        "base_query": "Raj_Heights-The_Global_School",
        "keyword": "Workload Management"
    },
    {
        "title": "Raj Heights - the Global School, Raisen, Madhya Pradesh",
        "snippet": "RAJ HEIGHTS - THE GLOBAL SCHOOL, RAISEN was founded in the year 2008. RAJ HEIGHTS - THE GLOBAL SCHOOL, RAISEN is a CBSE Affiliated Co-educational English Medium Senior Secondary.CBSE Affiliation ID / Code of RAJ HEIGHTS - THE GLOBAL SCHOOL, RAISEN is 1030424.",
        "sentiment": "4 (Positive)",
        "link": "https://aura.education/school-RAJ_HEIGHTS____THE_GLOBAL_SCHOOL-10668"
    },
    {
        "title": "Raj Heights in Sion, Mumbai: Price, Brochure, Floor Plan, Reviews",
        "snippet": "Raj Heights, Mumbai: View project details & price list of Raj Heights Sion, Mumbai. Check Brochure PDF Floor Plan Reviews Rent & Sale Price Trend Master Plan. ... All basic amenities like hospitals, schools, colleges, a...Show More. R. Rajesh. Agent. 23/01/2022. Sion. Sion is a very nice and beautiful locality. All basic amenities like ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.magicbricks.com/raj-heights-sion-mumbai-pdpid-4d4235303935303331",
        "base_query": "Raj_Heights-The_Global_School",
        "keyword": "Workload Management"
    },
    {
        "title": "St. Stephen's School Staff Handbook - Workload Management - Google Sites",
        "snippet": "Through the Staff Preference Survey Form and work reviews, school will collate teachers' preferences and requests for allocation; (b) Allocation. The school management will do a preliminary allocation of workload based on school needs and aims; (c) Feedback. The preliminary allocation is shared with staff for their feedback and concerns; and",
        "sentiment": "4 (Positive)",
        "link": "https://sites.google.com/moe.edu.sg/sss-staff-handbook/staff-matters/workload-management",
        "base_query": "Raj_Heights-The_Global_School",
        "keyword": "Workload Management"
    },
    {
        "title": "Workload management strategies in football: A global survey project",
        "snippet": "Aim: This research design protocol outlines the methodology for a thorough evaluation of workload monitoring and management strategies in football. Methods: The study involves conducting a global survey to fitness coaches, sports scientists, analysts, and physicians with experience in load monitoring within football. The research adheres to the principles of the Helsinki Declaration and ...",
        "sentiment": "3 (Neutral)",
        "link": "https://pubmed.ncbi.nlm.nih.gov/38468578/",
        "base_query": "Raj_Heights-The_Global_School",
        "keyword": "Workload Management"
    },
    {
        "title": "Raj Heights in Mahatma Gandhi Rd, Gaothan, Pushp Heritage ... - MyGate",
        "snippet": "Raj Heights is home to 129 exquisite houses, providing accommodation to a diverse and vibrant community. With an impressive occupancy rate of 92.25%, this society is a preferred choice for residents seeking a secure and comfortable abode. Ensuring the safety and security of its residents is a top priority for Raj Heights.",
        "sentiment": "4 (Positive)",
        "link": "https://mygate.com/mumbai/raj-heights-636.html",
        "base_query": "Raj_Heights-The_Global_School",
        "keyword": "Workload Management"
    },
    {
        "title": "WORKLOAD MANAGEMENT-1 | PPT - SlideShare",
        "snippet": "Signs of a heavy workload include feeling overwhelmed, working long hours, and making frequent errors. The document provides tips for managing workload such as prioritizing tasks, communicating needs to managers, delegating work, and saying no to non-essential tasks. Effective workload management reduces stress and burnout while poor management ...",
        "sentiment": "2 (Negative)",
        "link": "https://www.slideshare.net/slideshow/workload-management1/56512047",
        "base_query": "Raj_Heights-The_Global_School",
        "keyword": "Workload Management"
    },
    {
        "title": "Raj Heights The Global School Simrai Raisen | Admission 2024-25, Fee ...",
        "snippet": "About Raj Heights The Global School Simrai Raisen What is Admission Procedure and Criteria? Find out Fees Structure Find details of Facilities Find details of Infrastructure Know Syllabus & School Timings Documents Required at time of admission Read Principals Message and details Gallery Find School on Map Review School Important FAQ's on ...",
        "sentiment": "4 (Positive)",
        "link": "https://eduindianews.com/raj-heights-the-global-school-simrai-raisen/",
        "base_query": "Raj_Heights-The_Global_School",
        "keyword": "Workload Management"
    },
    {
        "title": "Global Schools",
        "snippet": "Global Schools develops the tools, resources and programs to support education systems around the world in shaping a more resilient and sustainable world. The vision of the program is to create a world where every primary and secondary school student is being equipped with the knowledge, values, and skills necessary for effectively responding ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.globalschoolsprogram.org/",
        "base_query": "Raj_Heights-The_Global_School",
        "keyword": "Workload Management"
    },
    {
        "title": "Leadership - Global School Management",
        "snippet": "LEADERSHIP TEAM. To bring vision to life you need the strength of great leaders and the team at Global School Management is unmatched. Founded in 2014 by well-known educators and visionaries Ron Packard and Maria Szalay, they have built a team of proven leaders with an extensive depth of experience and dedication to student success.",
        "sentiment": "5 (Positive)",
        "link": "https://globalschool-mgmt.com/leadership/",
        "base_query": "Raj_Heights-The_Global_School",
        "keyword": "Workload Management"
    },
    {
        "title": "Alamdar Raj Heights",
        "snippet": "Alamdar Raj Heights is located in Comrade Harbanslal Marg, Near Sindhi Seva Society, Opposite Karma Kshetra, GTB Nagar, Sion East, Mumbai. The project is developed by Alamdar Infrastructure Pvt. Ltd.. There are 81 units for sale. Alamdar Raj Heights is equipped with various resident-centric amenities that includes Gymnasium, Power Backup. Enjoy ...",
        "sentiment": "4 (Positive)",
        "link": "https://housing.com/in/buy/projects/page/5642-alamdar-raj-heights-by-alamdar-infrastructure-pvt-ltd-in-wadala",
        "base_query": "Raj_Heights-The_Global_School",
        "keyword": "Workload Management"
    },
    {
        "title": "Shree Raj Raj Heights in Nalasopara West, Mumbai | MagicBricks",
        "snippet": "Raj Heights floor plan is providing Housing in a gated community with the approval of several prestigious banks. The U.S.P of this project is the fact that it bears Wide open spaces with well-built walkways and that too along with ample of civic amenities like Dubey Shopping Centre, Pragati Nagar Bus Stop, Shah Multispeciality Hospital, ICICI Bank ATM, Lucky supermarket, IMC Mumbai, HP Petrol ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.magicbricks.com/raj-heights-nalasopara-west-mumbai-pdpid-4d4235303836353532",
        "base_query": "Raj_Heights-The_Global_School",
        "keyword": "Workload Management"
    },
    {
        "title": "Raj Gururajan | SP Jain School of Global Management",
        "snippet": "Raj Gururajan is an Adjunct Faculty at SP Jain School of Global Management. He teaches Research Methodology, IT Project Management, Global Information Strategy and Capstone Project Courses.",
        "sentiment": "4 (Positive)",
        "link": "https://www.spjain.org/faculty/profiles/raj-gururajan",
        "base_query": "Raj_Heights-The_Global_School",
        "keyword": "Workload Management"
    },
    {
        "title": "Rajhas Raj Heights in Dhas Wadi - Price, Reviews & Floor Plan - Housing.com",
        "snippet": "It has 28 units. There is 1 building in this project. Rajhas Raj Heights offers some of the most exclusive 1 BHK, 2 BHK. As per the area plan, units are in the size range of 297.0 - 389.0 sq.ft.. Launched in April 2023, Rajhas Raj Heights is slated for possession in Jun, 2024. The address of Rajhas Raj Heights is Mamdapur, Neral.",
        "sentiment": "4 (Positive)",
        "link": "https://housing.com/in/buy/projects/page/297065-rajhas-raj-heights-by-rajhas-enterprise-in-dhas-wadi",
        "base_query": "Raj_Heights-The_Global_School",
        "keyword": "Workload Management"
    },
    {
        "title": "The Global School - Worcester Polytechnic Institute",
        "snippet": "The Global School Mission. The Global School is founded on WPI's half-century of leadership in global project-based learning. The Global School embodies WPI's commitment to empower our faculty, students, communities, and collaborators to address urgent local and global challenges. ... Director of Global Risk Management Answers to questions ...",
        "sentiment": "5 (Positive)",
        "link": "https://www.wpi.edu/academics/global-school",
        "base_query": "Raj_Heights-The_Global_School",
        "keyword": "Workload Management"
    },
    {
        "title": "What Is Workload Management? - Genesys",
        "snippet": "Workload management is the process of strategically distributing work throughout the workforce in order to maximize employee or application skill & ... Dev Tools and Public APIs Cloud architecture Security and trust Global availability Integrations. Deliver end-to-end personalized experiences at scale. ... Ascend to new heights with our partners.",
        "sentiment": "4 (Positive)",
        "link": "https://www.genesys.com/definitions/what-is-workload-management",
        "base_query": "Raj_Heights-The_Global_School",
        "keyword": "Workload Management"
    }
]