[
    {
        "title": "Shivraj Singh Chouhan - Wikipedia",
        "snippet": "Shivraj Singh Chouhan is an Indian politician and the current Union Minister of Agriculture and Farmers' Welfare. He was the longest serving Chief Minister of Madhya Pradesh and a leader of the Bharatiya Janata Party.",
        "sentiment": "4 (Positive)",
        "link": "https://en.wikipedia.org/wiki/Shivraj_Singh_Chouhan"
    },
    {
        "title": "5-time MP, 4-term CM, what next for Shivraj Singh Chouhan?",
        "snippet": "In the last week of November 2005, Shivraj Singh Chouhan was sent by the BJP Parliamentary Board as the chief minister of the state. Babulal Gaur, the CM for 15 months, was asked to resign.",
        "sentiment": "4 (Positive)",
        "link": "https://timesofindia.indiatimes.com/city/bhopal/5-time-mp-4-term-cm-what-next-for-shivraj-singh-chouhan/articleshow/105916787.cms"
    },
    {
        "title": "4-time MP CM Shivraj Singh Chouhan sworn in as union minister for first ...",
        "snippet": "Shivraj Singh ran in the Raghogarh elections against the incumbent Chief Minister Digvijaya Singh but lost. Chouhan, the state BJP president, was appointed as Madhya Pradesh's Chief Minister in 2005.",
        "sentiment": "4 (Positive)",
        "link": "https://www.hindustantimes.com/india-news/4time-mp-cm-shivraj-singh-chouhan-sworn-in-as-union-minister-for-first-time-101717949456591.html"
    },
    {
        "title": "Union Minister Shri Shivraj Singh Chouhan officially takes charge of ...",
        "snippet": "Union Minister Shri Shivraj Singh Chouhan today took charge of the Ministry of Agriculture and Farmers Welfare. Speaking with media on the occasion, Shri Chauhan said he is happy to say that the first decision taken by the Prime Minister yesterday was in the interest of the farmers. He said the Prime Minister has resolved to double the income ...",
        "sentiment": "5 (Positive)",
        "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2024036"
    },
    {
        "title": "Meghalaya is a treasure trove of agricultural wealth: Shivraj Singh Chouhan",
        "snippet": "Shillong, Jan 9: Union Agriculture Minister Shivraj Singh Chauhan on Thursday said that Meghalaya is a treasure trove of agriculture and the hill state has immense potential to excel in the field. Attending an expo that commenced today at the ICAR Research Complex at Meghalaya's Umiam, he, in his address, praised the potential of Meghalaya […]",
        "sentiment": "4 (Positive)",
        "link": "https://theshillongtimes.com/2025/01/09/meghalaya-is-a-treasure-trove-of-agricultural-wealth-shivraj-singh-chouhan/"
    },
    {
        "title": "Shivraj Singh Chouhan Wiki, Age, Wife, Family, Caste, Children ...",
        "snippet": "Learn about the life and political journey of Shivraj Singh Chouhan, the current Chief Minister of Madhya Pradesh and a prominent leader of BJP. Find out his age, family, caste, achievements, controversies and more from this comprehensive wiki page.",
        "sentiment": "5 (Positive)",
        "link": "https://wikibio.in/shivraj-singh-chouhan/"
    },
    {
        "title": "Shivraj Singh Chouhan - Times of India",
        "snippet": "Shivraj Singh Chouhan is an Indian politician and a member of the Bharatiya Janata Party (BJP). He has served as the chief minister of Madhya Pradesh for three non-consecutive terms, from 2005 to ...",
        "sentiment": "4 (Positive)",
        "link": "https://timesofindia.indiatimes.com/topic/shivraj-singh-chouhan"
    },
    {
        "title": "Shivraj Singh Chouhan calls for reducing price gap between farmers and ...",
        "snippet": "Agriculture Minister Shivraj Singh Chouhan on Saturday urged states to provide suggestions for bridging the gap between consumer prices and the remuneration received by farmers for agricultural ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.financialexpress.com/policy/economy-shivraj-singh-chouhan-calls-for-reducing-price-gap-between-farmers-and-consumers-3707311/"
    },
    {
        "title": "Modi's Cabinet: 4-time MP CM Shivraj Singh Chouhan gets Agriculture and ...",
        "snippet": "Shivraj Singh Chouhan, a veteran leader and four-time Chief Minister of Madhya Pradesh, has been assigned the Ministry of Agriculture and Farmers' Welfare, Ministry of Rural Development, and Ministry of Panchayati Raj portfolios. Known as 'mama' and 'paon-paon wale bhaiya', Chouhan's appointment as the Union Agriculture Minister is expected to bring fresh impetus to government efforts in ...",
        "sentiment": "4 (Positive)",
        "link": "https://economictimes.indiatimes.com/news/politics-and-nation/modis-cabinet-4-time-mp-cm-shivraj-singh-chouhan-gets-agriculture-and-rural-development-ministries/articleshow/110879443.cms"
    },
    {
        "title": "शिवराज सिंह चौहान - विकिपीडिया",
        "snippet": "शिवराज सिंह चौहान का जन्म ५ मार्च १९५९ को हुआ। उनके पिता का नाम श्री प्रेमसिंह चौहान और माता श्रीमती सुंदरबाई चौहान हैं। उन्‍होंने भोपाल के ...",
        "sentiment": "4 (Positive)",
        "link": "https://hi.wikipedia.org/wiki/शिवराज_सिंह_चौहान"
    },
    {
        "title": "Shivraj Singh Chouhan - YouTube",
        "snippet": "Official Channel of Union Minister Shri Shivraj Singh Chouhan. This Channel Provides All relevant information about the official programs, schemes, and Plans...",
        "sentiment": "4 (Positive)",
        "link": "https://www.youtube.com/chouhanshivraj"
    },
    {
        "title": "Shivraj Singh Chouhan: Farmers' Friend - Open The Magazine",
        "snippet": "The 100-odd 'farm' villages are a substantial electorate and BJP has asked Shivraj Singh Chouhan, Union agriculture minister and former Madhya Pradesh chief minister, to lead its outreach in these urban-rural pockets where land use has changed over the years. According to his office, Chouhan was \"deeply moved\" when he heard of the woes ...",
        "sentiment": "4 (Positive)",
        "link": "https://openthemagazine.com/feature/shivraj-singh-chouhan-farmers-friend/"
    },
    {
        "title": "Shivraj Singh Chouhan - Facebook",
        "snippet": "Shivraj Singh Chouhan. 4,843,381 likes · 106,083 talking about this. भाई और मामा | Minister of Agriculture and Farmers Welfare , Minister of Rural Development, Government of India, Former Chief...",
        "sentiment": "4 (Positive)",
        "link": "https://www.facebook.com/ChouhanShivraj/"
    },
    {
        "title": "Shivraj Singh Chouhan - YouTube",
        "snippet": "Official Channel of Union Minister Shri Shivraj Singh Chouhan. This Channel Provides All relevant information about the official programs, schemes, and Plans...",
        "sentiment": "4 (Positive)",
        "link": "https://www.youtube.com/@ChouhanShivraj"
    },
    {
        "title": "Why BJP picked Mohan Yadav as Madhya Pradesh CM over Shivraj Singh Chouhan",
        "snippet": "Mohan Yadav, a three-time MLA from Ujjain South, will succeed Shivraj Singh Chouhan for the top job in Madhya Pradesh. There were reports earlier that the saffron party will pick new faces for the three states it won in the Hindi heartland",
        "sentiment": "4 (Positive)",
        "link": "https://www.firstpost.com/explainers/why-bjp-picked-mohan-yadav-as-madhya-pradesh-cm-over-shivraj-singh-chouhan-13491592.html"
    },
    {
        "title": "Integrated Government Online Directory : Organization Details ...",
        "snippet": "Shri Shivraj Singh Chouhan Minister: Ministry of Agriculture & Farmers Welfare Ph: 23383370, 23782691 Fax: 23384129 Ph (R): 23794697 Address: Room No- 120, Krishi Bhawan, New Delhi agrimin[dot]india[at]gmail[dot]com ...",
        "sentiment": "5 (Positive)",
        "link": "https://igod.gov.in/organization/FM4zv3QBGZk0jujBKgGW"
    },
    {
        "title": "Shivraj Singh Chouhan (@chouhanshivrajsingh) - Instagram",
        "snippet": "5M Followers, 33 Following, 12K Posts - Shivraj Singh Chouhan (@chouhanshivrajsingh) on Instagram: \"भाई और मामा, Minister of Agriculture and Farmers Welfare, Minister of Rural Development, Government of India\"",
        "sentiment": "4 (Positive)",
        "link": "https://www.instagram.com/chouhanshivrajsingh/"
    },
    {
        "title": "Shivraj Singh Chouhan - Deccan Herald",
        "snippet": "Read stories listed under on Shivraj Singh Chouhan. Chouhan talked about the women-centric schemes launched during his tenure as the Madhya Pradesh chief minister, including the direct-benefit ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.deccanherald.com/tags/shivraj-singh-chouhan"
    },
    {
        "title": "Shivraj Singh Chauhan Birth Chart | Shivraj Singh Chauhan Kundli ...",
        "snippet": "Shivraj Singh Chauhan birth chart, Shivraj Singh Chauhan kundli and Shivraj Singh Chauhan horoscope by AstroSage.com based date of birth, time of birth and place of birth of Shivraj Singh Chauhan Rashifal Kundli Rashifal 2025 Horoscope 2025 Today Horoscope Calendar 2025 Chat with Astrologer",
        "sentiment": "5 (Positive)",
        "link": "https://www.astrosage.com/celebrity-horoscope/shivraj-singh-chauhan-birth-chart.asp"
    },
    {
        "title": "Shivraj Singh Chouhan vs Speaker Madhya Pradesh Legislative ... on 13 ...",
        "snippet": "Shivraj Singh Chouhan vs Speaker Madhya Pradesh Legislative ... on 13 April, 2020 Equivalent citations: AIRONLINE 2020 SC 439 ... Mr Mukul Rohatgi, learned Senior Counsel who has appeared in support of the petition filed by Shivraj Singh Chauhan and nine other BJP Members submitted that: (i) Twenty-two Members no longer owing allegiance to the ...",
        "sentiment": "1 (Negative)",
        "link": "https://indiankanoon.org/doc/179738554/"
    },
    {
        "title": "Shivraj Singh Chouhan - Hindustan Times",
        "snippet": "Shivraj Singh Chouhan- Read the latest articles by Shivraj Singh Chouhan on the trending topics, breaking news and top headlines at Hindustan Times. Explore. Search Friday, Jan 03, 2025.",
        "sentiment": "1 (Negative)",
        "link": "https://www.hindustantimes.com/author/shivraj-singh-chouhan-101724006839868"
    },
    {
        "title": "Shivraj Singh Chouhan: 4-Time Chief Minister Eyes 5th Stint In Office",
        "snippet": "Shivraj Singh Chouhan joined the Rashtriya Swayamsevak Sangh (RSS) at the age of 13 and served the organisation's student wing, the Akhil Bharatiya Vidyarthi Parishad, in various roles.",
        "sentiment": "4 (Positive)",
        "link": "https://www.ndtv.com/india-news/madhya-pradesh-elections-2023-shivraj-singh-chouhan-4-time-chief-minister-eyes-5th-stint-in-office-4486250"
    },
    {
        "title": "Shivraj Singh Chouhan CG Visit: केंद्रीय मंत्री शिवराज सिंह आज ...",
        "snippet": "Shivraj Singh Chouhan CG Visit: शिवराज के दौरे का शेड्यूल केंद्रीय कृषि मंत्री चौहान 10 जनवरी को सुबह 8.45 बजे दिल्ली से विशेष विमान से 11.15 बजे रायपुर पहुंचेंगे। इसके बाद ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.patrika.com/raipur-news/shivraj-singh-chouhan-cg-visit-union-minister-shivraj-singh-is-on-tour-of-chhattisgarh-today-19303132"
    },
    {
        "title": "Third Chouhan ministry - Wikipedia",
        "snippet": "This is a list of Council of ministers from Shivraj Singh Chouhan's third cabinet of Madhya Pradesh starting from December 2013 till December 2018. Shivraj Singh Chouhan is the leader of BJP who was sworn in the Chief Minister of Madhya Pradesh in December 2013.",
        "sentiment": "4 (Positive)",
        "link": "https://en.wikipedia.org/wiki/Third_Chouhan_ministry"
    },
    {
        "title": "शिवराज सिंह चौहान की जाति क्या है - Shivraj Singh Chouhan Caste",
        "snippet": "shivraj singh cast, shivraj singh chouhan cast hindi, shivraj singh chouhan cast name, shivraj singh chauhan ki cast, shivraj singh chauhan kaun hai",
        "sentiment": "4 (Positive)",
        "link": "https://www.bhopalsamachar.com/2018/11/shivraj-singh-chouhan-caste.html"
    },
    {
        "title": "Union Minister Shri Shivraj Singh Chouhan launches web portal for ...",
        "snippet": "Modi government is committed to increase farmer's income taking various measures: Shri Shivraj Singh Chouhan Investments worth ₹72,000 crore have been mobilised with ₹43,000 crore already sanctioned for 67,871 projects under Agriculture Infrastructure Fund till today: Shri Chouhan Objectives behind this initiative will be helpful in ...",
        "sentiment": "4 (Positive)",
        "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2029322"
    },
    {
        "title": "Shivraj Singh Chauhan v. Speaker M P(2020) - Lawyersclubindia",
        "snippet": "Bench: Justices D Y Chandrachud, Ajay Rastogi; Appellant: Shivraj Singh Chauhan; Respondent: Speaker Madhya Pradesh Legislative; Issues • Whether any claim under Article 32 relates to the enforcement of rights under Part III of the Constitution?",
        "sentiment": "1 (Negative)",
        "link": "https://www.lawyersclubindia.com/judiciary/shivraj-singh-chauhan-v-speaker-m-p-2020-madhya-pradesh-government-crisis-4966.asp"
    },
    {
        "title": "Modi Cabinet 2024: Shivraj Singh Chouhan takes charge of Agriculture ...",
        "snippet": "Shivraj Singh Chouhan took charge of the Union Agriculture Ministry on June 11 and vowed to work for farmers' welfare, which is the government's top priority.",
        "sentiment": "4 (Positive)",
        "link": "https://www.thehindu.com/news/national/nda-cabinet-shivraj-singh-chouhan-takes-charge-of-agriculture-ministry-farmers-welfare-top-priority/article68276700.ece"
    },
    {
        "title": "Shivraj Singh Chouhan writes to Atishi, alleges AAP govt is blocking ...",
        "snippet": "Union Agriculture Minister Shivraj Singh Chouhan, in his letter, said that the farmers in Delhi have not received any benefits under the agricultural schemes by the Centre and claimed that the AAP ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.indiatvnews.com/news/india/shivraj-singh-chouhan-writes-to-atishi-alleges-aap-govt-is-blocking-central-schemes-for-farmers-2025-01-02-969196"
    },
    {
        "title": "Shivraj Singh Chouhan Holds Pre-Budget Consultations with Key ...",
        "snippet": "Union Minister Shivraj Singh Chouhan held pre-budget consultations with key stakeholders at Krishi Bhawan, New Delhi, on December 16, 2024. This significant meeting brought together farmers, agricultural entrepreneurs, Farmer Producer Associations, and representatives from various agriculture-related organizations. ...",
        "sentiment": "4 (Positive)",
        "link": "https://krishijagran.com/news/shivraj-singh-chouhan-holds-pre-budget-2025-26-consultations-with-key-agriculture-stakeholders/"
    },
    {
        "title": "Shivraj Singh Chouhan - YouTube",
        "snippet": "Official Channel of Union Minister Shri Shivraj Singh Chouhan. This Channel Provides All relevant information about the official programs, schemes, and Plans...",
        "sentiment": "4 (Positive)",
        "link": "https://www.youtube.com/@ChouhanShivraj/streams"
    },
    {
        "title": "'Where am I going?' Shivraj Singh Chouhan bids farewell, sort of",
        "snippet": "Shivraj Singh Chouhan's farewell was befitting of Shivraj Singh Chouhan's fight. As the day finally arrived Tuesday for Madhya Pradesh's longest-serving Chief Minister to leave the CM House in Bhopal, after contributing to the BJP's historic win in the state, there were tears, hugs, the ubiquitous Ladli Behnas and, above all, appeals to Chouhan to \"not leave\".",
        "sentiment": "4 (Positive)",
        "link": "https://indianexpress.com/article/political-pulse/shivraj-singh-chouhan-farewell-9065483/"
    },
    {
        "title": "Modi cabinet 3.0 portfolio allocation | Shivraj Singh Chouhan, other ...",
        "snippet": "Shivraj Singh Chouhan has been appointed as Union agriculture and rural development minister in Prime Minister Narendra Modi's new Cabinet. Explore. Search Monday, Jan 06, 2025.",
        "sentiment": "4 (Positive)",
        "link": "https://www.hindustantimes.com/india-news/narendra-modi-government-3-0-list-shivraj-chouhan-other-first-timers-who-got-portfolios-pm-cabinet-allocation-2024-101718033290739.html"
    },
    {
        "title": "Madhya Pradesh CM interview: 'Mera naam Shivraj Singh Chouhan hai ...",
        "snippet": "In a conversation with The Indian Express, Chief Minister Shivraj Singh Chouhan says small things like being named the chief ministerial candidate cannot affect his personality or work as he believes that how one works is more important than what one is. He argues that his welfare schemes cannot be labelled as \"revdi\" and responds to Kamal ...",
        "sentiment": "1 (Negative)",
        "link": "https://indianexpress.com/article/political-pulse/madhya-pradesh-cm-interview-shivraj-singh-chouhan-small-things-dont-affect-me-9014766/"
    },
    {
        "title": "Shivraj Singh Chouhan - YouTube",
        "snippet": "Official Channel of Union Minister Shri Shivraj Singh Chouhan. This Channel Provides All relevant information about the official programs, schemes, and Plans...",
        "sentiment": "4 (Positive)",
        "link": "https://www.youtube.com/user/ChouhanShivraj/streams"
    },
    {
        "title": "Union Minister Shri Shivraj Singh Chouhan reviews rural development ...",
        "snippet": "Union Minister Shri Shivraj Singh Chouhan informed during the review meeting that under the MGNREGA scheme in Tamil Nadu, the Central Government has given wages worth Rs. 12 thousand 603 crores to the laborers in the year 2023-24. This year also, 7 thousand 220 crore rupees have been released so far, so that no worker remains unemployed here ...",
        "sentiment": "4 (Positive)",
        "link": "https://pib.gov.in/PressReleaseIframePage.aspx?PRID=2089059"
    },
    {
        "title": "Shivraj Singh Chouhan (@chouhanshivrajsingh) - Instagram",
        "snippet": "5M Followers, 45 Following, 12K Posts - Shivraj Singh Chouhan (@chouhanshivrajsingh) on Instagram: \"भाई और मामा, Minister of Agriculture and Farmers Welfare, Minister of Rural Development, Government of India\"",
        "sentiment": "4 (Positive)",
        "link": "https://www.instagram.com/chouhanshivrajsingh/reels/"
    },
    {
        "title": "Shivraj Singh Chouhan Calls for Accelerated Efforts in ... - Devdiscourse",
        "snippet": "The Minister of Agriculture and Farmers' Welfare, Shri Shivraj Singh Chouhan, has called on states to intensify efforts under the National Mission on Edible Oils - Oil Palm (NMEO-OP), a flagship initiative aimed at bolstering India's self-reliance in edible oil production. The mission seeks to reduce import dependency, enhance farmer ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.devdiscourse.com/article/law-order/3216773-shivraj-singh-chouhan-calls-for-accelerated-efforts-in-edible-oil-self-sufficiency-drive"
    },
    {
        "title": "Shivraj Singh Chouhan Advocates for 'One Nation, One Election'",
        "snippet": "Union Agriculture Minister Shivraj Singh Chouhan urged Assam residents to back the 'One Nation, One Election' initiative to ensure uninterrupted governance. Inaugurating 50,000 houses under PMAY-G, he emphasized rural development and distributed agricultural equipment, aligning with the government's vision of nationwide progress.",
        "sentiment": "4 (Positive)",
        "link": "https://www.devdiscourse.com/article/law-order/3220698-shivraj-singh-chouhan-advocates-for-one-nation-one-election"
    },
    {
        "title": "MP Shivraj Singh Chouhan Govt Schemes 2025 List Hindi PDF Download",
        "snippet": "The complete MP Shivraj Singh Chouhan Govt. Schemes List 2025 includes 330+ major Sarkari Yojana launched in the past 1 year of CM after taking office. MP government schemes list includes chief minister's flagship schemes like Indira Grah Jyoti Yojna, Jai Kisan Fasal Rin Mafi Yojna, Ladli Lakshmi Yojna, CM Kanya Vivah / Nikah Yojna etc. ...",
        "sentiment": "5 (Positive)",
        "link": "https://sarkariyojana.com/mp-shivraj-singh-chouhan-govt-schemes-list/"
    },
    {
        "title": "Union Minister Shri Shivraj Singh Chouhan addresses the Global Soil ...",
        "snippet": "Union Agriculture & Farmers' Welfare and Rural Development Minister Shri Shivraj Singh Chouhan addressed the Global Soils Conference 2024 organized in PUSA New Delhi today through video conferencing. Union Agriculture minister said that the basic mantra of Indian culture is the belief in a shared consciousness among all beings. Our sages have ...",
        "sentiment": "2 (Negative)",
        "link": "https://pib.gov.in/PressReleaseIframePage.aspx?PRID=2074585"
    },
    {
        "title": "Shivraj Singh Chouhan Latest News, Photos and Videos - India TV News",
        "snippet": "Shivraj Singh Chouhan, Agriculture Minister, responds to why onion prices are high India | November 17, 2024 23:25 IST . Agriculture Minister Shivraj Singh Chouhan said that onion prices are on ...",
        "sentiment": "4 (Positive)",
        "link": "https://www.indiatvnews.com/topic/shivraj-singh-chouhan"
    },
    {
        "title": "Govt launches survey to identify new rural housing beneficiaries, says ...",
        "snippet": "The government on Tuesday initiated a survey of kutcha houses across the country to identify new beneficiaries of its rural housing scheme, rural development and agriculture minister Shivraj Singh Chouhan said.",
        "sentiment": "5 (Positive)",
        "link": "https://economictimes.indiatimes.com/news/india/govt-launches-survey-to-identify-new-rural-housing-beneficiaries-says-shivraj-singh-chouhan/articleshow/114055269.cms"
    },
    {
        "title": "Govt allocates 3.8 mn houses under new PMAY-G norms this fiscal, no ...",
        "snippet": "Rural Development Minister Shivraj Singh Chouhan announced the allocation of 3.8 million houses under PMAY-G across 18 states, with an initial release of Rs 10,668 crore. The ministry has spent Rs 1.03 lakh crore this fiscal year on various schemes. A new survey will identify more beneficiaries under relaxed eligibility criteria. The Lakhpati Didi scheme now boasts 11.5 million members.",
        "sentiment": "1 (Negative)",
        "link": "https://economictimes.indiatimes.com/industry/services/property-/-cstruction/govt-allocates-3-8-mn-houses-under-new-pmay-g-norms-this-fiscal-no-poor-person-to-be-left-out-shivraj-singh-chouhan/articleshow/115965663.cms"
    },
    {
        "title": "List of chief ministers of Madhya Pradesh - Wikipedia",
        "snippet": "Shivraj Singh Chouhan of the Bharatiya Janata Party was the longest-serving chief minister of the state, serving for over 16 and half years. Chouhan was succeeded by Dr. Mohan Yadav of his own party after the 2023 elections, which was seen as a landslide victory [2] for the BJP. Precursor states",
        "sentiment": "4 (Positive)",
        "link": "https://en.wikipedia.org/wiki/List_of_chief_ministers_of_Madhya_Pradesh"
    },
    {
        "title": "Shivraj Singh Chouhan(Bharatiya Janata Party(BJP ... - MyNeta",
        "snippet": "SHIVRAJ SINGH CHOUHAN (Winner) BUDHNI (SEHORE) Party:BJP . S/o|D/o|W/o: Late Prem Singh Chouhan . Age: 64 . Name Enrolled as Voter in: 156 Budhni (Madhya Pradesh) constituency, at Serial no 455 in Part no 26 . Self Profession:Salary as Chief Minister, Agriculture and Industry etc.",
        "sentiment": "3 (Neutral)",
        "link": "https://myneta.info/MadhyaPradesh2023/candidate.php?candidate_id=1489"
    },
    {
        "title": "'Abuse me, but help Delhi farmers': Shivraj Chouhan hits back at Atishi ...",
        "snippet": "Days after Delhi Chief Minister Atishi's remarks that \"the condition of farmers has never been as bad as it was during the BJP's reign and the party talking about farmers is like Dawood giving a sermon on non-violence,\" Union Agriculture Minister Shivraj Singh Chouhan on Tuesday hit back, saying \"call me Dawood or abuse me, but help Delhi farmers by implementing the Central schemes.\"",
        "sentiment": "1 (Negative)",
        "link": "https://indianexpress.com/article/cities/delhi/delhi-farmers-shivraj-chouhan-atishi-dawood-remark-9765588/"
    },
    {
        "title": "Shivraj Singh Chauhan Latest News, Updates in Hindi - आज तक",
        "snippet": "शिवराज सिंह चौहान (Shivraj Singh Chouhan) एक भारतीय राजनेता और भारतीय जनता पार्टी (भाजपा) (BJP) के सदस्य हैं. उन्होंने मार्च 2020 में चौथी बार मध्य प्रदेश ...",
        "sentiment": "1 (Negative)",
        "link": "https://www.aajtak.in/topic/shivraj-singh-chauhan"
    },
    {
        "title": "Shivraj Singh Chouhan - Facebook",
        "snippet": "Shivraj Singh Chouhan. 4,843,148 likes · 111,777 talking about this. भाई और मामा | Minister of Agriculture and Farmers Welfare , Minister of Rural Development, Government of India, Former Chief...",
        "sentiment": "4 (Positive)",
        "link": "https://www.facebook.com/ChouhanShivraj/photos/"
    },
    {
        "title": "Union Agriculture Minister Shri Shivraj Singh Chouhan Launches AgriSURE ...",
        "snippet": "In his keynote address, Shri Shivraj Singh Chouhan highlighted the transformative potential of the newly launched initiatives. The Minister mentioned that, the launch of the AgriSURE Fund is a continuation of previous efforts of the government to ensure that every farmer in India has the technological support needed to thrive.\" He further ...",
        "sentiment": "5 (Positive)",
        "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2051466"
    },
    {
        "title": "Sadhna Singh Age, Husband, Family, Biography & More",
        "snippet": "Some Lesser Known Facts About Sadhna Singh. She, along with her husband Shivraj Singh Chouhan, used to organize mass marriage programmes in Sehore district of Madhya Pradesh.The couple used to do 'Kanyadaan' of financially unsound girls.",
        "sentiment": "5 (Positive)",
        "link": "https://starsunfolded.com/sadhna-singh/"
    },
    {
        "title": "'Main Shivraj Hoon': The defiant fight of Shivraj Singh Chouhan",
        "snippet": "Whatever the BJP leadership's plans for him, Madhya Pradesh Chief Minister Shivraj Singh Chouhan isn't going gently into the night. Far from it. He is actively embracing the limelight in a way that few in the Narendra Modi-centric party have dared before. Two weeks ago, the once self-effacing leader, whose humble image helped him into a ...",
        "sentiment": "5 (Positive)",
        "link": "https://indianexpress.com/article/political-pulse/shivraj-singh-chouhan-mp-elections-8971433/"
    },
    {
        "title": "Category : Shivraj Singh Chouhan - Wikimedia",
        "snippet": "Shivraj Singh Chouhan meeting the Union Minister for Road Transport & Highways and Shipping, Shri Nitin Gadkari, in New Delhi. The Minister of State for Road Transport & Highways and Shipping, Shri Krishan Pal is also seen.jpg 2,200 × 1,451; 867 KB",
        "sentiment": "4 (Positive)",
        "link": "https://commons.wikimedia.org/wiki/Category:Shivraj_Singh_Chouhan"
    },
    {
        "title": "Union Minister Shri Shivraj Singh Chouhan to launch Nayi Chetna 3.0 ...",
        "snippet": "Union Minister of Rural Development and Agriculture & Farmers' Welfare, Shri Shivraj Singh Chouhan will launch the third edition of Nayi Chetna - Pahal Badlaav Ki, a national campaign against gender-based violence on 25th November 2024 in Rang Bhawan Auditorium, All India Radio, Sansad Marg, New Delhi.",
        "sentiment": "5 (Positive)",
        "link": "https://pib.gov.in/PressReleaseIframePage.aspx?PRID=2076244"
    }
]